#День4 встречаем Юлю после ужина за воротами
#
label uvao_D4_meet_Yulia_at_evening:
    $ persistent.sprite_time = "sunset"
    scene bg ext_square_sunset
    play ambience ambience_camp_center_evening fadein 1
    window show

    "К воротам лагеря я шёл целеустремлённой походкой, не глядя по сторонам и постаравшись изобразить на лице чувство ответственности за выполнение очень важного дела, которое мне, несомненно, поручили."
    "В итоге, до ворот я добрался без помех - то ли проявились дремавшие раньше способности к лицедейству, то ли до меня попросту не было никому дела."
    stop ambience fadeout 1
    window hide
    scene bg ext_no_bus_sunset with fade
    play ambience ambience_camp_entrance_evening fadein 1
    window show
    "Быстро оглянувшись и убедившись, что за мной никто не увязался, я вышел на стоянку."
    "Здесь тоже было пусто."
    "Я постоял, прислушиваясь."
    show uv normal far at fleft with easeinleft
    uv "Эй, иди сюда!"
    "Из кустов слева высунулась Юля. Осмотревшись по сторонам, она выбралась на стоянку."
    show uv normal at left with dissolve
    uv "Принёс?"
    me "Конечно, как обещал!"
    "Я протянул ей прихваченную с ужина булочку."
    show uv smile at center with dissolve
    "Юля проворно сцапала гостинец и, усевшись на поребрик, окружающий статую пионера, впилась в сдобу ровными белыми зубками."
    "Машинально отметив про себя, что клыки у неё тоньше и длиннее, чем обычно можно встретить у людей, я тоже присел чуть в стороне."
    show uv smile close at center with dissolve
    me "Давно ждёшь?"
    "Она неопределённо мотнула головой."
    "Похоже, моя новая знакомая целиком сосредоточилась на еде."
    "Она жмурилась от удовольствия и явно не собиралась отвлекаться на меня. Тем не менее, я попробовал ещё раз."
    me "А ты где живёшь? Где-то в лагере? Или в лесу?"
    uv "Нев. Тав."
    "Невнятно сказала Юля сквозь булку и неопределённо махнула рукой куда-то вдоль забора."
    "Она доела остатки и со вздохом облизнулась."
    show uv normal close at center with dspr
    uv "Вкусно. Жалко только, что мало."
    uv "У тебя с собой больше ничего нет?"
    "Я улыбнулся."
    me "Нет, с собой нет. А кстати, ты конфеты любишь?"
    dreamgirl "Девочка, девочка, пойдём со мной в подвал! Я тебе там конфет дам!"
    show uv laugh close at center with dspr
    uv "Конечно люблю! А у тебя есть конфеты?"
    "Она явно оживилась и снова облизнулась."
    me "Я могу принести, если хочешь.{w} Может, я бы в гости к тебе зашёл? Ну туда, где ты живёшь."
    show uv surprise close at center with dspr
    "Кажется, Юлю такая идея искренне удивила."
    "Впрочем, через пару секунд она улыбнулась и кивнула."
    show uv smile close at center with dspr
    uv "А и вправду, приходи. И конфеты приноси. Смотри, не забудь!"
    me "Так а куда приходить-то?"
    show uv normal close at center with dspr
    uv "Так говорю же - я там живу!"
    "Сказала Юля нетерпеливо и снова махнула рукой куда-то вдоль забора."
    "Вероятно, на моём лице отражалась некоторая заторможенность мыслительных процессов, потому что она снисходительно улыбнулась и добавила:"
    show uv smile close at center with dspr
    uv "Там старый корпус, за лесом, но к нему тропинка ведёт - не заблудишься."
    me "А ког…"
    show uv upset at center with dissolve
    "Начал было я, но Юля вдруг вздрогнула и навострила ушки."
    "Из-за ворот донеслись детские голоса, потом - приглушённый взрыв смеха."
    hide uv with easeoutleft
    "Я было повернулся обратно к Юле, но той и след уже простыл - только ветки кустов закачались."
    dreamgirl "И что этим пионерам спокойно не сидится?!{w} Лучше бы с умной книжкой посидеть, так нет же, шляются везде, ржут как лошади, мешают серьёзным людям устанавливать контакт с чуждыми формами разума!"
    "В кои-то веки я был согласен с Шизой - в самом деле, из-за них я так толком ничего и не выяснил про эту ушастую."
    "Хорошо хоть, я теперь хотя бы приблизительно знаю, где её искать."
    "Иначе можно было бы до старости бродить по лесу и ничего не найти…"
    "Я с досадой махнул рукой и поплёлся к нашему с вожатой домику."

    stop ambience fadeout 5
    window hide

#    return
