#День4 Ужин"
#
label uvao_uvao_D4_supper:
# Д4-Ужин
#
#

    $ alt_chapter(4, u"Юля. Ужин")
    $ persistent.sprite_time = "sunset"
    $ sunset_time()
    window hide
    scene bg int_dining_hall_people_sunset
    with dissolve
    play ambience ambience_dining_hall_full
    window show
    "Совместить беседу с Виолой и ужин казалось хорошей идеей."
    me "Виола? Можно к вам присоединиться"?
    dreamgirl "Неплохой заход. Ужин, потом пара коктейлей - и она вся твоя!"
    "Она неторопливо оглядела меня с ног до головы."
    cs "Конечно, пионер, присаживайся. Я никогда не против интересной компании за ужином."
    "Как обычно, в этой фразе уместился целый ворох двусмысленностей."
    me "Эээ... На самом деле я хотел поговорить, по поводу вашего утреннего приглашения."
    dreamgirl "Ты что, собрался переиграть её на её же поле?! Без шансов, чувак, без шансов..."
    "Виола понимающе усмехнулась."
    cs "Само собой, приглашение всегда в силе, в любое время дня и ночи. Только предупреди заранее, чтобы я могла подготовить все необходимое."
    "Да, кажется, этот противник мне не по зубам."
    me "Виола, я про местную легенду, девочку-кошку. Я её видел сегодня. И даже парой слов перекинулся."
    "Виола поставила стакан с компотом. Никакой томности во взгляде уже не наблюдалось."
    cs "Видел? Где?"
    me "Да возле домика. Услышал треск за окном, думал, опять Ульянка жуками забрасывать собирается, высунулся. А там она."
    "Виола помолчала, о чём-то размышляя."
    cs "И о чём вы беседовали, если не секрет?"
    me "Да ни о чём практически. Сказала, что я неуклюжий. Ещё что раньше меня видела."
    cs "Интересно. Она не представилась?"
    me "Представилась. Говорит, что раньше её Юлей звали.{w} Мне с вами идти, да?"
    cs "Зачем?"
    me "Ну, как... Аминазину там покушать, или что там у вас..."
    cs "Успокойся, всё с тобой нормально. Неплохо держишься для четвёртого дня в новом мире."
    th "Она знает?! Откуда?"
    me "Что?"
    cs "Что слышал. Не ты первый, пионер."
    me "А... Вы тоже?.."
    cs "Я? Нет, конечно. Я из команды исследователей."
    th "О чёрт. Парень, ты, кажется, серьёзно влип. Сейчас тебя в такое место потащат, что дурдом раем покажется."
    "Виола, кажется, поняла, почему я вдруг побледнел."
    cs "Успокойся, Семён. Никто тебя на ремни резать не собирается. Изучаем мы точки проколов между реальностями, а не тех, кто сквозь них приходит."
    cs "Смысл тебя потрошить? Такой же человек, как и все, ну, жил на двадцать пять лет в будущем, подумаешь."
    th "Уф-ф-ф! Отлегло. Может, и вывернуться получится."
    "Я сложил немногие известные мне факты в кучку."
    me "Я правильно понял, что моё появление здесь и эта... Юля как-то взаимосвязаны?"
    cs "Догадливый. То, что представилось тебе Юлей, одно из проявлений точки прокола. Визуализация, можно сказать. Вы ведь с ней договорились где-то встретится, правильно?"
    me "Ну... Да. После ужина на стоянке."
    cs "У тебя ведь есть смарт-фон?"
    "Последнее слово она выговорила как-то непривычно."
    me "Откуда вы?.. А, ну да. Есть, конечно."
    cs "Попробуй её сфотографировать, и многие вопросы сразу отпадут."
    me "Лад... Подождите, так мне что, к ней идти?"
    cs "А почему нет? Для тебя она безопасна, если специально злить не будешь. Только хочу сразу предупредить насчёт чересчур близких контактов — тут тебе изделие №2 не поможет."
    "Я снова покраснел."
    me "Да я и не думал даже!"
    cs "Ну-ну. Смотри, тут ты не котятами обзавестись рискуешь. Понимаешь меня, пионер?"
    me "Угу."
    cs "Вот и хорошо. Она что-нибудь еще говорила? Не просила чего-нибудь принести?"
    me "Просила. Булку просила. Мышей, говорит, сложно ловить, а булки ещё и вкуснее."
    cs "Ну так бери и иди. И постарайся побольше с ней говорить, всё-таки случай редчайший. Если получится к ней в гости напроситься — совсем хорошо. Ольгу я предупрежу, чтобы не искала тебя."
    me "Ольгу Дмитриевну? Она тоже с вами?"
    cs "Да, отвечает за адаптацию. Иди на своё свидание, пионер, не заставляй аномалию ждать. Потом мне все доложишь."
    me "А… Виола, а я вообще где?"
    cs "Долгий разговор. Да и не в столовой же об этом беседовать?"


    jump uvao_D4_meet_Yulia_at_evening

