# Д5-ужин после палева на стоянке
#
# Используется флаг alt_uvao_D4_viola_morning (ходили к Виоле утром Д4)
# Используется флаг alt_uvao_D5_hentai (хентаили кошочку в бункере)
#
label alt_day5_uvao_spoiled_supper:
    #засоня/болтун с кошочками - ни разу не охотник
    #Семёна воспитывают, огрызаемся, намекнув, что вожатые в лагере тоже не сильно моральны. Получаем немножко инфы от Виолы, ОД в смущении
    $ persistent.sprite_time = "sunset"
    $ sunset_time()
    window hide
    scene bg int_dining_hall_people_sunset
    with dissolve
    play ambience ambience_dining_hall_full fadein 3
    window show

# Столовая на закате
    "К сожалению, кажущееся спокойствие вожатой оказалось временным."
    show mt angry panama pioneer at left with dissolve
    "Войдя следом за мной в столовую, Ольга ухватила меня за плечо и прямиком потащила к столику в дальнем углу, за которым восседала Виолетта наедине со своим ужином."
#    show cs smile2 far at fright with dissolve
    if alt_uvao_D4_viola_morning:
        th "Так… Кажется, мне сейчас предстоит объясняться, почему я больше ни разу не зашёл проведать доктора Виолу…"
        dreamgirl "Да ладно тебе! Скажешь ей честно, что женщин боишься."
        dreamgirl "А если серьёзно, то мне кажется, что Виола не просто медсестра. Очень уж она в тот раз заинтересовалась твоим рассказом."
        dreamgirl "Не удивлюсь, если она решит посадить тебя в карантин - поближе к телу, так сказать."
    else:
        th "Странно… При чём здесь медсестра? Я не ранен, а раз Ольга сама видела Юлю, то понимает, что с головой у меня всё в порядке…"
        dreamgirl "Какая завидная самоуверенность! Человек, регулярно общающийся с внутренним голосом, объявляет себя психически здоровым!"
        dreamgirl "Хотя, если серьёзно, то мне тоже непонятно, при чём здесь Виола. Может быть, в карантин тебя хотят посадить?"
    "Давно заметившая наше приближение Виола смотрела на нас с явным любопытством."
    show cs smile2 at right
    show mt angry panama pioneer at left
    with dissolve
    "Дотащив меня до столика, Ольга отпустила наконец моё плечо и, наклонившись к разглядывающей меня медсестре, что-то принялась быстрым шёпотом ей объяснять, жестикулируя."
    "До меня долетали только отдельные слова: \"…стоянке… контактировал… территории… эвакуация…\""
    th "Э-э-э… Не понял? Эвакуация? Это что, тоже из-за меня?"
    dreamgirl "Кажется, карантин для тебя стал бы меньшим из зол… Боюсь, что препарируют тебя, милый друг, для пользы науки."
    th "Надеешься отсидеться? Извини, боюсь, что не получится. Препарируют обоих."
    show cs normal2 with dspr
    "Тем временем Виола нахмурилась и посмотрела на вожатую."
    cs "Оля, остановись пожалуйста. Я думаю, пока что вполне достаточно. Будь добра, сядь и постарайся успокоиться."
    show mt normal panama pioneer with dspr
    "Хотя Виола говорила спокойным голосом, Ольга как-то сразу сникла и послушно уселась с ней рядом. Виола снова посмотрела на меня."
    cs "А ты, пионер, сходи-ка на раздачу и принеси две порции - себе и вашей вожатой."
    cs "И рюкзак свой положи - никуда он не денется."
    "Идея носить еду всяким истеричным девицам мне совсем не понравилась, но возражать я не решился."
    th "В конце концов, Виола производит впечатление довольно адекватного человека, несмотря на её милые шалости. Да и вообще, надо разобраться сначала, что она на самом деле за птица, а поссориться с ней я всегда успею!"
    hide mt
    hide cs
    with dissolve
    "Сунув рюкзак под стол, я направился за едой."
    "На ужин сегодня снова были картофельное пюре с зелёным горошком и котлеты."
    "Однако даже запах горячей еды не улучшил моего настроения, слишком беспокоил меня предстоящий разговор - а я не сомневался, что он будет непростым."
    th "Они обе явно знают гораздо больше, чем пытаются показать. Ольга ведь нисколько не удивилась, увидев Юлю. Любые эмоции, кроме удивления. Да и Виола явно не выглядит изумлённой происходящим."
    show cs normal2 far at right
    show mt normal pioneer far at left
    with dissolve
    "Балансируя сразу двумя подносами, я начал продвигаться к столику, от которого за мной пристально следили две пары глаз - одна зелёная, другая разноцветная."
    th "Интересно, чем всё это может для меня закончиться?"
    dreamgirl "Известно чем - заспиртуют тебя в большой банке, а может и того хуже - из пионеров исключат!"
    th "В таком случае, я бы, пожалуй, предпочёл худший из этих двух вариантов - быть исключённым."
    dreamgirl "Тогда всё отрицай и ничего не подписывай!"
    th "От тебя никакой пользы!"
    show cs normal2 at right
    show mt normal pioneer at left
    with dissolve
    "Когда я подошёл к столику, негромко переговаривавшиеся о чём-то Ольга и Виолетта замолчали и снова уставились на меня."
    show cs normal2 close at right
    show mt normal pioneer close at left
    with dissolve
    "Поставив подносы, я подавил возникшее внезапно желание бросив всё дать дёру и уселся вместо этого напротив."
    cs "Ты ешь, пионер, ешь. Здоровое питание прежде всего."
    "Виола приглашающе показала на тарелку."
    "Я вспомнил съеденную сегодня банку тушёнки. Это было так давно…{w} Кажется, столетия назад…"
    "Почувствовав, как рот внезапно наполнился слюной, я схватил вилку."
    dreamgirl "Надо же, а ведь только что аппетита не было. Какой же ты непостоянный."
    cs "Ешь и одновременно рассказывай. Я понимаю, что разговаривать с набитым ртом - это вредно для здоровья, но сейчас, как ты сам понимаешь, случай исключительный."
    me "А про что, собственно, рассказывать?"
    "Принимаясь за котлету я покосился на Ольгу. Та сидела молча, но сдерживала себя с явным трудом.{w} Виола, напротив, оставалась совершенно спокойной."
    cs "Как про что? Про нашу легенду лагерную. Тебя же видели вместе с ней. И у меня есть определённые основания полагать, что ты с ней не за пять минут до этого познакомился."
    if alt_uvao_D4_viola_morning:
        cs "Кстати, очень жаль, что ты не зашёл ко мне поделиться информацией. Самостоятельные исследования - это прекрасно, но уверяю тебя, у меня нашлось бы, что рассказать тебе взамен."
    cs "А исходя из того, что тебя никто нигде не мог найти…"
    "Тут вожатая не выдержала."
    show mt angry pioneer close with dspr
    mt "Вот именно! Тебя с утра все ищут, я с ног сбилась, а он шляется неизвестно где… Нет, Виола, дай мне сказать!"
    "Попытавшаяся было вмешаться Виола с достоинством откинулась на спинку стула, а Ольга продолжила, переключившись внезапно на неё:"
    mt "Ты что, беды хочешь? У нас уже пострадавшие! Мало тебе Александра? Может быть, ты хочешь, чтобы вышло как с Ветровым, а?!"
    "Негромкий хлопок Виолы ладонью по столу прозвучал в притихшей столовой как пистолетный выстрел."
    show mt normal pioneer close with dspr
    "Ольга осеклась на полуслове и уставилась на поднос с нетронутым ужином, тяжело дыша."
    "Выждав немного и убедившись, что большинство присутствующих снова вернулось к ужину, медсестра произнесла всё таким же спокойным, как и раньше, тоном:"
    cs "Оля, не говори ерунды. Никаких серьёзных неприятностей мы не допустим. В конце концов, это наша работа."
    cs "И не надо преувеличивать. Ничего особенного с Трофимовым не случилось - отоспится и дело с концом.{w} Неужели ты думаешь, я оставила бы его одного и отправилась ужинать, будь с ним что-то серьёзное?"
#    show mt shy pioneer close with dspr #не умеет она смущаться, противная!
    "Ольга смущённо потупилась и ничего не ответила. Убедившись, что бунт на корабле подавлен, Виола как ни в чём не бывало обратилась ко мне:"
    cs "Так вот, как я уже говорила, у меня есть определённые основания полагать, что значительную часть сегодняшнего дня ты провёл с визуа… гм… с этим необычным существом."
    cs "Кстати, у неё есть имя? Как-то ты её называешь?"
    me "Она сказала, что её зовут Юля."
    "Кажется, лицо Виолы дрогнуло, когда я произнёс имя, но уже через секунду уверенности в этом у меня не было."
    cs "Очень хорошо. Если мы предположим на минуточку, что ты довольно долго находился с Юлей, то не мог ли ты {i}случайно{/i} видеть, что именно произошло с Александром?"
    "Сквозь ледяное спокойствие на её лице вдруг проступил явный интерес юного натуралиста, которому вот-вот откроется тайна мирового значения - как же всё-таки размножаются ёжики."
    cs "Скажем так, эти данные могут не только помочь твоему товарищу, но и вообще… оказаться весьма полезными.{w} С соответствующими результатами для тебя." #вот здесь хорошо бы перефразировать про соответствующие результаты. Выгоду она ему обещает, попросту говоря.
    th "Собственно говоря, а что я теряю? Всё равно мне играть приходится в тёмную, а Виола явно владеет ситуацией."
    th "Раз уж они и без меня знают о существовании Юли, то и вправду, не рассказать ли им немного про сегодняшний поход?"
    if alt_uvao_D5_hentai:
        th "Разумеется, с некоторыми купюрами. Виолу-то вряд ли будет так просто пронять интимными подробностями, а вот Оленька может смутиться…"
        dreamgirl "Шутник! Ты смотри, и в самом деле {i}об этом{/i} не сболтни сдуру, пусть даже и Виоле! Хотя бы разберись сначала, что здесь к чему, а то и сам подставишься, и хвостатую…"
        th "Да ладно тебе, не учи учёного. Вряд ли именно {i}это{/i} интересует их в первую очередь ."
    if alt_uvao_D4_viola_morning:
        th "И вообще, с учётом намёков Виолы про обмен информацией…"
    "Я открыл было рот, но моим благим намерениям не суждено было исполниться."
    "Сидевшая последние пару минут молча, Ольга внезапно словно взорвалась:"
    show mt angry pioneer close with dspr
    mt "Виола, да ты посмотри на него! Кого ты просишь?! Посмотри на этого безответственного типа! Думаешь он порядочный пионер? Да ему же наплевать на всех!"
    mt "Мало того, что всё время он отлынивал от любых общественных мероприятий, так сегодня вообще весь день шлялся неизвестно где, никого не предупредив!"
    "Растерявшись от такого напора, я хотел было что-то сказать в своё оправдание, но вожатая только отмахнулась и продолжила, не давая мне вставить ни слова."
    mt "А сегодня на стоянке он знаешь что делал? Я увидела - и чуть с ума не сошла! Он с {i}ней целовался{/i}! Целовался, понимаешь?!"
    "В глазах у меня потемнело от ярости. Возникла короткая пауза, которую не преминули заполнить:"
    if alt_uvao_D5_hentai:
        dreamgirl "Ах, жалко она вас {i}там{/i} не видела, вместе! Как ты Юленьку-то за хвост держал! Обзавидовалась бы до смерти!"
    else:
        dreamgirl "Я видел это, и разум мой был помрачен! Не под покровом ночи! Не за глухими стенами и заборами! А с белой простыни! Дщерь человеческая! Даровала мужчине! Свой поцелуй!"
    "Я не стал размениватся на препирательства с Шизой и не стал орать на вожатую, хотя мне этого очень хотелось - и плевал я на последствия!"
    "Ухватившись за край стола так, что пальцы заболели, и слегка наклонившись, я поинтересовался вкрадчивым голосом:"
    me "Как же я могу стать порядочным пионером, если мне не с кого брать пример? Ведь некоторые вожатые, не будем показывать пальцем, тоже не являют собой образец ответственности и нравственности."
    mt "Что ты несёшь?!"
    "Возмутилась Ольга Дмитриевна."
    me "Да я даже не знаю, с чего собственно начать. С вашей «активной» педагогически-воспитательной работы в виде лежания в шезлонге с книгой и загорания на пляже, в то время как пионеры выполняют ваши бессмысленные поручения?"
    show mt rage pioneer close with dspr
    me "…Или, может быть, с ваших вечерних посиделок с физруком?"
    mt "Я не знаю, что ты там себе напридумывал, но…"
    "Ольга побагровела не то от злости, не то от смущения, но теперь уже я решил отыграться по полной и добил:"
    me "Ах да, извините, оговорился! Не посиделок, а полежанок!{w} На пляже."
    show mt shocked pioneer close
    show cs badgirl2 close
    with dspr
    "Я разжал наконец сведённые судорогой пальцы и удовлетворённо откинулся на спинку стула, наслаждаясь результатом."
    "Последняя фраза пришлась не в бровь, а в глаз. Ольга разом сдулась, словно проколотый воздушный шар и, ничего не отвечая, молча смотрела на меня."
    "Я перевёл взгляд на Виолу. Та, похоже, была не слишком-то удивлена. Скромно опустив глаза, она разглядывала стакан с остатками компота, но на её лице явственно проступала ехидная полуулыбка."
    "Снова посмотрев на вожатую, я даже испытал лёгкий укол совести - настолько она на себя была не похожа.{w} Может быть, не стоило сюда Саныча приплетать? Ольга, конечно, та ещё заноза, но её ведь теперь за аморалку и из комсомола исключить могут."
    show cs normal2 close with dspr
    "Над столом повисло напряжённое молчание. За увлекательными разговорами я даже не заметил, что все пионеры давно уже закончили есть и разошлись."
    "Столовая опустела. Дежурные, косясь на нас, подметали пол, протирали столики и поднимали стулья."
    "Эйфория от лёгкой победы быстро улетучивалсь, уступая место раскаянию."
    dreamgirl "Да, лихо ты вожатку уел. Ничего, не переживай - ей это только на пользу пойдёт. Иногда людей надо избавлять от излишней самоуверенности."
    "Я сердито засопел и принялся доедать ужин, пока меня и в самом деле не посадили в карцер."
    "Наконец Виола решила прервать затянувшуюся паузу."
    cs "Семён. Мне кажется мы, как взрослые люди, могли бы найти разумный компромисс."
    cs "Прежде всего, я хочу предупредить тебя о возможной опасности со стороны этого… этой… Юли."
    cs "Мы примерно представляем, {b}что{/b} это такое, и {b}чего{/b} можно от него ожидать. Случались уже э-э-э… прецеденты."
    cs "Конечно, ты можешь не обращать внимания на мои предостережения, но я надеюсь на твою рассудительность."
    "Пока я переваривал услышанное, она повернулась к вожатой, всё ещё пребывающей в состоянии лёгкого шока."
    cs "Оля, я думаю, можно предоставить {i}пионеру{/i} некоторую свободу действий и сделать его пребывание в лагере… более комфортным. В пределах разумного, разумеется."
    show mt normal pioneer close with dissolve
    "Ольга молча кивнула. Виола пристально посмотрела на меня."
    cs "Только не думай, пионер, что это подействовал твой детский шантаж.{w} Просто одна из наших первоочередных задач - следить за психологическим климатом в лагере. На то есть свои причины."
    cs "Надеюсь, ты с умом распорядишься представившимися возможностями. Предложение сотрудничества, если ты не понял, по-прежнему в силе, так что подумай. Обещаю, разочарован ты не будешь."
    "Против обыкновения, последние слова она произнесла серьёзным тоном, безо всяких там игривых интонаций."
    "Убедившись, что высказаться желающих больше нет, она резюмировала:"
    cs "А сейчас, я думаю, нам всем пора идти. Тебе, пионер, отдыхать, а нам с тобой, Оля, надо обсудить пару рабочих вопросов."
    "Не глядя ни на кого, я подхватил рюкзак и чуть ли не бегом бросился вон из столовой."
    jump alt_day5_uvao_evening_dining_hall_exit


    # Chess: Тащемта ужин долен начинаться не с "Ты ешь, ешь, пионер", а со слов ОД по поводу Семёна и кошочки.
    # [08.04.2015 21:24:16] Константин Noir Сычев: Ага, сразу прессинг начинается, значит ?
    # [08.04.2015 21:25:16] Chess: Ога.
    # "Виола, пиздец. Взят с поличным на стоянке, контактировал с кошочкой. Эвакуация, нахер."
    # [08.04.2015 21:25:42] Chess: ОД Юлю боится до усрачки, ибо наслышана.
##############
# План на переделанный вариант:
#######
# ! Сразу начинается в столовой !
# Заходим в столовую, под контролем ОД берём еду. ОД тащит к столикам персонала, к Виоле (ВЦ).
# Шиза раздаёт советы всё отрицать и умереть достойно. Возможно, лаемся с Шизой.
# ОД истерит ("Виола, пиздец. Взят с поличным на стоянке, контактировал с кошочкой. Эвакуация, нахер.")
# ВЦ реагирует стойко. "ОД, успокойся", "Пионер, ешь"
# Вспоминаем консервы (было давно и неправда) и начинаем ЖРАТ невзирая ни на что.
# - Если ходили к ВЦ утром Д4, то ВЦ укоряет, что отказались от сотрудничества, а вместо этого полезли на рожон самостоятельно.
# Снова встревает ОД. Туманно истерит (возможно, ссылается на непонятное "будет как с Ветровым" и т.п.?). Упоминает, что "Трофимов уже пострадал!".
# ВЦ призывает ОД к порядку, говорит что Шурик не так уж плох и вообще поправится. С явным интересом натуралиста: "А кстати, Семён, ты не знаешь, что конкретно с Шуриком случилось?"
# Пока думаем, идти ли на сотрудничество и не рассказать ли ВСЁ, ОД опять наезжает, упирая на несознательность ГГ ("безответственно шлялся неизвестно где") и аморальность ("Целовался с этой... ЭТОЙ")
# - Если хентаили - Шиза ехидно комментирует неполную осведомлённость ОД про поцелуи и не только
# В любом случае озлобляемся и вместо рассказов о Шурике поливаем ОД: бездельничает целыми днями, а по ночам аморальна ("слухами земля полнится")
# ОД возмущена а потом смущена, ВЦ сдержана с ехидцей.
# Обнаруживаем, что столовая опустела и, плюнув на всё, начинаем дожирать.
# ВЦ призывает ГГ к разумному поведению, намекает на страшные опасности, желательность всё-таки посотрудничать немного и готовность поделиться завтра информацией
# ВЦ предлагает компромисс с расширением свобод ГГ, "Только не думай, пионер, что это подействовал твой детский шантаж."
# ВЦ предлагает ГГ идти пока что на, им с ОД надо обсудить и пообщаться.
# Шиза ехидничает про ОД и Саныча
# Сваливаем.
##
# Как результат ветки, в сцену перед отбоем добавляется фраза ОД "Не думай, что ты победил. В моих силах сделать твоё пребывание в этом лагере не то, что более комфортным, но и вообще невыносимым."
##############



# В столовую мы шли вместе с Ольгой Дмитриевной. Всю дорогу она хранила зловещее молчание, которое пугало меня больше самых громких криков. Шедшая со стороны клубов Славя сначала хотела что-то сказать, но потом видимо передумала, посмотрев на мрачное лицо вожатой.
# Впрочем Ольга Дмитриевна, видимо угадав намерение Слави, сама обратилась к активистке.
# ОД:  - Что у тебя, Феоктистова ?
# С: - Да я хотела.. Замялась Славя.
# ОД: - Ну говори, что случилось-то ? 
# С: - Алиса снова Сыроежкину угрожает. А тут ещё эта история с Александром. Он сейчас в медпункте и не может моральную поддержку Сергею оказать.
# ОД: Ох уж, эта Двачевская.. Вздохнула Ольга Дмитриевна.  – Я её ведь предупреждала сколько раз.. 
# Пока Славя, так кстати попавшаяся нам на глаза, отчитывалась вожатой, я решил воспользоваться моментом и проверить снимок Юли на смартфоне. С момента появления Ольги Дмитриевны на стоянке, у меня ведь так и не выдалось случая рассмотреть его как следует. Более того, в тот момент я еле успел спрятать телефон в карман. Хвала рандому, вожатая была так шокирована Юлей, что не обратила на него внимания. 
# Очень кстати остался в бункере и мой рюкзак. Не представляю, что бы подумала наша любимая надзирательница, увидев меня в полной походной выкладке. Надо, кстати, будет сходит  за ним как-нибудь незаметно. Только, боюсь, я у вожатой теперь на особом положении буду..
# Итак: галерея, последние снимки..  ! Мать моя женщина !   !  !!   Вместо ожидаемого изображения Юли я увидел НЕЧТО.  Я не силён в астрономии, но ближе всего к увиденному подходило понятие ГАЛАКТИКА. В угадывающемся силуэте Юли мерцала система из звёзд и звёздных скоплений, межзвёздного газа и пыли, а может даже и тёмной материи.
# Что же это ? Может быть у меня включился какой-то фото-фильтр ? Но я никогда раньше не видел такого  у себя в телефоне. Брак самого снимка ? Тоже маловероятно. Или же.. Сердце вдруг заколотилось с бешенной скоростью. Юля ненастоящая !  Она мне привиделась ! Я схожу с ума !
# Ш: «Да-да, расскажи мне об этом. -  Подключилась к разговору Шиза.  -Ненастоящая кошкодевочка с ненастоящими ушами и ненастоящим хвостом спала у тебя на груди. Ходила вместе с тобой по тоннелям, хрумкала орехи и таскала еду из лагеря. Она существует, поверь мне. Кроме того, вожатая тоже её видела. Получается, она тоже сошла с ума ? Это ведь только гриппом все вместе болеют, а с ума сходят исключительно поодиночке. Уж я-то знаю толк в таких вещах. Да и тебе ли бояться шизы ? Как говорится, зараза к заразе не пристаёт »
# Последний довод Шизы показался мне убедительней всего. 
# С: »Но ЧТО же она тогда такое ?»
# Ш: «А вот этого я пока не знаю, дружок. Мало данных».
# ОД: -Пойдём Семён. Потянула меня за руку вожатая, закончившая свои расспросы. Кажется она немного успокоилась. Отвлеклась, должно быть. И слава Богу. Меньше всего мне хотелось сейчас скандалить. Кажется с момента прибытия в лагерь, я только и занимаюсь отстаиванием своей точки зрения.
# После традиционного мытья рук, мы наконец отправились в столовую.  Там было как всегда – то есть шумно и многолюдно. Пионеры весело болтали и смеялись, не забывая поглощать ужин. И никто из них не представлял, какой неприятный разговор меня сейчас ожидает. Впрочем, я и сам, признаться,  не знал, чего ожидать от Ольги Дмитриевны.  Что она, в конце концов, может мне предъявить ? То, что болтался вне стен лагеря ? Ну болтался и болтался, что с того ? Не я первый в самоволки хожу и не я последний.
# Ш: «А как же Юленька ?»  Шиза в своём репертуаре. Никогда не упустит случая съехидничать.
# Ш: »Да-да, как же наша кошкодевочка ?»
# С: «Не наша. Пока»
# Ш: «А хочется ?»
# С: «Возможно»
# Ш: "Тогда всё отрицай и ничего не подписывай»  И Шиза зашлась демоническим хохотом.
# Я уже хотел сесть за свободный столик около входа, но вожатая остановила меня.
# ОД:  -Не сюда. Во-о-н туда проходи. И показала на стол для персонала  в дальнем углу, где сидела … доктор Виола. 
# Она-то здесь зачем ? Нет, зачем она здесь это понятно. Но зачем мне проходить именно к ней за стол ? Ведь Виолу к воспитанию пионэров привлекали в исключительных случаях. Во избежание, так сказать. А что в моём случае ожидается процесс воспитательный, параллельно с питательным,  не было никаких сомнений. И дело действительно серьёзное. Хорошо, хоть Саныча не привлекли.
# Ш: «Может тебя даже из пионеров исключат». Притворно шмыгнула носом Шиза. «Горе-то какое»
# Не удостоив её ответом, я плюхнулся за стол. Как ни странно, о моём пропитании уже кто-то позаботился. Тарелка с картофельным пюре, дымящаяся, источающая самый что ни на есть восхитительный аромат котлета и горошек.  А компот !? Ах, да, вот и он. Всё как обычно.  Я с наслаждением втянул носом запах горячей еды. Как же мне нравится этот лагерь ! 
# Орехи (которыми я угостился у Юли), хоть и являются ценным источником сложных белков, но в качестве пригодной еды для растущего организма подходят слабо. Да и мало их было. Надеюсь сервировкой стола занималась не Ульянка. Не хотелось бы снова ужинать сколопендрой.
# В: - Ты ешь, ешь, пионер. Приглашающим жестом показал на тарелку Виола.  - Здоровое питание прежде всего.
# Я не заставил себя упрашивать и набросился на еду. Ольга Дмитриевна присела радом. А Виола между тем продолжила:
# В: - Ешь и одновременно рассказывай. Я понимаю, что разговаривать с набитым ртом- это нарушение  всех педагогических и медицинских норм, но сейчас, как ты сам понимаешь, случай исключительный.
# С: - А что собственно рассказывать ? Осведомился я, откусив кусок котлеты.
# В: - Как что ? Спокойно сказал Виола.  – Про нашу легенду лагерную.  Тебя видели вместе с ней. И с ней же ты весь день провёл, как я предполагаю, исходя из того, что тебя никто не мог нигде найти.
# ОД: - Именно так, никто не мог найти. Подключилась к разговору вожатая. - Ты снова игнорируешь  коллективные мероприятия.  Кроме того, у нас здесь Шурик пострадал. А теперь  оказывается ещё и ты подвергаешь свою жизнь опасности.
# С: - Шурик пострадал ? Деланно удивился я. Видимо, уловив что-то, Виола пристально посмотрела на меня, но ничего не сказала. А вот вожатая кажется ничего не заметила.
# ОД :- Да, потерялся в лесу. А когда мы нашли его, вёл себя странно, пытался напасть. Мы смогли его успокоить..
# Как же, видел-видел. Методы самые что ни на есть пионерские.
# ОД: ..- смогли успокоить, но ты, между прочим, должен был помочь нам  в поисках. Так тебе никогда не стать порядочным пионером ! 
# Да, кажется моё собственное достоинство всё-таки нуждается в отстаивании.  Но без скандала !
# С: - Ольга Дмитриевна.  Как можно более деловым тоном обратился я к вожатой.  – А ведь некоторые вожатые, не будем показывать пальцем, тоже не являют собой образец нравственности. Как же я могу стать порядочным пионером, если мне не с кого брать пример ?
# ОД: - Семён. Что ты несёшь !?  Возмутилась Ольга Дмитриевна.
# С: - Да я даже не знаю, с чего собственно начать. С вашей «активной» педагогическо-воспитательной работы, в виде лежания в шезлонге с книгой, или с загорания на пляже, в то время как подконтрольные вам пионеры выполняют ваши бессмысленные поручения, или с вечерних посиделок с физруком ? 
# Если первая половина моей относительно гневной тирады, кажется прошла мимо вожатой, то вторая, похоже, попала не в бровь, а в глаз. Она даже не нашлась, что ответить и молча смотрела на меня. Удивлена была и Виола, но похоже не так сильно. Кажется в её полуулыбке было больше удовлетворения, как будто она что-то знала, а я своими словами лишь подтвердил её предположения.
# ОД:  -Семён.. Я не знаю, что ты там себе напридумывал, но..  
 # Теперь голос её звучал уже не так уверенно. Смущение ? У нашей вожатой ? Да она на себя не похожа.  Мне даже на какой-то момент стало стыдно. И за себя и за неё. И что я правда физрука сюда приплёл ? Ведь собственно лично мне Ольга Дмитриевна ничего плохого не сделала.  А ведь её за аморалку и из комсомола исключить могут.
# За столом повисло напряжённое молчание. За разговорами я даже не заметил, что все пионеры уже давно закончили есть и разошлись. Столовая опустела. Дежурные подметали пол, протирали столики и поднимали стулья.
# Наконец Виола решила прервать затянувшуюся паузу.
# В: - Подождите, Ольга Дмитриевна.  Обратилась она к вожатой.  – Семён. Теперь она смотрела на меня. И я вдруг заметил, что она впервые назвала меня по имени. – Мне кажется мы, как взрослые люди, могли бы найти разумный компромисс.
# В: - Прежде всего, я хочу предупредить тебя, Семён, о возможной опасности со стороны этого.. (она пошевелила пальцами, пытаясь подобрать определение поточнее).. явления. Мы не знаем, ЧТО это такое, мы не знаем, ЧЕГО можно от него ожидать. Ты можешь конечно не обращать внимания на мои предостережения, но я надеюсь на твою рассудительность.
# Пока я переваривал эту информацию, она повернулась к вожатой, всё ещё пребывающей в состоянии лёгкого шока. 
# В: -Оля, я думаю, можно предоставить мальчику некоторую свободу действий и сделать его пребывание в лагере.. более комфортным. В пределах разумного, конечно.
# В: -Только не думай, пионер, что это подействовал твой детский шантаж.  Она строго посмотрела на меня. - Моя задача следить за психологическим климатом в лагере. А сейчас , я думаю, нам всем пора идти.
# Вместе с Ольгой Дмитриевной мы шли к нашему домику, так как уже приближалось время отбоя. Думаю, сегодняшние посиделки..
# Ш: «полежалки»
 # ..полежалки с Санычем отменяются.
# ОД:  - Семён. Не думай, что ты победил. В моих силах сделать твоё пребывание в этом лагере не то, что более комфортным, но и вообще невыносимым.
# С: - Я понимаю, Ольга Дмитриевна. 
# ОД:  - Вот и хорошо. И она, впервые за весь вечер улыбнулась.
# Да, денёк сегодня был ещё тот, подумал я, заходя в домик. Раздеваться сил уже практически не было. Спать, спать, спать.. 
# ОД: - Кстати, Семён. Ты ведь в библиотеку так и не записался ? 
# С:- Нет.. растерянно ответил я.  Какая уж тут библиотека.
# ОД: - Ну вот. Пришлось учебник твой обратно сдать. Женя хватилась. Не бери  больше без спроса. Как говорится: нет читательского билета – нет и книжек.
# Она, что, все книжки свои наизусть знает ? Кто бы мог подумать, что она в библиотеке не только спит. Но вслух сказал только:
# С: - Хорошо, Ольга Дмитриевна.
# ОД:  - Молодец. Спокойной ночи. Не забудь завтра навестить Александра в медпункте. 
# И она потушила свет. Ну а я моментально провалился в сон.
