#День4 посещение библиотеки
#
label uvao_D4_library:
#Д4 посещение библиотеки
#
#
#
    $ persistent.sprite_time = "day"
    play ambience ambience_camp_center_day fadein 1
    scene bg ext_library_day with fade
    "Все, пора с этим заканчивать, а то мне уже начинает казаться, что сами Высшие Силы не хотят, чтобы я узнал правду…"
    "Уже показалась библиотека."
    dreamgirl "Впервые на арене! Смертельный номер!{w} Укрощение безумной библиотекарши! Эх, жаль, похрустеть нечем…"
    th "Спасибо за поддержку"
    dreamgirl "Обращайся!"
    "Остановившись возле двери, я несколько раз глубоко вздохнул."
    "Знал бы, что понадобится ее помощь, был бы хоть немного повежливее…"
    dreamgirl "Не думаю. Бешеный лев обычно хреново реагирует на комплименты…"
    "Я собрался с мыслями и повернул ручку."
    scene bg int_library_day with dissolve
    play sound sfx_door_squeak_light
    play ambience ambience_library_day fadein 3
    "Шаг, другой.{w} Я еще жив? И на меня даже не наорали? Удивительно!"
    "Уютное гнездышко библиотекарши пустовало. Где же хранитель сего места?"
    "Меня напугал внезапный крик из-за соседнего стеллажа:"
#    play sound sfx_angry_ulyana
    mz "Да сколько можно? Двадцатый раз уже! Зачем сюда приходишь? Ты же их уже до последней буквы знаешь."
    el "Жень, я… Это…"
    "Голос Электроника немного дрожал, и я даже немного его понимал."
    mz "Я знаю, как меня зовут! Заруби себе на своем конопатом носу…"
    "Вот это подфартило! Впервые Электроник там, где нужен. Если он еще потянет резину…"
    dreamgirl "Правильно. Пусть пираний кормит другой водолаз. Давай скорее, они же не вечно будут ворковать."
    "Я мысленно согласился со своим внутренним голосом и подошел к столу библиотекарши."
    dreamgirl "Почерк достойный врача, не находишь?"
# видимо, ГГ роется в предметном указателе? стоит упомянуть, где он там почерком любуется
# кстати, на бэкграунде слева красуется приятная картотека-тумбочка
    "Действительно, почерк Жени явно оставлял желать лучшего."
    "С горем пополам я разобрал название интересующей меня книги и номер стеллажа, на которой та находилась."
    "Ага, седьмой стеллаж - всего-то три стеллажа от меня, даже на глаза им попадаться не придется…"
    "Я тихонько направился куда надо. Не в моем положении было мешать сейчас голубкам."
    "Голос Жени немного стих, но она продолжала поносить Электроника."
    mz "Каждый день! Каждый божий день, ты заявляешься сюда с неизвестной целью…"
    "Нужный стеллаж."
    "История СССР…"
    "«Славный октябрь. Мемуары партийного ветерана»"
    "«Великая отечественная война. Годы в огне»"
    "Нашел! «История СССР. Расширенное издание»"
    "Надеюсь тут есть то, что мне нужно.{w} Впрочем, есть время проверить."
    "В алфавитном указателе я нашел-таки заветные буквы: «Генда И.Е.»."
    "Значит, хоть что-то я узнаю."
    mz "…прогуливайся сам! А мне и так хорошо!"
    el "Но…"
    dreamgirl "Зря парень старается. Она, кажется, почкованием размножается, не иначе…"
    "А голоса меж тем приближались. Еще чуть-чуть и накроют. И шкаф угловой, не спрячешься. Что делать? Может, в подпол?"
    dreamgirl "Какой подпол? Кто тебе будет в библиотеке делать подпол?! Давай лучше запрыгивай наверх и зависни между полками, как Сэм Фишер."
    "Вместо этого я пригнулся и на трех конечностях - четвертая была занята книгой - шустро забежал за стеллаж."
    dreamgirl "Ну или так."
    "Стук каблуков подсказывал, что Жужелица снова заняла свое место у дверей. Электроник тащился за ней."
    mz "Разговор окончен! Иди, поищи себе кого-нибудь другого, кто согласится выгулять тебя, например Шурика своего!"
    el "Но он в медпункте…"
    mz "Да плевать, ты мне здесь не нужен! Уходи."
    play sound sfx_open_door_kick
    th "Боже, какой у нее противный голос! И кто на {i}такую{/i} поведется?"
    play sound sfx_close_door_1
    dreamgirl "Вот всякие Электроники и ведутся. С другими у него немного шансов, сам пойми"
    "Я стоял на четверенках и напрягал слух, пытаясь улучить момент для побега."
    "Женя, видимо, не торопилась. Не было слышно ни шагов, ни ее скрипучего голоса.{w} Может быть она ушла?"
    dreamgirl "Не дождешься! Дрыхнет небось, как всегда, на своих книжках"
    "Не ждать же мне до обеда?"
    play sound sfx_open_door_kick
#возможно, до звука шагов хлопнула входная дверь? вставил звук.
    "Внезапно раздались звуки шагов."
    mz "Это кто это там?"
    un "Женя, здравствуй, это я."
    mz "Снова ты? Что ж вы ходите-то все подряд! Уже прочитала?"
    un "Угу."
    mz "Давай тогда. Та-ак. Страницы на месте, ничего не изрисовано… Что-то еще?"
    "Я почти уверен, что Лена сейчас была краснее знамени с Лениным, висящим за спиной библиотекарши, хотя видел лишь ее сандалии."
    un "Мне бы еще что-нибудь…"
    mz "Опять про любовь? А ты разве не все еще прочитала?"
    "Раздался скрип отодвигаемого стула."
    mz "И что вам так нравится в бульварных романах? Я больше предпочитаю книги по естественным наукам…"
    "Лена промолчала."
    "Шаги удалялись. Лирическая литература была в дальней секции, посему…"
#Хорошо бы упомянуть, что _обе_ девочки ушли вдаль. Типа, "Шаги обеих девочек удалялись"
    dreamgirl "Твой шанс, товарищ диверсант."
    "Я перехватил книгу поудобнее во вспотевшую ладонь и выглянул из-за шкафа. Никого."
    "Отлично, теперь главное - не спеша…"
    "Мимо стеллажа, обходим столы… Дверь."
    play sound sfx_open_door_kick
    scene bg ext_library_day with fade
    play ambience ambience_camp_center_day fadein 1
    "Весь путь к двери я даже не дышал. Но теперь, вырвавшись из лап дракона с трофеем я просто не мог надышаться."
    "Сладкий воздух, воздух победы…"
    "Так, теперь посмотрим, что это я добыл…"
    play sound sfx_paper_bag
    "Так… та-а-ак… {i}«Генда И.Е., соратник В.И. Ленина, играл важнейшую роль в становлении советской науки…»{/i}"
    "Странно, почему я тогда это имя впервые слышу? Я не бог весть какой историк, но…"
    show us smile sport with dissolve
    us "Семён! А ты чего это тут делаешь?"
    "Я аж подскочил, пряча увесистую книгу за спину."
    show us normal sport with dspr
    me "Ульяна! Подкрадываться к людям нехорошо."
    "Я уже описывал широкую дугу вокруг девочки."
    show us dontlike sport with dspr
    us "Ты прям как Саныч, честное слово. Хотела мяч взять, футбольный, зашла, а он дрыхнет на матах. Давай его расталкивать…"
    us "Вот он мне прям то же самое сказал!"
    me "Мяч не дал, что ли?"
    show us normal sport with dspr
    us "Дал, почему же?"
    me "Тогда почему не играешь?"
    show us sad sport with dspr
    us "Ску-учно! Алиса куда-то пропала, а с младшими отрядами играть неинтересно. Пошли сыграем, Семён?"
    me "Да я сейчас занят…"
    show us grin sport with dspr
    us "И чем же? Из библиотеки книжки тыришь?"
    "Ульяна хитро взглянула на меня…"
    us "Дай поглядеть!"
    "… и выхватила тяжелый талмуд, который я пытался спрятать за спиной."
    me "Эй, верни!"
    show us grin sport far at fright with dissolve
    "Ульяна отбежала на безопасное расстояние и только потом посмотрела на обложку."
    show us dontlike sport far at fright with dspr
    us "История СССР? Фе. Скукотень! Я думала про индейцев, или про шпионов… Зачем она тебе?"
    dreamgirl "Ну что, теперь думай как добычу вернуть…"
    dreamgirl "Догнать мы уже пробовали, подкупить нечем, осталось только уговорить.{w} Или припугнуть. Кого она боится?"
    me "Поручение от Ольги Дмитриевны. Кстати, ты мне поможешь!"
    show us calml sport far at fright with dspr
    us "Я?! Чем это?"
    me "Про концерт слышала? Ольга Дмитриевна велела мне найти материал для сценки.{w} Что-нибудь про пионеров-героев, например, или про революцию."
    show us normal sport far at fright with dspr
    me "Вот ты и будешь пионером-героем!"
    dreamgirl "Ты соображаешь чего несешь? Она же сейчас согласится!"
    me "А я - фашистом.{w} Ми тебя будем вешайт унд убивайт!"
    show us laugh sport far at fright with dspr
    us "Не, я всех из пулемета перестреляю - тра-та-та-та!!! И никаких вешайт и убивайт!"
    me "Не пойдет, они потому и герои, что геройски погибли. Придется тебе…"
    show us dontlike sport far at fright with dspr
    us "Не-е-е, тогда не хочу!{w} Найди кого-нибудь другого, Лену, например!"
    show us normal sport far at fright with dspr
    us "Забирай свою скукотень, а я пойду, может Алиса вернулась."
    show us grin sport far at fright with dspr
    us "Заодно проверю своих… э… друзей…"
    dreamgirl "Ну вроде разобрались. И совет, дружок: есть с ней не садись, а то снова в тарелке обнаружишь ее… друзей…"
    hide us with dissolve
    "Я облегченно вздохнул и, стараясь никому не попадаться на глаза, направился к домику.{w} Лучше поглощать знания в уединеном месте."
    stop ambience fadeout 1
    scene bg int_house_of_mt_noitem_day with dissolve
    play music eat_horn fadein 5
    "Стоило только открыть дверь, как раздался обеденный горн."
    stop music fadeout 2
    "В тот же момент я, как настоящая собачка Павлова, немедленно ощутил пустоту в желудке."
    play sound sfx_stomach_growl
    "Спрятав книгу под подушку и стряхнув пыль знаний со штанов, я направился в столовую. "

    stop music fadeout 3
    window hide

    return
