#День4 Утро - Уборка гирлянд
#
label uvao_D4_garlands_removal:
# Д4-Утро-Уборка гирлянд
#
# <убрать следующий блок при склейке с предшествующей сценой
    scene bg ext_dining_hall_near_day
    window show
    show mt surprise panama pioneer close at center
#>
    me "Извините…"
    show mt normal panama pioneer with dissolve
    mt "О, Семён! Ты-то мне и нужен."
    "Этот тон мне сразу не понравился."
    me "Очередное архиважное поручение?"
    show mt smile panama pioneer with dspr
    mt "Как ты догадался?"
    me "Если подумать, то создается впечатление, что я вам нужен только в качестве чернорабочего."
    show mt laugh panama pioneer with dspr
    "Ольга Дмитриевна рассмеялась."
    mt "Не паясничай. Тебе наверняка все равно нечем заняться."
    "На клеточном уровне я очень-очень занят!"
    show mt normal panama pioneer with dspr
    mt "Так вот, на линейке видел состояние нашей площади?"
    me "А что, красиво. Особенно вчера было."
    "Я понял, куда она клонит. Кажется, поиск ответов придется отложить."
    "В принципе я мог бы обойтись и без свидания с Жужелицей, но если хочется понять, что здесь происходит - придется рисковать."
    mt "Как ты уже, наверное, понял, требуется убрать площадь, снять гирлянды и отнести их на склад."
    me "Вы всерьез думаете, что один я справлюсь?"
    mt "Можешь попросить помощи у Электроника. Тем более стремянка как раз была у них."
    th "Интересно, а не та ли эта стремянка, по которой Шурик забирался?"
    me "Но…"
    show mt angry panama pioneer with dspr
    mt "Никаких но, Семён! Пионеры говорят «Всегда готов!» и не задают лишних вопросов."
    me "Да, белая госпожа…"
    "Пробубнил я себе под нос.{w} К счастью, Ольга Дмитриевна меня не услышала."
    show mt normal panama pioneer with dspr
    mt "В общем, задание получил, вперед выполнять."
    show mt smile panama pioneer with dspr
    "Она улыбнулась и твердой походкой направилась в сторону домика."
    hide mt with dissolve
    dreamgirl "Ну что, работай, нигер! Солнце еще высоко!"
    "Что же, уборку без стремянки не начать. Я направился в сторону кружка кибернетиков."
    window hide
    $ renpy.pause(2)
    play ambience ambience_camp_center_day fadein 1
    scene bg ext_clubs_day with dissolve
    window show
    "Я постучал и дернул было ручку, но дверь оказалась заперта."
    "Электроник, видимо, навещает Шурика.{w} Ладно, подожду его тут."
    show us grin sport far with dissolve:
        xalign 0.99 yalign 0.99 zoom 0.7
    "Объявился тот спустя двадцать минут, я же за это время успел заметить в кустах рыжую шевелюру местной «охотницы на жуков»."
    "Сейчас мне было ужасно жаль того, кому Ульяна захочет похвастаться своей коллекцией."
    hide us with dissolve
    me "Явился - не запылился."
    show el surprise pioneer with dissolve
    el "Привет Семён, а я это…"
    "Электроник что-то спрятал за спину."
    "Я ловко выхватил небольшую стопку журналов.{w}\n«Юный техник». А я уж подумал - «Playboy»…"
    show el serious pioneer with dspr
    el "Это Шурику. Скучно ему в медпункте, просил принести, вот я в библиотеку и сходил."
    "Ясно, чем занимался Электроник все эти двадцать минут. Кажется, Жужелица сегодня будет более нервной, чем обычно."
    me "Помощь твоя нужна."
    show el normal pioneer with dspr
    el "В чем же?"
    "Тот явно заинтересовался."
    me "Ольга Дмитриевна велела убрать гирлянды, а стремянка, кажется, у вас."
    el "Да, она тут."
    hide el with easeoutright
    "Тот оббежал здание клубов, чем-то поскрипел и выволок сложенную жестяную стремянку."
    show el normal pioneer with easeinright
    me "Отлично, пошли."
    show el upset pioneer with dspr
    el "Ну, вообще-то у меня дела."
    "Он покраснел."
    th "В библиотеку, небось, собрался…"
    dreamgirl "Причем, явно не за журнальчиками…"
    me "Э, нет. Один я ни за что не полезу. Ольга Дмитриевна сказала, что ты можешь помочь."
    el "Ну, если надо…"
    me "Не представляешь как."
    show el normal pioneer with dspr
    "Мы направились к площади."
    scene bg ext_houses_day with dissolve
    show el normal pioneer at left with dissolve
    "Эл, кряхтя, нес стремянку, а я осматривал лагерь.{w} В голову приходили разные мысли о путешествиях во времени, параллельных мирах, экспериментах ученых…"
    show el sad pioneer with dspr
    el "Давай передохнем?"
    me "Выдохся уже? Давай сюда."
    "Я схватил стремянку и понес ее к площади."
    scene bg ext_square_day with dissolve
    play ambience ambience_camp_center_day fadein 1
    show el sad pioneer at left with dissolve
    "Вскоре показалась площадь, с ее лавочками, украшенными гирляндами деревьями и с ее основным атрибутом – одиноким загадочным Гендой."
    "Тот как всегда надменно взирал на происходящее вокруг.{w} На воркующую парочку, сидящую на скамейке в тени деревьев, на Славю, машущую метлой, на меня, медленно несущего стремянку."
    "Я с той же надменностью взглянул в его очки."
    th "Ну, погоди, неизвестный товарищ. Мы еще узнаем твои тайны."
    dreamgirl "Мда-а. Натуральные Авгиевы конюшни!"
    "Действительно, работы оказался практически непочатый край."
    "Я прикинул примерный вектор работы и поставил стремянку у одного из крайних деревьев."
    me "Кто полезет?"
    show el upset pioneer with dspr
    el "Э нет, только не я."
    me "Мне тоже как-то не очень хочется."
    "Никто из нас не хотел повторять подвиг Шурика, посему было принято решение решить вопрос «по-мужски»."
    "…"
#***Если Автор-кун докопает-таки код «Камня-ножниц-бумаги», то здесь можно сделать мини-развилку (Лезет Сёма/Лезет Эл)***
    show el smile pioneer with dspr
    el "Ножницы режут бумагу. Я победил."
    th "Ничего не остаётся…"
    me "Держи, только крепче!"
    show el normal pioneer with dspr
    "Эл кивнул и схватился за стремянку."
    show sl smile pioneer far at fright with dissolve
    "Работа пошла. Славя с улыбкой наблюдала за нашей деятельностью, пристроив на лавочке рядом с собой метлу, которой только что подметала площадь."
    "Ну да, на что там можно смотреть вечно?"
    me "Эл, держи крепче!"
    show el sad pioneer with dspr
    show sl normal pioneer far at fright with dspr
    el "Прости, отвлекся."
    show mz bukal glasses pioneer far at right with dissolve
    "Я взглянул за плечо и заметил как Славя о чем-то разговаривает с Жужелицей."
    show el smile pioneer with dspr
    "Эл, как и ожидалось, смотрел туда же."
    "Женя, что-то сказала, покосилась в нашу сторону и, развернувшись, пошла в сторону библиотеки.{w} Отлично, значит, она будет там."
    hide mz with dissolve
    "Стремянка громко скрипнула, я от испуга выронил моток гирлянды и схватился за ветку дерева."
    me "Эл!!!"
    show el upset pioneer with dspr
    el "Извини!"
    show el sad pioneer with dspr
    "Электроник тут же крепко сжал стремянку."
    "Спустя полчаса последняя гирлянда была смотана и брошена в общую кучу."
    show el normal pioneer with dspr
    show sl normal pioneer at right with dissolve
    sl "Вам помочь, мальчики?"
    me "Если не трудно."
    show sl happy pioneer with dspr
    "Она лучезарно улыбнулась."
    sl "Нет, не трудно. Как раз закончила подметать площадь."
    show sl smile pioneer with dspr
    "Я схватил большой моток проводов и понес его в сторону склада."
    "Эл, помедлив, схватил стремянку и пошел за мной. Славя взяла остатки гирлянд."
    hide el with dissolve
    hide sl with dissolve
    $ renpy.pause(1)
    scene bg ext_houses_day with dissolve
    show el sad pioneer at right with dissolve
    show sl normal pioneer at left with dissolve
    el "Аккуратнее, Семён. Не упади."
    $ renpy.pause(1)
    "Нести моток было неудобно, и провода то и дело попадались под ноги. С горем пополам мы дошли-таки до склада."
    scene bg ext_shed_day with dissolve
    show el sad pioneer at right with dissolve
    show sl normal pioneer at left with dissolve
    sl "Одну минутку, мальчики."
    show sl normal pioneer far at left with dissolve
    show el normal pioneer with dspr
    "Она подбежала к дверям, звякнула ключами и ловко открыла навесной замок."
    hide sl with dissolve
    sl "Загружай!"
    "Донесся голос из помещения."
    "Я поволок гирлянды внутрь."
    scene int_shed_day with dissolve
    show sl normal pioneer far at left with dissolve
    me "Куда?"
    sl "В коробку, вот сюда."
    "В помещении было темно и Славю было едва видно."
    "Я бросил большой моток туда, куда указал Славин силуэт и наконец разогнулся."
    me "Ох! Как будто вагон разгрузил!"
    show sl happy pioneer far with dspr
    "Славя хихикнула."
    show el normal pioneer far at right with dissolve
    show sl smile pioneer far with dspr
    "Рядом раздался скрип стремянки. Электроник поставил железяку в другой угол и теперь отдыхал, прислонившись к стене."
    me "Что ж, мавр сделал свое дело, мавр может уходить. Спасибо за помощь."
    show el smile pioneer far with dspr
    show sl smile pioneer far with dspr
    "Эл кивнул, а Славя улыбнулась."
    sl "Обращайтесь."
    scene bg ext_shed_day with dissolve
    "После темноты склада солнце было необычайно ярким."
    show el normal pioneer far at right with dissolve
    "Пока я привыкал к свету, мимо меня проскользнул Эл и с деловым видом направился в сторону сцены."
    hide el with easeoutright
    "Я же решил не терять времени даром и таки заглянуть в библиотеку, к хранителю местных архивов, в надежде откопать побольше информации о мире, куда меня занесло."
#
    return