# сцена - темнота.
"Полусогнувшись, я пёр через какие-то кусты напролом, не разбирая дороги, пока меня без всяких предисловий не приложило по лбу чем-то тяжёлым так, что искры полетели из глаз."
"Охнув, я наугад ударил в темноту перед собой{w}... И чуть не взвыл от боли, отчаянно тряся ушибленной рукой."
dreamgirl "Отличное продолжение вечера. Ты прямо-таки в ударе сегодня. Сначала завёлся из-за пустяка на ровном месте, теперь с деревьями дерёшься. {w}Что дальше в планах?"
me "Заткнись!"
"Я обессиленно опёрся здоровой рукой о шершавый сосновый ствол, чуть не плача от боли и унижения."
"Стыдно было себе в этом признаваться, но на тропинке перед домиками я действительно психанул, словно какой-нибудь сопливый пацан, да ещё и убежал потом."
"Машинально я лизнул ободранные о кору дерева костяшки пальцев, ощутив солоноватый привкус крови."
"В темноте никак не удавалось понять, куда меня занесло, поэтому я плюнул на всё, плюхнувшись прямо на землю, привалился спиной к сосне и закрыл глаза."
"Я отлично понимал, что обижаться на Алису глупо, да и не впервой уже мне от неё достаётся, но возвращаться? {w}Увольте!"
dreamgirl "Ну что же, у тебя есть отличная возможность поставить рекорд по сидению на одном месте."
th "Заткнись!"
dreamgirl "Жаль, в гнигу рекордов Гинесса попасть наврядли удастся - не те времена и не та страна."
th "Заткнись, прошу тебя! {w=1.5}Замолчи."
# сцена - ближняя (или дальняя) тропинка в лесу с Noir, чтобы было весьма темно.
"Глаза тем временем успели немного привыкнуть к темноте. Вокруг проступили неясные силуэты кустов, но больше ничего разглядеть не удавалось - луну по-прежнему скрывали тучи."
"Я подтянул колени к груди и обречённо уткнулся в них лбом, замерев. {w}Сейчас мне и в самом деле хотелось только одного - сидеть так вечно."
# шум веток
"Коротко протрещали ветки, и кто-то плюхнулся не зямлю рядом со мной, бесцеремонно схватив за плечо."
"Вздрогнув, я поднял голову и очутился лицом к лицу с Юлей. Её широко раскрытые глаза слегка светились в темноте."
#show uv scared # или другая негативная
uv "Семён! Пойдём скорее! {w=2.0}Мне не нравится! Мне совсем-совсем не нравится!"
me "Ю...Юля? Что случилось?"
uv "Она там! Мне не нравится! Скорее!"
"Она схватила меня за руку с неожиданной силой. Молнией метнулся хвост, едва не задев меня по лицу."
uv "Говорю же, пойдём скорее!"
"Я поднялся на ноги, и Юля без промедления потащила меня куда-то сквозь заросли."
hide uv
# эффект тряски при беге
"На бегу я ещё раз попытался выяснить у Юли, в чём дело, но не добился ничего, кроме невнятных \"не нравится\" и \"неправильная\"."
"После этого я схлопотал какой-то на редкость колючей веткой по лицу и решил сосредоточиться на том, чтобы добраться до цели нашей пробежки с минимальными потерями - какой бы эта самая цель ни была."
# loop - дыхание
# сцена - забор (сетчатый? кирпичный?)
"Через минуту мы оказались перед забором. Юля перемахнула его одним движением, я кое-как вскарабкался следом."
# сцена - дальняя тропинка в лесу с Noir, чтобы было весьма темно.
"Стоило мне спрыгнуть на землю, как Юля потащила меня дальше за собой."
#show uv scared
uv "Скорее, Семён, скорее!"
me "По...подожди, дай хоть отдышаться."
"Просипел я, но хвостатая была неумолима."
uv "Да скорее же!"
hide uv
# эффект тряски при беге
# прибавляем освещённости до обычного ночного.
"Словно тусклый прожектор, выглянула вдруг из-за туч луна, и бежать стало немного легче - во всяком случае, появилась надежда не переломать ноги в темноте."
"Деревья справа вдруг расступились, и я понял, что мы оказались по краю какого-то карьера или чего-то вроде этого - Юля продолжала тащить меня за собой, и вскоре по обе стороны от нас вновь сомкнулся сплошной стеной деревьев лес."
"Внезапно Юля остановилась так резко, что я чуть не сбил её с ног. Обернувшись ко мне, она выдохнула:"
#show uv scared
uv "Вот. Это очень плохо. Мне не нравится."
me "Так а что тебе..."
"Заполошно бьющееся сердце вдруг провалилось куда-то, судорожно сжавшись."
"Cеребристый лунный свет равнодушно заливал небольшую полянку."
"Чёрные, чуть отблёскивающие влажным пятна на юбке, на траве и на коже, которая казалась сейчас белее накрахмаленной ткани пионерской рубашки, тоже испачканной чёрными разводами."
"Девочка сидела неподвижно, тяжело привалившись спиной к дереву, голова бессильно свесилась на плечо."
uv "Ну что же ты. Сделай что-нибудь! Это очень плохо!"
"Повторила нетерпеливо Юля."
"На ватных ногах я послушно подошёл к неподвижной фигурке. Движения казались странно замедленными, словно в воде и почему-то мне всё время казалось, что я отстаю сам от себя, глядя в собственный затылок."
"Поколебавшись секунду, я опустился рядом на колени, изо всех сил стараясь не наступить в чёрное, и осторожно, кончиками пальцев, коснулся её руки."
"Показалось, что пальцы обожгло ледяным холодом и я поспешно отдёрнул руку, но девочка вдруг шевельнулась и я услышал слабый, но совершенно отчётливый стон."
th "Жива!"
"Меня словно что-то толкнуло, разом выводя из ступора."
"Я заполошно задёргался, срывая с себя галстук и отчаянно путаясь в узле."
th "Жгут! Сейчас, надо на руку наложить жгут, хорошо, что она только одну руку порезала. Надо выше на руку наложить жгут и всё будет..."
dreamgirl "Какой жгут, балда! {w}Венозное кровотечение, нужна давящая повязка на рану, а не жгут. Галстук сложи несколько раз вдоль и повяжи ей на запястье."
"Спокойный, чуть насмешливый голос не слишком помог мне совладать с накатившей паникой, но в голове немного прояснилось."
"Похоже, девочка была в сознании, просто сильно ослабела - пока я возился с повязкой, она несколько раз пыталась что-то сказать."
"Наклонившись ближе к её лицу, я расслышал наконец:"
un "Зачем.. никому..."
me "Сейчас, хорошая, сейчас. Потерпи немного, всё будет хорошо."
"Торопливо частил я, стараясь не думать о том, что далеко не всё может быть в итоге хорошо - неизвестно, как давно она здесь уже лежит, сколько крови потеряла и не попала ли в вену какая-нибудь зараза через рану."
un "..."
# сложности с погрузкой на спину, но осилил-взвалил, наконец.
# Юля молча топчется рядом, настороженно поглядывает. Просит проводить на территорию, иначе заблудится. Юля кивает: "Да. Пойдём."
# несёт-тащит, выруливают к забору - там дырка/пролом - Юля сама догадалась.
# Юля доводит до освещённой части (дорожка) и сваливает - "Много людей ходит. Увидят."
# нарисовывается Саныч, обалдевает на секунду. ГГ пыхтит: "Запястье. Порезала."