
# Зырим бесплатный стриптиз на умывальниках. Сюда попадаем с палевной ветки, если упорно отбрыкиваемся от беседы с Виолой.
label alt_day6_uvao_wash_dv_us:
    scene bg ext_washstand_day with dissolve
    $ persistent.sprite_time = "day"
    play ambience ambience_camp_center_day fadein 3
    window show
    "Ежеутренний чекпойнт, ряды умывальников, подключенных прямиком к тающим ледникам, ждали меня. Как всегда, я набирался духу для очередного испытания водой, закалки тела и, через него, духа, или наоборот…"

    scene bg ext_washstand2_day
    with dissolve
    $ renpy.pause(1)

    th "Ну сколько можно уже резину тянуть! Фени, фиди, фидши..."
    "Я был уже почти готов окунуться в обжигающе холодную воду, но тут"

    dv "Давай сюда быстрей!"

    "Упс. Алиса, и, судя по голосу - далеко не в радужном настроении."

    dv "Ну давай уже! А то Шляпа запалит."

    th "Лучше б мне не отсвечивать, наверное."
    scene bg ext_washstand_day 
    with dissolve
    "Я, так и не умывшись, подхватил полотенце и занял наблюдательную позицию в густых кустах. И вовремя."

    show dv normal pioneer far at cleft
    show us normal pioneer far at cright
    with dspr
    "На умывальную площадку выбежала неразлучная парочка - Алиса, а с ней и Ульяна. Видок у них был…"
    th "Где это они так умудрились перемазаться, интересно?"

    dv "Никого нет? Отлично, тогда быстро раздевайся!"
    window hide

    th "Ну почему мне так везёт?! Сейчас заметит - и до завтрака я не доживу."
    "Оставалась лишь слабая надежда на то, что пронесёт, и меня не заметят."
    dreamgirl "Надейся, почему бы и нет. Надо же чем-то время занять."
    dreamgirl "Хотя… Все равно помирать, так может хоть краешком глаза глянем? А?"

    "И чего я, спрашивается, ожидал?"

##опять несколько раз показать-убрать интерфейс, с полсекундной паузой, олицетворяя колебания
    $ renpy.pause (0.5)
    window show
    $ renpy.pause (0.5)
    window hide
    $ renpy.pause (0.5)
    window show
    $ renpy.pause (1)
    "Ладно."
    dreamgirl "Серьёзно?!"
    "В конце концов, врага надо встречать лицом к лицу. Хотя бы для того, чтоб вовремя дать дёру."
    dreamgirl "Ага, и просто позырить хочется."
    dreamgirl "Не обманывай хотя б меня. Себя можно."
    dreamgirl "Ну, давай уже!"

    "Мысленно вздохнув, я стал осторожно раздвигать ветки."
    scene cg d5_dv_us_wash with dissolve
    "Рыжая банда обосновалась у крайнего умывальника, форменные рубашки были разложены на соседней стойке. Я имею в виду, обе рубашки."
    dreamgirl "Ву-хуу, джекпот!"
    "Алиса, вооружившись какой-то импровизированной мочалкой, очищала с рубашек самые заметные пятна. Ульяна, недовольно ворча, набирала воду в горсти."
    us "Брр, холоднючая!"
    dv "Ты не рассуждай, ты отмывайся давай!"
    us "Но она же холоднючая!"
    dv "Ах, холоднючая?"
    "Произнесла Алиса с весьма саблезубой улыбкой."
    dv "Сейчас согреешься!"
    "Она принялась усердно оттирать Ульяну той же мочалкой, которой чистила рубашки - то есть, скомканным галстуком. Ульяна лишь отфыркивалась, не сильно протестуя против такого обращения."
    play music music_list["glimmering_coals"] fadein 3     
    dv "Ну вот, теперь хоть на человека похожа."
    us "А до этого на кого?"
    dv "На порося!"
    us "Хи-хи… ХРЮ!"

    us "Алис… а дай померить?"
    dv "Чего?"
    us "Ну лифчик. Померить." 
    us "У тебя ж вон какие выросли!"

    "Я непроизвольно затаил дыхание. Не может быть…"
    $ renpy.pause(1)
    play sound stahp
    dv "Ага, щас! Померить ей, а из-за кого мы так угваздались, не напомнишь?! Чтоб я еще раз…"
    stop music
    scene bg ext_washstand_day
    show dv normal pioneer far at cleft
    show us normal pioneer far at cright
    with dspr
    dv "Пошли скорее, опоздаем - Шляпа хай подымет!"
    hide us
    hide dv
    with flash
    "Они натянули все еще мокрые рубашки и скорым шагом усвистали по тропе в сторону площади."
    $ renpy.pause(0.5)

    th "Пронесло."
    dreamgirl "Блин, та-а-акой облом!"
    th "Не-е. Ты заметил, что нам даже по голове не дали?"
    dreamgirl "Нет в тебе авантюризму. Подумаешь, голова…"
    th "Она мне дорога, как память. Да и ты тоже в ней проживаешь, так что соответствуй!"
    dreamgirl "Ну лан."

    dreamgirl "Кстати, голова, а почему мы до сих пор лежим в кустах? Ждём продолжения стриптиза? Ну ок, щас Сыроега придёт, его позырим…"
    th "Чур меня."
    play sound sfx_open_water_sink
    $ renpy.pause(1)
    play sound_loop sfx_water_sink_stream
    "Не рассусоливая, я наконец-то поплескал в лицо воды - действительно холоднючая! - и бодрым шагом направился обратно. Кажется, мне куда-то было нужно."

jump alt_day6_uvao_breakfast_with_viola
