# ЮВАО концовки - нейтрал и нейтрал-бэд 
# TODO: скрипт! И мне не нравится кошкоэнд, больно уж трешовый.
init:
    $ alt_uvao_replay_prologue=0
    
label alt_uvao_ending_neutral_bad:
	# Я снова кричал во сне.
	# Кричал, кричал, и проснулся от собственного крика.
	# Я был…
	# Я был…? 
	# Хмм?
	# Странно, я не мог вспомнить ни единой подробности сна. Обычно помнишь хоть что-то, хоть какую-то деталь - "там был дирижабль, и вулкан, и ещё отряд зеленых ниндзя", например. 
	# Здесь же… ни единой идеи, кроме ощущения, что что-то БЫЛО. Что-то важное…
	# Да ну нахрен. Не помню - и не надо.
	
	# Глаза, как всегда после пробуждения, конфликтовали с реальностью. Всюду плывут туманные пятна, фокус куда-то мимо. Пришлось несколько раз зажмуриться и встряхнуть головой.
	
	# "Я - Семён. Персунов. Двадцать восемь лет. Это Питер. Санкт-Петербург."
	# Даже такая дурацкая точка сборки, кажется, сработала. По крайней мере, зрение более-менее сфокусировалось и показало мне стол и экран ноутбука на нем, только-только вышедшего из спящего режима.
	# "Я тоже проснулся, хозяин! Какие будут приказания?"
	# Тьфу.

	# Пошатываясь, я поднялся. Мебель и прочий хлам совершенно недвусмысленно нацелились отбить мне все пальцы на ногах, но, тем не менее, я успешно добрался до ванной. 

	# Помятая угрюмая морда в зеркале дивно гармонировала с окружающей действительностью.
	# "Я тебя не знаю, но я тебя умою… Хотя ты и не существуешь. И я тоже."
	# Зазеркальный визави посмотрел на меня дикими глазами, но потом согласно кивнул.
	# - Это я сейчас должен испугаться и садануть кулаком по стеклу?
	# Ответа не воспоследовало. Ну ещё бы… 

	##Звук умывальника

	# "А это еще откуда взялось?"
	# На предплечье, почти у самого локтя, по-праздничному багровел синяк.
	# "Где это я так приложился? Или кто-то меня хватал, судя по очертаниям?"
	# Как ни старался, я не мог вспомнить, откуда у меня такие регалии. Вчерашний день ничем не отличался от позавчерашнего, и от позапоза-… 
	# Плюнув, я вторично набрал ледяной воды в горсти.

	# После водных процедур тело слушалось лучше. По крайней мере, не приходилось держаться за стенку, возвращаясь обратно. 
	# Ноут по-прежнему светил экраном, заманивая в волшебный мир смешных котиков и циничных спорщиков. К черту, не хочу.
	# "Пойти что ли прогуляться? Сигареты закончились…"

	# На столе зажужжал мобильник, нарушая мое  бездумное созерцание.
	## развилка на нейтрал-псих 
	# Я сидел и смотрел, как чудо технической мысли медленно ползет к краю стола, пытаясь добиться моего внимания. Еще немного, еще чуть-чуть…
	# С глухим пластиковым звуком смартфон упал на пол. Крышка и батарейка потерялись где-то под кроватью, остальная часть уставилась черным экраном в потолок.
	# "Абонент недоступен и находится вне данной реальности…"
	# В голову лезет какой-то бред. Действительно, надо бы сходить, проветриться.

	## Хруп хруп снегом

	# Промозглый ветер привычно стремился пробуравить тонкослойное пальто. Так же привычно ёжась, я заткнул уши плеером и запихал руки поглубже в карманы. Отвали от меня, мир. Я самодостаточен и независим.

	## Слайды зимнего города

	# Похоже, внезапно включившийся автопилот привёл меня к автобусной остановке, а не к магазинчику. 
	# Это было бы объяснимо, будь я обычным офисным рабом, но для фрилансера, который неделями не выходит из своей конуры? 
	# Тем не менее, факт был неоспорим - вот он я, а вот она остановка, и вдали видны задние фонари только что отъехавшего автобуса.
	## Где-то тут включаем музыку - Чайф "Дверь в лето". 
	# Картонная коробка на скамейке покачнулась, наверное из-за ветра. Забыл кто-то, в автобус садясь. Или террористы оставили. Ха-ха.
	# ЦГ коробки.
	# Коробка дрогнула еще раз, и еще, уже без помощи ветра, из-под крышки что-то выглянуло. 
	# Кто-то.
	## ЦГ котенка в коробке
	# Два темно-рыжих уха, два желтых глаза. Розовый нос. И раззявленая в осипшем мяуканьи пасть.
	
	# "Почему холодно?! Где я?! Что за безобразие! Это совсем неподходящее место для котёнка! Должно быть лето! Должно быть тепло!"
	# Я слышал эти возмущенные тирады как наяву. Впрочем, тут не надо быть знатоком кошачьего.
	# - И что мне теперь с тобой делать?
	# "Он еще спрашивает! Спасать!"
	
	# Выбора мне, похоже, не оставили. Я расстегнул пальто и посадил найденыша за пазуху.
	# - Ну что, пойдем домой?

	# В магазинчике, кроме продуктов и сигарет, нашелся стеллаж с зоотоварами. 
	# Лоток, наполнитель, миска, пакет детского корма по совету продавца, даже какой-то мячик с пушистой висюлькой… возвращался я тяжело нагруженным.

	# Спущеный на пол котёнок понюхал воздух, сел на пол и стал вылизываться. То есть стала. Ну хотя бы с полом определились.
	# - И как мне тебя звать?
	# "Почему ж она на Ю? Юлькой кошку звать мою!" - внезапно всплыл в памяти детский стишок. А что, подходит.
	# - Значит, будешь Юлькой. Согласна?
	# Юлька вытянулась на коврике и зевнула. 
	# Кажется, теперь я не один.
	## Ачивка - "Без кота и жизнь не та."

	## Таймскип, возможно по флагу тру-прохождения

	# - Семён Персунов, к вам делегация. Примете?
	# Как обычно, я не отвечаю. Всё равно я не могу отказаться, значит, можно игнорировать. Это у меня получается лучше всего - игнорировать. 
	# Я бездумно пересчитал вошедших. Восемь интернов, и доктор. Еще где-то на заднем плане маячит шкаф-санитар - перестраховываются. 
	# Виола-доктор: - Записывайте. Аномальная форма шизофрении, хронический галлюциноз…
	# Слушать не хотелось, и я вернулся к прерваному занятию. Гладить Юльку.
	# Помнишь, как всё началось? Да, я тоже помню. С ветеринара.

	# Эффект воспоминаний, можно фон ветеринарной клиники
	# - Мужчина, вы издеваетесь?!
	# - Но подождите…
	# - Пошёл отсюда, наркоман! Обкурятся своей дрянью… кошку ему вылечить, от прозрачности!
	# Звук "по мордасам" несколько раз.

	## Цг с мерцающей кошкой
	# Я не выдержал, вспылил… да, наверное, зря. Ты так и говорила. Но я и вправду беспокоился.
	# Дальше милиция, а потом и скорая, из психиатрички. Я уже был согласен на всё… 
	# Когда уже тут выяснилось, что они считают тебя галлюцинацией… и будут лечить меня… в общем, с тех пор этот шкаф, Саныч, все время присутствует где-то рядом.

	# Виола: - Был назначен курс нейролептиков, состояние пациента стабилизировалось, но улучшений не наблюдается. 

	# Эти поганые колеса даже не дают мне ничего почувствовать, Юля. Мне остается только равнодушно смотреть, как ты постепенно исчезаешь. 
	# Ты уже даже почти не разговариваешь, хотя я по-прежнему понимаю тебя, даже без слов.

	# Виола: - Динамика слабо-отрицательная, показан повторный курс с увеличением дозировки.  

	# Ещё немного, и всё закончится. Сначала исчезнешь ты, а я останусь… ненадолго. 
	# Хотя время уже не будет значить ничего. Ничто уже не будет важно. 
	# Я ускользну с тобой, оставив им лишь тупую оболочку, да, так и будет, Юля.
	# Ачивка "Без кота…"

    
label alt_uvao_ending_neutral:

    $ alt_uvao_replay_prologue=2
    # для 2 - нейтрал-ветка. Вместо реплик Шизы - смутные воспоминания о Совенке
    # и return после падения в реку
    # кусок текста вместо утреннего диалога с Шизой:
    "Я закрыл глаза и перед глазами вдруг очень явственно встала картинка массивных железных ворот с надписью «Совёнок» и два изваяния по разные стороны от ворот - пионер и пионерка, застывшие в гипсе. Это ещё что такое? Пионерлагерь? Откуда у меня такое воспоминание? Я никогда в жизни не был в пионерлагерях. И уж, тем более, в пионерлагере «Совёнок»." 
    
    # вместо реплики после телефонного разговора:
    "Домики-бочки, дорожки из бетонных плит и, насколько хватает глаз, всюду зелень. Пионерские лагеря.. Припоминаю нечто подобное. В конце концов, я из поколения последних октябрят, и о таких вещах как пионерлагеря, всё-таки знаю. А почему не был..? Наверное я уже тогда был социофобом."
    "Ладно, это всё лирика."
    
    #кусок с Шизой, копающейся в памяти пропускаем
    
    # кусок текста вместо гонева Шизы про копейщков:
    "И снова какое-то забытое воспоминание. Мне семнадцать лет. Я в толпе пионеров стою на площади на линейке. Перед нами выступает девушка. Совсем молодая, ненамного старше меня и других ребят. Её лицо кажется мне смутно знакомым. Как, впрочем, и лица некоторых ребят рядом."
    "И всё-таки – откуда эти воспоминания ?"
    "Автобус тронулся. Стекло дрожало от работающего двигателя, но меня такие вещи редко заботили - прижав голову к стеклу, я устроился поудобнее и бездумно изучал жизнь бетонного муравейника."
    "По ту сторону стекла остался морозный город и люди, которых я сначала боготворил, потом ненавидел. Теперь они стали мне безразличны. Бесконечный поток серых клонов с одного конвейера, с утра до ночи, люди, машины, люди, машины."
    "Хотя с некоторыми людьми я всё же поддерживал контакты. И среди них даже были девушки. Вот например девушка с фиолетовыми волосами, Лена, кажется. Необычный цвет. Хотя мне нравится. Она была ненавязчивой и очень стеснительной."
    "При встрече со мной она всегда молчала, видимо по причине своей застенчивости. Ну и хорошо. Не люблю, когда навязываются. Наверное поэтому мне было легко находиться с ней рядом."
    "В отличие от другой девушки, рыжеволосой. Как же её там звали..? Я напряг память. Алиса ! Точно, Алиса. О, эта была просто оторвой. Я всегда, при встрече с ней, опасался какой-нибудь подколки, могущей задеть мою честь, а то и здоровье."
    "Ну и остальные девушки – русоволосая Славя, болтушка Мику с длиннющими ультрамариновыми хвостами волос, огненно-красная девочка-огонёк Ульянка…"
    "ЧТО !!! Откуда у меня все эти воспоминания ?! ОТКУДА ?!"
    "Я что, схожу с ума ? Откуда эти несуществующие воспоминания ? Я никогда не был ни в каком лагере. У меня никогда не было таких знакомых девушек."
    "Надо успокоиться. Дышать ровно и глубоко. Вдох-выдох, вдох-выдох."
    
    call alt_day0_hikka_prologue # вход в дрищепролог, сразу после дисклеймера про злую волю автора.  

    # возврат после упавшего в реку автобуса.
    "И в тот самый момент, когда чёрные языки воды впервые лизнули подошвы моих ботинок - я, наконец, всё вспомнил!"
    "Лагерь ! Лагерь «Совёнок» ! Я ведь был там целую неделю. Все эти девочки, я их всех знаю. И знаю очень хорошо. И вожатую, выступавшую на площади, тоже знаю. Ольга Дмитриевна. Как я мог забыть. Мне ведь это не приснилось. Я на самом деле был там. Таких снов не бывает."
    "Так, быстро надо что-то решать. Я видимо сделал что-то не так в прошлый раз, проснулся у себя дома и меня снова закинуло в эту пространственно-временную петлю, в эту смертельную точку невозврата. Но видимо, мне дали шанс сё исправить, раз я всё вспомнил."
    "Как там было в прошлый раз ? Воспоминание, которое меня вытащило из тонущего автобуса. Надо повторить. А вода всё ближе. Видимо, моё индивидуальное восприятие времени, обусловленное приближающейся смертью, изменилось, потому что всё происходило как в замедленной съёмке."
    "Ворота, лагерь, Юля… Юля ! Она меня вытащила. Спасла от неминуемой гибели. И сейчас спасёт."
    "Из ничего соткалась картинка с воротами, ведущими, в пионерский лагерь и на переднем плане грустная Юля."
    "Я смотрел на Юлю и что было сил фиксировал её в сознании."
    "По ногам хлестнуло льдом, а в наушниках играл чёртов «пастух», и я был частично там - в прошлом, в памяти, но всё ещё на сиденье автобуса."
    "С: «Юля ! Помоги мне !»"
    "Юля продолжала грустно смотреть на меня и молчала."
    "С : «Юля ! Это же я, Семён ! Забери меня с собой. Мне так хочется в лето !»"
    "Ю: «Я не могу. Ты упустил свой шанс»"
    "С: «Нет-нет ! Я всё исправлю ! Я всё осознал и понял !»"
    "Ю: «На самом деле ты не хочешь возвращаться»"
    "Похоже это конец."
    "Я сам творец своих мыслей и желаний. Я выдумал себе идеальный мир. И даже в нём я умудрился всё испортить. Единственное, что было действительно идеально – это образ девушки передо мной."
    "Она иногда снилась мне. Иногда. Всю мою жизнь."
    "Звала с собой."
    "Но причины возвращаться из пелены сна всегда находились. Всегда. До сегодняшнего дня."
    "Видимо, я и вправду безнадёжен."
    "Девушка, что снилась мне всю мою жизнь, печально улыбнулась на прощанье, и горькая слезинка замёрзла на идеальной щеке."
    "Сначала перестала иметь значение боль."
    "Потом пропали саднящие ощущения в ссаженных щеках и бульканье в лёгких."
    "Мороз перестал иметь значение."
    "И… Темнота накрыла меня с головой ледяным тяжёлым одеялом."
    return