# План-набросок на поездку в автобусе в Д7 гуд (тру и фальш)
label alt_day7_uvao_bus_transfer:
# Сцена - лагерь, площадка перед воротами.

# ОД толкает речь на фоне ЦГ - подсмотреть у Автора.
# ГГ видит Лену (вероятно, в этот день - впервые, или до этого - только издали).
# В зависимости от выходов из Д6 Лена не поднимает глаз/смотрит мельком и сразу опускает глаза/смотрит смущённо, но с надеждой.
# В соответствии с этим ГГ предаётся краткой рефлексии. Боится, что Лена, чего доброго, решит сесть с ним.

# За рассадку пионеров в салоне энергично берётся ОД. Суда по их недовольно-удивлённой реакции - это непривычно, обычно все сами рассаживаются. ВОЗМОЖНО ОД заранее подзывает ГГ и предлагает ему заранее загрузиться в автобус в хвост салона, отдохнуть после беготни ("намёк понял")
# В итоге ГГ оказывается на сиденье в последнем ряду (намёк понял, если вдруг куда денусь по дороге - меньше народу заметит), притиснутый к окну Элом (ну и ладно, этот хоть болтать не будет всю дорогу).

# Автобус отправляется. В окно светит солнце, в салоне жарко, потёртые красные занавески не помогают.
# Возможно, перекидываются парой незначительных фраз с Элом. Обоим неинтересно продолжать разговор.
# Не смотря ни на что, ГГ начинает клонить в сон от духоты и общей усталости, перед этим работал всё утро за Славю.
# Сквозь дрёму замечает, что Эл куда-то свалил (ну и ладно, меньше народу - больше...)
# Засыпает.

    scene black
    "Кажется, меня нет."
    "Меня совсем нет."
    "Но если меня нет, то кто я? {w} И почему мне так холодно?"
# сцена - полузатопленный автобус с мерцающей лампочкой by Ленофаг.
    "Я с трудом открываю глаза."
    "Очень холодно и очень больно. Тело совсем окоченело, я не чувствую ни рук, ни ног, больно где-то внутри."
    "Почему мне так холодно? Ведь сейчас лето."
    "Лето... {w=2}Или зима? {w=3} Я помню, было лето и было тепло. {w=2} А где оно было? {w=1}Не могу вспомнить."
    "Я хочу вспомнить и не могу. Холодно."
# потырить у Автора из Д1 подводную анимацию, желательно - затемнить.
    "Я снова открываю глаза. {w} Очень хочется дышать, но нельзя - я ведь под водой."
    "Нельзя дышать, но так хочется! {w}Зато не холодно и почти не больно, только очень хочется дышать."
    "А если чуть-чуть? {w}Я только немного вдохну, хотя и нельзя. Капельку. {w}И сразу выдохну, правда-правда!"
    # срашный звук
    "ХОЛОДНО!"
    "Я хочу закричать, но не могу - в открытый рот врывается вода, забивает тысячей безжалостных игл горло, а потом и что-то внутри. Что-то очень важное, без чего я не могу."
    scene black
    "Хотя нет, уже не холодно."
    $ renpy.pause(3, hard=True)
# сцена автобус внутри with flash 
# хорошо бы звук судорожного вдоха, если в Д0-Д1 есть
    "Я рывком вынырнул из сна, жадно глотая горячий воздух судорожно разинутым ртом, захлёбываясь им от жадности."
    el "Эй, ты чего?"
    "Сидящий рядом Эл оторвался от своей книжки и испуганно посмотрел на меня."
    el "Семён, ты в порядке? Приснилось что-то?"
    me "Прис...приснилось, да. {w}Сон."
    "Я наконец немного совладал с собой и пару раз полной грудью вдохнул-выдохнул душный воздух салона с привкусом пыли и разогретого пластика. {w}Господи, какой кайф!"
    th "Успокоиться. Дышать ровно. Это просто сон."
    me "Это просто сон."
    "Повторил я, откидываясь на спинку сиденья. Эл качнул головой, но привязываться не стал и вновь уткнулся в свою книжку."
    "Автобус мерно покачивало, иногда слегка встряхивая на неровностях, тарахтение дизеля отдавалось легкой дрожью в салоне."
    "Пионеры притихли - одних разморило от жары, другие пялились в окна, изредка переговариваясь между собой. Откуда-то из передней части салона доносились деликатные шлепки карт - ну да, здесь уже не лагерь, уже как бы и не считается."
    "Мой сон... Я не хотел его вспоминать. {w}Мне было всё равно, значил он что-то важное, или я просто слегка перегрелся."
    th "Плевать. Не хочу об этом думать. Я здесь, живой - этого вполне достаточно."
    "С кресла в первом ряду поднялась Ольга, окинула взглядом салон. Поймав мой взгляд, довольно кивнула чему-то и снова уселась на место."
    "Наверное, её взгляд тоже мог что-то значить, но об этом будет время поразмыслить потом. {w}Пока что можно просто дышать в своё удовольствие и наслаждаться жарой - как будто мне целой недели было мало."
    "Наконец я совсем успокоился. Автобус мерно катил куда-то вперёд, пейзаж за окном не баловал разнообразием, так что я начал подумывать уже, не рискнуть ли ещё разок навестить Морфея - вдруг на этот раз меня не будут терзать какими-то ужасами?"
# В принципе, здесь можно бы и просто заснуть без сновидений, проснувшись уже на автобусной станции, но...
    "Откуда-то спереди раздался негромкое, но требовательное зудение зуммера. Вожатая встрепенулась, резво перебралась на сиденье рядом с водителем, предназначенное для экскурсовода, и извлекла откуда-то снизу нечто сильно смахивающее на телефонную трубку."
    th "Не понял, это что, рация? Разве в \"Икарусах\" ставили рации?"
    mt "Слушаю."
    mt "Да."
    mt "Но..."
    mt "ЧТО?!"
    mt "Д...да, я слушаю."
    mt "Да, понятно. Понятно."
    mt "Да, отбой."
    "Несколько секунд Ольга сидела неподвижно, глядя на дорогу впереди автобуса. Потом наклонилась к водителю и что-то быстро зашептала ему на ухо."
    "Автобус вдруг вильнул влево, но тут же вернулся на прежний курс. Возможно, водителю пришлось объехать какую-то неровность на дороге."
    "Двигатель вдруг заворчал обиженно, набирая обороты, и тяжёлый автобус начал понемногу разгоняться. Через минуту скрость уже явно перевалила за сотню. Мерная качка сменилась неприятной тряской, автобус ощутимо водило влево-вправо." # ЛБ: для Ikarus-250 (туристический) макс. скорость по паспорту 120 км/ч
    "Как ни странно, всё происходящее не произвело на пионеров особенного впечатления. Несколько голов, высунувшихся было в проход при звуке зуммера, давно спрятались обратно."
    "Если бы не явно чрезмерная скорость и не вожатая, застывшая на сиденье экскурсовода спиной к салону, можно было бы подумать, что тот странный разговор по рации мне просто почудился."
    "Я уже совсем было собрался прогуляться вперёд и прояснить пру вопросов, как Эл, вяло клюющий носом над своей книжкой, вдруг встрепенулся и прислушался к чему-то. Тут и до меня дошло, что к привычному уже мерному шуму автобуса примешивается какой-то новый звук - низкий, отдающийся где-то внутри тела равномерный гул."
    el "Самолёт!"
    "Подтвердил мою догадку Сыроежкин."
    "Он с интересом завертел головой, прислушиваясь, хотя верти-не верти, становящийся всё громче гул проникал повсюду."
    el "Турбовинтовой!"
    "С видом знатока добавил Эл."
    el "По-моему, это Ту-95, звук характерный."
    "Я с подозрением посмотрел на парня. Правильно истолковав мой взгляд, он обиженно засопел."
    "У меня старший брат служит в... ну... неважно. Служит, короче. {w} Он мне много рассказывал про них. Ну и в открытых источниках..."
    "Я ошарашенно уставился на Сыроежкина."
    me "Подожди, какие ещё \"открытые источники\"? Ты о чём вообще?"
    el "Ну как же, Ту-95! Ну ты что, не знаешь, что ли? Стратегический бомбардировщик!"
    "Я честно пожал плечами. В интернетах столько всякого попадается - кажется, действительно встречалось что-то похожее. Или нет."
    me "Может и слышал. Дальше-то что?"
    el "Ну как же! Это же круто! Боевая нагрузка больше десяти тонн! {w}К тому же, я думал, они все на Севере базируются или на Дальнем востоке. Вот уж не ожидал его вживую пусть не увидеть, так хоть услышать."
    "Эл принялся протискиваться мимо меня к окну, изо всех сил вытягивая шею."
    el "Да вот же он!"
    "Парень ткнул пальцев вверх. Теперь и я заметил высоко в небе ползущую нам навстречу искорку."
    el "Надо же, и самом деле очень громкий! А ещё он..."
    "Электроник явно собирался загрузить меня по полной программе, но тут встала со своего места вожатая."
    mt "Ребята, внимание!"
    "Её громкий голос заставил встрепенуться самых сонных."
    mt "Ещё раз внимание! Сейчас мы все примем участие в учениях по гражданской обороне! Наша задача в максимально короткие сроки выгрузиться из автобуса и укрыться от поражающих факторов ядерного удара, нанесённого условным противником."
    "Раздались нестройные голоса - похоже, мало кому улыбалось принимать участие в каких-то учениях, вместо того, чтобы спокойно дремать в кресле, но вожатая разом отмела все возражения."
    mt "Участие обязательное, зачёт на время по последнему укрывшемуся. Для тех, кто не понял, объясняю - если кто-то решит филонить, то зачёт не получат все. {w}И да, имейте в виду, что в этом году изменились правила прохождения нормативов ГТО - справка о получении зачёта по гражданской обороне становится обязательной."
    "Атмосфера в салоне моментально изменилась. Теперь можно было быть уверенным, что зачёт получат все, а слишком медлительным помогут товарищи. {w}Возможно, даже пинками."
    mt "По условиям учений, вещи с собой не берите, никуда они не денутся."
    "Автобус резко затормозил. Раздались недовольные возгласы - похоже, некоторые приложились о спинки кресел перед собой. Зашипела, открываясь, дверь."
    mt "Соблюдая порядок, организованно и быстро выходим и строимся возле автобуса! Время пошло!"
    "Крикнула вожатая. Пионеры, переговариваясь, полезли со своих мест в проход, толпясь и толкаясь у двери."
    mt "Быстро, быстро, время идёт!"
    "Торопила их вожатая, то и дело поглядывая на часы."
    "Подождав, пока большинство ребят выберется наружу, я подтолкнул вперёд Электроника, сам идя последним."
    "Я ничего не понимал в происходящем, но, сам не знаю почему, в одном был уверен твёрдо. Всё, что Ольга сказала про учения - ложь от первого и до последнего слова."
    mt "Быстро, быстро!"
    "Крикнула мне в лицо вожатая."
    me "Ольга, я последним шёл. В салоне никого не осталось."
    "Негромко ответил я."
    me "Можете мне объяснить, что случилось?"
    "Секунду она словно в замешательстве смотрела на меня, и я успел заметить, что зрачки у неё расширены чуть ли не до размеров радужки."
    th "Да у неё же шок! Что за хрень здесь происходит?"
    "Ольга молча кивнула на дверь и выскочила из автобуса следом за мной. За нами спустился водитель, грузный усатый дядька в футболке."
    "Я огляделся. Дорога в этом месте огибала небольшой холм, у склона которого остановился автобус."
    "Дети, разумеется, и не думали строиться, столпившись вместо этого рядом с автобусом на обочине и оживлённо обсуждая происходящее. {w} В глаза мне бросилось испуганное лицо Мику, стоящей отдельно от остальных."
    "Ольга энергично хлопнула в ладоши, привлекая к себе внимание."
    mt "Так, все выгрузились, молодцы! {w}Теперь укрываемся вот здесь, на склоне холма, направление на место условного взрыва... там."
    "Она махнула рукой куда-то за холм и бросила нервный взгляд на часы."
    mt "Контрольное время пребывания в укрытии... десять минут. {w}Потом... Потом учения считаются успешно законченными."
    "Под ободряющие покрикивания Ольги ребята потрусили к холму."
    "Я покосился на водителя. Тот стоял бледный до зелени, опершись спиной на автобус и держась за сердце. Потом медленно отлепился от крашеного железа и побрёл вслед за детьми."
    mt "Семён, тебе отдельное приглашение нужно?" # ЛБ: вспоминаем про спрайты. здесь - angry
    "Набросилась на меня вожатая, видя, что я стою на месте."
    mt "Давай в укрытие, зачёт по последнему..."
    me "Ольга, что происходит? Я ведь понимаю, что это никакие не учения, но что происходит на самом деле?"
    "Её лицо вдруг разом покраснело, она закусила губу и отчаянно замотала головой, изо всех сил стараясь не разреветься в голос."
    "В голове у меня словно что-то щёлкнуло."
    th "Неужели..."
    "Цепенея от ужаса, я неловко повернулся на ставших ватными ногах, сделал несколько неуверенных шагов и вдруг, словно меня толкнули, бросился бежать."
    "Кажется, вслед мне что-то кричали, но это было сейчас неважно. {w}Я бежал, выкладываясь как спринтер. Бежал, как будто впереди была стометровка, а не несколько десятков километров пустого асфальтового шоссе."
    "Бежал, как будто это что-то могло изменить."
    "Воздух в лёгких кончился как-то разом, без предупреждения. Заполошно дёргающееся сердце болью отдаётся в висках, желудок судорожно сжался, подбираясь к горлу."
    "Нет, не останавливаться. Бежать."
    "Хилое человеческое тельце, мышцы в считанные секунды сожгли все запасы энергии и напоминают теперь дряблые верёвки. {w}Неважно. Бежать."
    "На меня что-то находит, и мне кажется, что я - это не только жалкая кукла, ковыляющая по раскалённому асфальту, подволакивая ноги."
    if <флаг пройденного ЮВАО-бэда>:
        "Нет, я ещё и неслышно скольжу по лесу, гибкое тело ловко уворачивается от веток, сильные босые ноги легко ступают по траве и корням деревьев, а хвост помогает удержать равновесие. В то же время я стою под окном столовой и прикидываю, не забраться ли внутрь - вдруг там осталось что-нибудь вкусное."
        "Ещё я прохожу между опустевших домиков, любопытно поводя ушами. Нагибаюсь и поднимаю из травы стеклянный шарик - какой красивый! - наверное, кто-то обронил."
        "Я же бегу по пыльным подземным коридорам, резко сворачивая на поворотах - просто так, низачем. Нравится."
        "Меня вообще очень много."
        "И одновременно со всем этим я стою на площади лагеря, запрокинув голову, и смотрю, как по небу ползёт яркая серябряная искорка, оставляя за собой красивый белый след."
    else:
        "Одновременно с этим я прохожу между опустевших домиков, любопытно поводя ушами. Нагибаюсь и поднимаю из травы стеклянный шарик - какой красивый! - наверное, кто-то обронил."
        "Неслышно ступая босыми ногами, выхожу на площадь, запрокидываю голову вверх и смотрю, как по небу ползёт яркая серябряная искорка, оставляя за собой красивый белый след."
    "Потом там появляется ещё что-то - я не успеваю толком разглядеть что - как оно становится больше, больше..."
    "Немножко похоже на три белых воздушных шарика, к которым привязано что-то маленькое. Нет, шарики не такие, я знаю, какие они бывают, но всё равно красиво, мне нравится."
    "Мир полон ласкового солнечного света и тепла, мне совсем не скучно стоять и смотреть вверх на эти красивые белые штучки, которые понемногу становятся больше, и белый след, который оставила в небе та искорка - жаль, что её уже не видно."
# белый экран
# пауза 2 секунды.
    "Свет. Во всём мире ничего нет кроме белого света."
# жёсткая пауза 5 секунд.
    "Я открываю глаза. В них по-прежнему бьёт резкий до боли свет, я моргаю и пытаюсь отодвинуться."
# Просыпается мордой в оконное стекло, частично - в занавеску. (возможно, здесь пустить в бэк размытый салон "Икаруса")
# Поднимает голову - салон пуст. (бэк - салон в фокусе)
# ГГ паникует, снова суётся в окно и немедленно натыкается на пристальный взгляд Мику по ту сторону стекла (ЦГ из Д1, но фон заменить на сильно размытую автобусную станцию).
# ГГ приходит в ужас (Это уже было! Что, опять???), но тут Мику улыбается, отскакивает от окна автобуса и радостно кричит-тараторит "Да вот же он! Я говорила вам, что он опять спит! Он и в прошлый раз всё проспал, когда приехал."

# За грязноватым оконным стеклом ГГ обнаруживает вместо лагерных ворот какое-то здание/забор/что там найдётся для бэка точки прибытия. (Автобусная станция с ВДНХ - предел мечтаний!)
# Слышим с улицы гомон.
# Похоже, остальные пионеры попросту успели выгрузиться, а Семёна никто не заметил/забыли.
# Над общим нестройным хором прорывается голос Ульянки: "Сейчас! Сейчас я его приведу, пропустите!!!"
# ГГ вдрагивает, представив себе "приведу" в её исполнении и торопится на выход.

# Сцена - точка прибытия.
# Суета, толпятся пионеры, частично перемешались уже со встречающими родителями.
# ОД мечется с какой-то бумагой, пытается родителей отловить и заставить в ней расписаться.
# На общем фоне выделяются Лена и Славя. Обе имеют вид до невозможности смущённый, у Лены лицо явно заплаканное. Увидев выбравшегося из автобуса ГГ, смущаются ещё больше (хотя, казалось бы, куда уж больше).

# Если в Д6 выяснили про наведённость влюблённости Лены, либо пошли через врезку и имели с ней беседу вечером, то она, кажется, порывается подойти к ГГ, но тут к ней подваливает какой-то родственник в милицейской форме.
# Если потребуется, то аналогично нейтрализуется Славя - её отлавливает крупная тётка (посмотреть в Мику-руте), Славя почему-то груснеет
# ГГ отвлекается на Алису. Та незаметно подходит сзади и:
# - Если вышли на тру и послали Алису за Леной, то дружеский (хотя и крепкий) тычок в плечо. Подмигивает: "Знаешь, хотела тебе сказать на прощание - а ты, новичок, не такой уж придурок, каким мне сначала показался.{w} Ну, бывай!". Хитро лыбится и уходит прочь, не оглядываясь.
# - В противном случае - проходя мимо, Алиса крепко задевает плечом. Бросает через плечо "Будь здоров, новичок!"
# В любом случае, ГГ потирает плечо и смотрит в гордую спину Алисы, волокущей здоровую сумку.

# На фоне всеобщего воссоединения родственников (возможно, краткое описание некоторых встречающих, подсмотреть в других рутах) ГГ падает духом и не представляет, что делать дальше. Минута слабости.

    "Внезапно я со всей очевидностью понял - я остался {i}здесь{/i}.{w=1.5} Окончательно.{w=1.5} Пути назад больше нет.{w=1.5} Совсем."
    th "И что мне теперь делать?"
    "Я вдруг вспомнил, как потерялся в каком-то большом магазине, когда мне было года три, наверное."
    "Только на минуту отвернулся от мамы, посмотреть на прикленный к стене плакат с красивой тётей в красном платке - и вдруг вокруг оказались одни чужие люди."
    "Все куда-то спешили мимо, а мамы не было. Я понял, что пропал, и заревел, разумеется - а что ещё мне оставалось делать?{w} Все вокруг засуетились и страшно зашумели, а потом мама нашлась и подхватила меня на руки."
    "Разумеется, с тех пор прошло лет двадцать пять..."
    th "Минуточку... или пятнадцать? Надо бы всё-таки с возрастом для себя определиться, чтобы не путаться."
    "Так или иначе, времени прошло достаточно, и реветь я не собирался."
    th "Но всё-таки, что же мне делать дальше?"

# Возможно, здесь ГГ подспудно ожидает реплики Шизы, но там молчит наглухо, словно радио выключили.

# Рядом возникает ОД.
    mt "Уф, наконец-то все! Вечно норовят забрать ребёнка, и сбежать, а у нас же отчётность!"
    mt "Ты чего нос-то повесил?{w} Пойдём, будем теперь твои дела улаживать."
    "Она тряхнула в воздухе какой-то довольно увесистой папкой на завязочках."
    mt "Вот, всего-то неделю ты у нас, а уже сколько бумажек собралось!"
    "Я опешил."
    me "Это что, всё я? То есть, я хотел сказать, это всё про меня?"
    mt "Ну а ты как думал? Всё-таки мы серьёзная контора, отчётность на уровне."
    "Ольга внезапно помрачнела и тяжело вздохнула. Кажется, отчётность у них и впрямь была на уровне..."
    "Рядом взревел проржавевшим глушителем милицейский \"бобик\". За окном я успел заметить знакомые зелёные глаза и смешной фиолетовый хвостик."
    th "Так я и не узнал у Лены, крашеные у неё волосы, или здесь такой цвет и от природы бывает."
    "Подумал было я, но тут же мысленно хлопнул себя по лбу:"
    me "Ольга Дмитриевна, а по дороге ничего не случилось... Ну такого...{w} Я когда из автобуса вышел, у Лены со Славей какой-то странный вид был..."
    "Ольга снова вздохнула."

# ОД излагает, что Лену со Славей отпустило (или только Лену, или только Славю - смотря по обстоятельствам Д6. Про другую девочку говорит смутно).

    "Ольга упрямо тряхнула головой и на её лице вновь появилась лёгкая улыбка."
    mt "Ладно, Семён, пойдём. Время уже к вечеру, а ещё столько всего надо успеть!"
