## Д6 после обеда
## Моем-моем трубочиста - Семён принимает душ перед амурной Славей. 
## площадь
# Пересекая площадь наискось, я поймал себя на том, что насвистываю какую-то незатейливую мелодию, и даже слегка пританцовываю, размахивая полотенцем.
# "А и пофигу! В кои-то веки у меня есть повод вести себя соответственно моей здешней роли…"
# Ш: "Вообще-то твоя всегдашняя роль - неудачник." 
# "За-дол-бал! Ты вообще чей друг, мой или медведя?!"
# Ш: "Я просто напоминаю. Должен сам привыкнуть, что если все складывается хорошо - жди беды."
# В чем-то мой ехидный комментатор был прав. Но, тем не менее, испортить хорошее настроение ему было не под силу. 
# "Не думаю. Пока всё складывается довольно неплохо - умоюсь, схожу со Славей на концерт, да и на танцы тоже… "
# Ш: "Ага, приходишь такой весь свежевымытый, а Славя и говорит - Семён, будь другом, помоги мне в сарае разобрать, позязя!"
# Ш: "Или еще что-нибудь такое же…"
# Ш: "Только мыло зря потратишь."
# "Так, кто только что мне втирал, что она просто решила взять штурвал в свои руки? Ты уж придерживайся какой-нибудь одной линии."
# Ш: "Не штурвал, а поводья тогда уж. А по поводу линии - ты всерьёз мне будешь объяснять, как должно вести себя раздвоение личности?!"
# Ш: "Я просто предостерегаю. Уж очень все внезапно, и без малейших усилий с твоей стороны. Подозрительно!"
# Наверное, стоило бы прислушаться… Но мне до жути не хотелось возвращаться к своему прежнему modus operandi. 
# "Да ерунда. Что такого может случиться, чего стоило бы опасаться?"
# "Ну может погуляем после танцев где-нибудь…"
##if кормили ежиков после турнира в д2
# "покормим еще каких-нибудь ежиков."
# "Все будет мило и романтично. И это - максимум!"
# Ш: "Ну-ну… "

##фон с душевыми
# За препирательствами я и не заметил, что уже дошел до цели, и едва не прошел мимо на автопилоте. 
# Так, где здесь Эм, и где тут Жо?
# Ш: "Да, главное, не перепутать. Впрочем, если там Славя..."
# "Да отвяжись ты уже."

##кое-кто переменил таблички М и Ж.

#if обедал с Алисой и отказался от Лены:
# Тем не менее, я проверил фанерную табличку на двери. Да, ошибок быть не может, треугольник острием вниз и кружочек над ним, выжженные в дереве - продукт творчества какого-то пионера с зачатками художественного таланта. 

# Успокоенный, я вошел внутрь, положил сверток с принадлежностями на скамейку и собрался раздеваться. 
##раздевающаяся Алиса в купальнике. 
# "Упс…"
##пауза
##фон, злобная Алиса в купальнике 
# Алиса: Т-ты… ты-ы… Скотина-а!!! 
# Что-то мелькнуло в воздухе, и я едва успел прикрыть глаз. Суровое советское вафельное полотенце, по ощущениям, содрало мне половину лица, не хуже наждачки.
# - Эй! Ты чего?!  Прекрати, придурошная!!! 
# Завопил я, отпрыгнув за пределы досягаемости острых кулаков.
# Алиса: - Я?! Я придурошная?! 
# - Ну не я же! Ты нахрена в мужской душ залезла?! 
# Алиса: - Какой еще мужской?! 
# - Такой, блин! 
# Вместо долгого спора я ткнул пальцем в табличку на весьма кстати приоткрывшейся двери.
##офигевшая Алиса
# Алиса: - Что-о?! Какого…? Еще вчера было наоборот! 
# Алиса: -Найду, кто перевесил… не жить ему больше! 

##смущенная/раздраженная Алиса
# Алиса: - Эй, хорош пялиться уже! Иди  на свою Ленку пялься! 
# "Мою Ленку? Когда это она успела стать моей?"
# Я не стал обострять конфликт и послушно вышел. 
# Шиза: "А я предупреждал. Когда всё хорошо - жди подляны."
# "Ну и ладно. Закончилось все вполне неплохо - всего лишь получил по физиономии полотенцем. Могло быть гораздо хуже."
# Шиза: "И лучше тоже. Можно было бы застать Алису совсем неглиже."
# "И получить уже не полотенцем, а, скажем, скамейкой. Нет, спасибо, оно того не стоит."

# "Всё-таки интересно, чьих рук это дело?"
# - Ульяна! 
# Фигурка в красной футболке, методично чеканящая мячик на поле, обернулась. 
# Ульяна: - Чего-о? 
# - Иди сюда!
##Ульяна
# Ульяна: - Чего зовешь? 
# Я кивнул на дверь. 
# - Твоя работа? 
# Ульяна: - А? Где?! 
# - Таблички ты поменяла? 
##раздраженная Алиса,уже одетая
# Алиса: - Ульяна! Ты совсем наглость потеряла?!
##возмущенная Ульяна
# Ульяна: - А что я?! Я тут вообще не при чем! 
# Ульяна: - Я же не совсем дура - такую подлость делать! Тем более тебе! 
##Ульяна покраснела
# Ульяна: - Тебя же могли… {b}голой{/b} увидеть! 
# Алиса: - А кто тогда?! 
##возмущенная Ульяна
# Ульяна: - Не знаю! Точно не я! 

# Из кустов поодаль раздалось сдавленное фырканье. Потом из зарослей вывалился какой-то белобрысый пацан, и, не прекращая хохотать, ломанулся прочь. 
# Ульяна: - Данька! Это он! 
# Алиса: - Стоять! Убью гада!!!
# Рыжие одновременно сорвались с места и бросились в погоню. 
# "Если они его догонят - я ему не завидую… Впрочем, заслужил."


#else:
##прямой выход на амуры со Славей

# Применить дедуктивный метод на практике мне не дали. 
# Женя: - ПОШЕЛ ВОН!!! 
# Изнутри раздался крик, дверь распахнулась и из нее спиной вперёд вывалился полуголый Сыроежкин. Дверь захлопнулась обратно, так,  что табличка с аршинной буквой М едва не рухнула на землю, вырвав шурупы. 
# "Этот голос… Стоп!"
# "Что Женя делает в мужской душевой?!"
# Я вопросительно уставился на Электроника, он ответил ошарашенным взглядом. 
# Эл: - Я ничего… Я вообще! 
# Шиза: "Ничего не делал, только вошёл!"
# Эл: - А там - она! 
# Это "она" было произнесено с такой гаммой чувств… 
# Шиза: "Мне всё ясно. Наш многоуважаемый гриб застал Евгению-свет-книгочеевну в весьма интересном виде, и до сих пор не может отойти от увиденного."
# Шиза: "А если б ты поторопился - этот шанс достался бы тебе!"
# "Ну уж нет, спасибо. С радостью уступлю право получить когтями по физиономии, к тому же он, кажется, не против."

# Дверь отворилась, и мы синхронно отпрянули. Излучая космический холод, Женя прошествовала мимо нас. Взгляд ее был подчеркнуто устремлен вперёд, грация и осанка напоминали ножницы по металлу - я почти слышал характерный скрежет. 
# Эл: - Женя, я… Извини… Но там ведь М написано было! Вот и… 
# Его лепет был проигнорирован на корню. Все так же не утруждаясь обратить на нас хоть толику своего царственного внимания, библиотекарша скрылась из виду. 
# Эл сокрушенно вздохнул, подобрал рубашку и поплелся прочь. 
# Шиза: "Да, не повезло чуваку. Из кожи вон лезет, чтоб она на него внимание обратила, а выходит сплошной облом."
# Шиза: "Тебе его жаль?"
# "Немного. Но не настолько, чтоб бежать его утешать."
#/if

# "У меня теперь другой насущный вопрос. Которую из душевых считать мужской - традиционную или фактическую?"
# Шиза: "Ориентируйся на таблички."
# "Да? Почему?"
# Шиза: "По нескольким причинам. Во-первых, снаряд два раза в одну воронку не попадает."
# Шиза: "Во-вторых, в случае чего притворишься дурачком, который ничего не знал - впрочем, тебе даже притворяться не надо."
# Шиза: "И, в-третьих, а вдруг кто-нибудь и вправду на огонёк заглянет?"
#if беседа с Алисой:
# Шиза: "Например, Лена… Ну или Славя."
#else:
# Шиза: "Славя, например."
#/if
# Вздохнув, я последовал совету комментатора. 

# На этот раз все прошло без эксцессов, и через некоторое время я, прямо-таки скрипя от чистоты, топал обратно. 

# Вожатой дома уже давно не было - как оказалось, моя возня в душевых заняла целый час! 
# "Эдак я и к концерту опоздаю!"
# Ш: "Что, не терпится к активисточке? Так не теряй времени, беги, тебя обязательно к чему-нибудь привлекут." 
# Ш: "Общественно-полезному."
# Ш:" Не знаю, покрасить что-нибудь или починить… Короче, дело найдётся!"
# Я привычно не обращал внимания на выходки внутреннего голоса. Бубнит себе и бубнит, радио "Ненависть" моё ... 
# Такое чувство, что он-она-оно меня… ревнует? 
# Ш: "Ну всё, ты меня раскрыл. Вывел на чистую воду, все пропало, пойду поплачу в углу."
# Конечно, разве так просто признается…

# Я закинул полотенце и прочее обратно в шкафчик и попытался в очередной раз завязать каноничный узел на галстуке. 
# "Похоже, это искусство выше моего понимания. Хрен с ним!"
# Пригладил перед зеркалом растрепанные после мытья волосы - ну, сойдёт. 
# "Ну что, я готов. Действительно, сходить помочь на сцене что ли?"
# Забавно. Недавний я согласился бы на это только под угрозой расправы, да и то не факт. Совсем давний я - воспользовался бы поводом, чтобы подкачать к понравившейся девушке, и только взаимная симпатия смогла бы искупить ту дурь, которую я стал бы вытворять. 
# А сейчас - я просто не против сделать что-то, не ожидая непременных дивидендов. 
# "Впрочем, отказываться я тоже не буду."
# Всё-таки удивительно, что такая девушка, как Славя, проявляет ко мне неподдельный интерес. Что же она такое во мне разглядела? Понятия не имею. 
# Ш: "Сие тайна великая есть." 
# Ш: "И Юле ты чем-то приглянулся… Как же ты будешь этот треугольник размыкать?" 
# "Да какой там треугольник…"

# "Я всего лишь следую совету Виолы - стараюсь пожить жизнью обычного пионера. Вроде бы пока получается."
## TODO: добавить оный совет в утренние разговоры 

##домик снаружи 
# Выйдя на крыльцо, я запер дверь и собрался бежать к сцене… 
# Ю: - Семён. 
# Я завертел головой, стараясь понять, откуда донесся голос. Откуда-то… сверху? 
##выглядывает сверху 
# Ю: - Привет, Семён. 
# - Юля! Ты чего там делаешь?! Тебя же заметят! 
# Ловко перекувыркнувшись в воздухе, она приземлилась рядом со мной. 
# Ю: - Не заметят, я хорошо прячусь. Даже ты меня не заметил. Пока я тебя не позвала. 
# - Всё равно, мало ли… А зачем ты меня искала? 
# Ю: - Узнать. Там что-то происходит интересное. 
# Ю: - Всё бегают и суетятся. Почему? 
# - Где? 
# Она махнула рукой в сторону. 
# Ю: - Там. Где большой дом без стены.И рядом. 
# - Ааа, на сцене? Концерт готовят. Выступление, понимаешь? 
# Ю: - Выступление? Концерт? 
# Она непонимающе смотрела на меня.
# - Ну да. Музыка, песни, может танцы. Каждый показывает, что он умеет. А остальные смотрят. 
# Ю: - Ааа. Поняла!
# Ю: - Я раньше видела. Но тогда не было интересно, а сейчас - интересно. 
# Ю: - Ты пойдёшь смотреть? 
# - Пойду, конечно. И потом тебе всё-всё расскажу! 
# Ю: - Зачем? Я сама посмотрю. 
# - Ты что?! Тебя же заметят! 
# Ю: - Нет. Я хорошо спрячусь, никто не увидит. Я хочу посмотреть. 
# "И как мне теперь выполнять просьбу Виолы, хотел бы я знать?"
# - Где ты там спрячешься? Там же…
# Ю: - В кустах. Залезу и притворюсь, будто я - тоже куст. 
# "Не нравится мне это. Столько народу, кто-нибудь точно заметит, а там - паника, все разбегаются, Алиса с Ульяной, наоборот, кидаются ловить… "
# Юля, будто прочитав мои мысли, засмеялась. 
# Ю: - Не бойся, меня никто не увидит. Я очень хорошо умею прятаться! 
# Ю: - А ты тоже со мной в кусты полезешь? 
# Ш:" Гусары, молчать."
# Я непроизвольно фыркнул. 
# "Даже и не знаю… Надо бы проследить, чтоб никто не заметил."
# "Вот только кто-то обязательно заметит меня. Я-то не смогу притвориться листиком дерева!"
# - Я, эээ, нет. Я, наверное, лучше на скамейке буду сидеть. 
# Ю: - Да, тебя труднее будет спрятать. Сиди лучше там. 

##звук начала концерта. Какое-нибудь музыкальное вступление? Первый звонок

# В воздухе разнеслась какая-то короткая мелодия, заставив нас с Юлей насторожить уши. 
# Ю: - Музыка? Началось уже? 
# - Кажется, нет, но скоро начнётся. 
# Ю: - Я побежала! Прятаться! 
# Лишь хвост мелькнул между кустов - и я остался один. 
# "А я-то надеялся просто посмотреть концерт… Теперь придётся постоянно следить, чтоб никто случайно не наткнулся на Юлю. "
# Ш:" А если наткнётся?"
# "Тогда… Не знаю. Придётся импровизировать."
# Кстати, мне тоже пора бежать, если я хочу успеть пораньше. 


# Концерт, ужин и побег со Славей с дискотеки - ветка, где считаем, что Славя нас окучивает с амурными целями
init:
    $ tl_7dl = Character(name=u"Толик", color="#A1752F", what_color="E2C778", drop_shadow = [ (-1, -1), (1, -1), (-1, 1), (1, 1) ], drop_shadow_color = "#000")
    $ alt_uvao_D6_CS_vetrov = False
# TODO: Перекинуть толика куда-нибудь
# Перед релизом последний alt_script возьмём туда и всунем. -R
label alt_day6_uvao_concert_with_sl:
    window hide
    $ alt_chapter(6, u"Юля. Концерт")
    scene bg ext_stage_normal_day
## сцена
# У сцены творилось небывалое оживление. Пионеры сгрудились кучками, кто-то торопился занять самые козырные места себе и друзьям, кто-то, наоборот, не спешил усесться, участники выступлений в спешке проводили самую распоследнюю репетицию… В воздухе витало радостное предвкушение вперемешку с волнением. 
# "Похоже, итоговый концерт и вправду все ждут. Совсем не так, как позавчерашнее насилие над слухом и зрением - то было для галочки, а тут все и впрямь стараются выступить, продемонстрировать умения перед товарищами…"
# Я поймал себя на мысли, что чертовски завидую им - вот так выйти под ослепляющие взгляды публики, заявить свое право на толику их внимания… 
# Ш: "Может, тебе тоже стоило бы поучаствовать?" 
# "С чем, интересно? Мой предел - три блатных аккорда, да и те уже не помню когда последний раз исполнял."
# "Пение - тоже не вариант. Может, голос у меня и не самый плохой, но… Короче, лучше не стоит."
# "А больше мне и нечем похвастаться."
# Ш: "Один вариант забыл. Стендап-комик." 
# "Да ну тебя."
# Ш: "Не, я серьёзно. Сделаем тебе амплуа белого клоуна, с которым постоянно какая-то ерунда происходит, будешь об этом со сцены вещать."
# Ш: "А с текстом я тебе буду подсказывать." 
# Ш: "Успех гарантирован! Ну, или побьют, что тоже признание…" 
# "Нет, спасибо!"

# Славя: - Семён! 
# Окликнули меня сзади. Я обернулся. 
## Славя, ОД и Мику
# ОД: -...Мику, делай всё как знаешь. Ты всё равно в этом лучше нас разбираешься. 
# - Привет. 
# Мику: - Хорошо-хорошо, я все сделаю, я просто хотела узнать как будет лучше, или вдруг у вас есть идеи, привет, Семён, ты тоже пришёл на нас посмотреть, а ты как думаешь, как будет лучше… 
# ОД: - Мику! Все вопросы - на твоё усмотрение. 
# Мику: - Ну я же так волнуюсь! Я раньше только выступала, а тут ещё надо программу вести, и фонограммы переключать, и руководить, ой столько всего, я ни за что не справлюсь, ужас-ужас… 
# Вздохнув, вожатая подхватила все продолжающую причитать японку под локоток и без лишних слов поволокла к сцене. 
# Сл: - Ох. 
# - Да. Полностью с тобой согласен. 
##смеющаяся Славя
# - Как ты думаешь, она справится? Мику, я имею в виду. 
## улыбчивая Славя
# Сл: - Конечно! На самом деле это она все и организовала - и программу составила, и номера младшим отрядам, и фонограммы подобрала…
# Сл: - А это она просто кокетничает. Звязда! 

# Она вдруг поглядела на меня и прыснула в кулачок. 
# - Что? 
# Сл: - Не, ничего… Просто ты такой взлохмаченный! 
# Мда, наверное, следовало всё-таки причесаться после душа. 
# - Увы, до парикмахера дойти не успел.
# Сл: - Ничего страшного, мне даже нравится. Знаешь, на кого похож? 
# - На кого? 
# Сл: - На Маугли! Или на Тарзана. 
# "Скорее, на йети. Будем сидеть рядом, как красавица и чудовище."
# Ш: "А вот последнюю фразу озвучь ртом. Полезно будет."

## смущенная улыбающаяся Славя
# В кои-то веки совет оказался дельным. 
# Сл: - Ой, скажешь тоже! 
# Отмахнулась она, но было заметно, что комплимент пришёлся по душе. 
# Сл: - Пойдём лучше место займём. 

# Наше место нашлось в предпоследнем ряду, посередине, откуда, по словам Слави, было лучше всего видно. Впрочем, смотреть было пока не на что, третий звонок ещё не прозвучал, и я просто глазел по сторонам. 
# "Кстати…"
# Я принялся пристально изучать кусты, в изобилии растущие сзади и по бокам от зрительских мест. 
# "Она должна быть где-то тут."
# Ш: "Если только не передумала." 
# "И пропустила такое интересное? Ну это уж вряд ли… "

# В одном из кустов что-то зашевелилось, и на свет показались два прижатых уха и пара желтых глаз. Юля тоже заметила меня и помахала рукой.
# "Спрячься, балда! Заметят же!"
# Сл: - Семён?
# Я вздрогнул.
# - Что?
# Сл: - Что там такое? Ты так в эти кусты уставился…
# - А? Нет, ничего.
# Я лишь на секунду отвел взгляд - а в кустах уже никого не было. Судя по недоумевающему взору Слави, она тоже никого не увидела.
# "Она и впрямь умеет прятаться."

##концерт начинается 
## звуковой эффект - свист микрофона 
# Ми: - Привет, Совёнок!
# Пронзительный голос ведущей, да еще и усиленный динамиками, заставил всех зрителей перестать заниматься ерундой и обратить внимание на сцену.
# Ми: - Я так рада видеть вас всех здесь! То есть, мы все рады, и надеемся, что наши выступления вам понравятся.
# Ми: - Вы знаете, когда я только приехала сюда, я не знала, удастся ли мне подружиться со всеми вами, я была совершенно чужой, в незнакомом месте, с незнакомыми людьми… Но оказалось, что эти незнакомцы - добрые и открытые люди, да-да, все вы! Я очень рада, что смогла подружиться с вами!
# Ми: - Ой, вы наверное, уже устали от моей болтовни, да? Всё-всё, я больше не буду, я лучше для вас спою! Вы готовы?
# Эта непродолжительная речь вызвала громкие аплодисменты и ободряющие крики с мест. 
# "Её тут тоже все любят, хоть и сторонятся немного."
# Неожиданно для себя я тоже присоединился к аплодисментам. 

##музыку
# Она что-то нажала на пульте, заиграла музыка - и Мику прямо-таки выпрыгнула на центр сцены, как освобожденная пружина.
# Она порхала по сцене, едва касаясь пола, и при этом умудрялась еще и петь в микрофон - что-то на японском, смутно знакомое, но настолько быстрое, что было невозможно разобрать ничего, кроме отдельных слогов.

## сюда надо песенку с подходящим смыслом. 2Dimension Dream Fever, например. Или Thousand Sakura Leaves.
# Сл: - Семён, а ты не знаешь, о чем она поёт?
# "Да тут бы и японист с двадцатилетним стажем не справился бы! Что уж говорить обо мне, все знание японского сводится к ходовым фразам из аниме?!"
# Ш: "Не кипеши. Песня-то знакомая."
# "Да?"
# Ш: "Именно. Ты, помнится, ею так проникся, что чуть ли не наизусть выучил."
# "Что ты несёшь? Не было такого!"
# Ш: "Ну как это не было? У меня админский доступ ко всей твоей памяти!"
# Ш: "Произведи впечатление на девушку, переведи песенку. Я тебе буду подсказывать, а ты адаптируй."

##здесь приделываем эффект субтитров - вверху на японском, внизу на английском, а Семён на ходу переводит, как умеет



# Славя в полнейшем изумлении смотрела на меня.
# Сл: - Семён… Ты знаешь японский?!
# - Эээ… нет. Я просто знаю эту песню.
# Сл: - Правда? А откуда?
# "И вправду. Откуда, а?"
# Ш: "Да говорю же. Ты её наизусть выучил."
# "Не было такого. Не-бы-ло!"
# Ш: "Ну, значит, это был не ты."
# С этими словами ощущение присутствия куда-то пропало.
# "Нагнал туману и ушел. Скотина."
# - Не помню уже. Просто знаю.
## озадаченная Славя

# На сцене тем временем продолжалось шоу. Нашу японскую звезду сменил хор мальчиков-зайчиков, за ними - танцоры, потом - акробатический этюд-пирамида… Недостаток умения с лихвой перекрывался старательностью, и зрители одаривали артистов овациями, не жалея ладоней.
# Я бы тоже, наверное, похлопал, но…

##милая улыбающаяся Славя. Или цг как сидим в обнимку. Что-то подобное было в Славя-руте

# Славя. Я не успел заметить, в какой момент она оказалась так близко ко мне. Настолько близко, что еще немного - и мы диффундируем друг в друга, слившись в сиамских близнецов. Ее голова совершенно естественным образом разместилась на моем плече, и от душистого запаха ее волос сознание шло кругом. 
# Что там происходит на сцене - какая разница? Все моё внимание было поглощено тем, что в сантиметре от моих губ - нежная кожа виска, с едва заметно пульсирующей жилкой. Наверное это феромоны всему виной - все мое существо тянулось преодолеть эту пустоту, разделяющую нас, обрывки мыслей складывались в одно громадное железобетонное "ХОЧУ!"... Противостоять этому не хватало не то что воли - мотивации.

# Мою капитуляцию приняли благосклонно - вздох, в котором явственно ощущается легкий смешок, едва заметная улыбка… Славя слегка поерзала, устраиваясь поудобнее на моем плече. Пользуясь моментом, я с деланной непринужденностью - всего лишь потягиваюсь, о чем вы?! - отправил свою руку в разведывательный рейд. Спина, талия, бедро...
# Вторжение было мгновенно обнаружено - Славина ладонь накрыла и прижала мою, пресекая дальнейшее движение. "Здесь можно, дальше - ни-ни!". Понял.

# На сцене тем временем появился какой-то тип неопределенного возраста - от пятнадцати до… не знаю, сорока, наверное. Он очень сосредоточенно устраивался на стуле из столовой - сядет, повертит головой, встанет, передвинет на пару сантиметров, снова сядет… Среди зрителей раздались смешки, но не было похоже, что ему есть какое-то дело. 
# - Славя, а кто это?
# Сл: - Это? Анатолий. Толя. Он из четвёртого отряда.
# - Из четвёртого? Там же… 
# Сл: - Да, ему с младшими лучше. Они его любят, и вожатым проще… Он вообще очень старательный, на самом деле. 
# - Я-а-асно-о-о… 
# Анатолий тем временем нашёл-таки идеальное положение стула, сел и торжественно водрузил на колени потертую балалайку. Я приготовился к худшему… 

## соло на балалайке сюда

# На удивление, всё оказалось совсем не так плохо. Даже хорошо! Анатолий вполне профессионально исполнил "Камаринскую", потом небольшой отрывок из "Полёта шмеля" , выдал немного импровизации, и… 
# "Ага, Яблочко. Сейчас ещё пойдёт вприсядку и споёт про \"подходи, буржуй, глазик выколю\". А Ольга-свет-Дмитриевна от сего перфомансу изволит лишиться чувств-с."
# Разумеется, ничего подобного не произошло. С последним аккордом музыкант встал, поклонился. 
# tl_7dl "А Ф И Ф О\ \ \ Ф А\ \ \ Ф Н И М А И Е."
# И ушёл за кулисы - с балалайкой в одной руке и стулом в другой. Под заслуженные аплодисменты, разумеется, но непохоже, чтобы они его сколько-нибудь интересовали. 
# - Во даёт! 
# Сл: - Да, и вправду. Я и не подозревала, что у него такой талант. 
# Она поежилась от внезапно налетевшего ветра, и вернула на место руку, которую я освободил для аплодисментов. 
# Сл: - Холодно что-то стало. Погрей меня. 
# - И вправду. Как бы дождь не начался… 
# Сл: - Нет уж, никакого дождя! Ты ведь не хочешь моё выступление пропустить? 
# - А ты тоже выступаешь? А с чем? 
# Сл: - А это сюрприз! Наберись терпения, и постарайся, чтобы не было дождя. 
# - Хорошо. Ради этого я согласен даже с дождём договариваться! 
# Удовлетворившись этим обещанием, Славя снова заняла свое место на моём плече. А я старательно работал грелкой - да, задача как раз по мне! Тем более, что такой близкий контакт поневоле заставлял сердце гнать кровь по телу всё быстрее… 

# Мне в бок ткнулся какой-то предмет. 
# ОД: - Поклюйте, голубки. 
## ржущая ОД
# - Мы… мы не! 
# ОД: - Ага, оно и видно, как вы не. Берите, это вам вместо полдника. 
# Когда это она успела сходить за припасами и раздать всем - я пропустил. Занят был. В свертке обнаружились две сдобные булочки, которые мы по-братски разделили со Славей. 
# "Главное, чтобы Юля себя не выдала. А то тут булки едят, и без неё… Безобразие! Такое терпеть нельзя, да."
## шуршит кустами
# Кажется, я слышал… 

# Сл: - Семён, что-то случилось? Ты как-то… напрягся. 
# Она обеспокоенно смотрела на меня, и мне пришлось оторваться от сканирования окрестных кустов в поисках ушастой особы. 
# - Нет, ничего. Ерунда. 
# - Кстати, смотри, тучи разошлись!
# Я поспешил сменить тему разговора. 
## удивленная Славя
# Сл: - И вправду… 
# - Теперь уж точно твоё выступление не пропущу. А когда оно, кстати? 
# Сл: - Кто… А, в самом конце. 
# Она стряхнула с себя непонятную растерянность и чарующе улыбнулась. 
# Сл: - Дождешься? 
# - Непременно! Сколько бы ни пришлось ждать! 
# Сл: - На самом деле уже скоро - сейчас Двачевская споёт, и мой выход. 
# Она поднялась, оправила юбку. 
# Сл: - Пойду наряжаться. А ты - жди! Как обещал. 
# Шутливо погрозила пальцем и убежала, мелькая стройными икрами в белых гольфах. А я - остался ждать, как приказано. 

# Ш: "Ты попал, чувак. Влип." 
# "Я-то?! Нет. Да. Наверное. Не знаю."
# Ш: "Влип, влип. Верь мне." 
# Ну влип так влип. Подумаешь, дело-то житейское… Было бы о чём голову ломать. Лучше вон Алису послушаю. 

# Алиса, против обыкновения, не стала устраивать никаких дебошей и провокаций - ну правда, не считать же за хулиганство её сценический наряд? Она в нём каждый день ходит, в этой подвязанной рубашке и с галстуком на запястье! И то, что она пренебрегла стулом и уселась прямо на край сцены, свесив ноги в первый ряд - ну право, что за мелочи! Все равно мужское население партера старательно отводит глаза, не рискуя даже бросить взгляд в манящую темноту под форменной юбкой - заметит, зарядит микрофонной стойкой прямо промеж глаз! 
# Да и репертуар оказался относительно нейтрален. Пара неожиданно лиричных песен авторства Янки, ещё что-то, смутно знакомое… Когда она встала и убежала со сцены, показав всем напоследок "козу", Ольга Дмитриевна наконец-то облегченно выдохнула. 
# ОД: - Ну хоть тут ничего не учудила… Хотя талант у неё, конечно, есть. Согласен, Семён? 

# - А?! 
# - А, ну да. Талант. Несомненный. Есть. 

# Ольга со вздохом махнула рукой. 
# Од: - Понятно всё с тобой. Какие вы смешные становитесь всегда… 
# Од: - Может, хоть у Слави получится из тебя человека вылепить. Мне это явно не под силу. 
# Ш: "Слышал? Тебя официально признали не поддающимся дрессировке."
# "Не поддающимся традиционным методам. Что характерно, никто не пытался действовать лаской." 
# "Так что у Слави действительно есть шансы на успех. "
# Ш:" Как низко ты пал, чувак."

# От спора с внутренним голосом меня отвлекла внезапно установившаяся тишина. Все разговоры внезапно смолкли, и даже, кажется дышать все стараются через раз. 
# Славя. В расшитом сарафане, красных сапожках… И с кокошником на голове. Русская красавица, прямиком из сказок! 
# Ш: "Вот только за подол такой длины ей бы повыдергивали обе косы… А так, конечно, весьма и весьма есть на что посмотреть!" 

# Выйдя к краю сцены, она развела руки в стороны, будто стараясь обнять всех, сидящих перед ней, и, выдержав паузу, запела. Без музыки, и уж тем более без фонограммы.
# Сл: - Ой да девица краса, полюбила-полюбила парня-молодца… 

## ЦГ, если найдём, фоновая музыка, принудительная пауза секунд на 5
#… 

# Из транса меня вывел гром аплодисментов. Спохватившись, я тоже принялся с жаром отбивать ладони и, не удержавшись, засвистел. Славя, которая раскланивалась на краю сцены, с улыбкой послала мне - да, именно мне! - воздушный поцелуй. 
# "Вот это да! Это было что-то… с чем-то. Кто бы мог подумать?"
# Ш: "Ведьма, что с неё взять. Но откаблучивала знатно, не хуже цирковой лошади!" 
# Я не обратил внимания на попытки внутреннего циника испортить волшебство. Пусть себе ворчит. А я постараюсь потверже запечатлеть этот образ в памяти… 

# На сцену вышла Ольга - я с удивлением обнаружил её отсутствие рядом. Когда это она успела уйти? 
# ОД: - Дорогие ребята! Я надеюсь, вам понравился наш концерт? Тогда давайте ещё раз громко крикнем нашим артистам - молодцы! 

# Всё, и я в том числе, радостно заорали
# - Мо-лод-цы-ы-ы! 

# ОД: - Огромное им спасибо! И спасибо всем вам за поддержку! 

# ОД: - На этом отчетный концерт объявляется закрытым. Ждём всех на вечерней дискотеке! 

# С неизбежным шумом и гомоном пионеры начали расходиться. Я тоже стал пробираться к сцене. К Славе, поздравить с выступлением. 
# "Знал бы - цветов надергал, ромашек там или васильков каких… "
# Артистка обнаружилась за сценой, уже переодевшаяся в обычную форму. 
# - Славя! Вот ты где. 

# Сл: - Семён! Тебе понравилось? 
# - Очень. Просто слов нет! Я и не думал, что у тебя такие разнообразные таланты. Просто кладезь! Комсомолка, спортсменка, артистка и просто красавица… 

# Я заливался соловьём, Славя с улыбкой внимала… Идиллию, как всегда, нарушила вожатая. 
# ОД: - Воркуете, голубки? 
# "Да сколько можно уже?! Виола меня иначе как пионером не зовёт, теперь Ольга со своими голубками… Да, воркуем, и что?!" 
# ОД: - А я вам работы припасла. Надо аппаратуру на площадь перетащить, и там всё организовать. Справитесь? 
## расстроенная Славя 
# Славя как-то замялась, наверное, разрываясь между долгом и желанием провести время со мной, и я поспешил избавить её от от мук выбора. 
# - Справимся, конечно. Я помогу. 
# ОД: - Ну и ну, Семён! Это так на тебя непохоже… 
##ржущая ОД

# Таскать громоздкие бандуры, конечно, не самое интересное занятие, но… Славя же! Нельзя ударить в грязь лицом! Я подволок динамик к краю сцены, примерился, как я буду его взваливать на спину… 
##взволнованная Славя
# Сл: - Надорвешься! Осторожнее! 
# - Кто, я? Да ни в жисть! Я и не такое... 
# ИииЭэээх! 
# Под весом, навалившимся на меня, я непроизвольно присел, 
# "Вот это я понимаю, тяжёлая музыка!" 
# с усилием выпрямился и побрёл по дорожке.
# Сл: - Семён, тебе правда не тяжело? Давай помогу! 
# - Нет… Нормально… Донесу… Ты лучше дорогу подсказывай, а то я только то, что под ногами вижу. 
## площадь 
# Спустя пару вечностей я скинул осточертевший ящик рядом с Гендой, где кибернетики уже колдовали с проводами, под руководством Мику. 
# - Вот! Забирайте этот гроб! А я сейчас отдохну и пойду за вторым… Хотя почему это я один должен их таскать, пока вы тут прохлаждаетесь?! 
# Электроник с Шуриком переглянулись, а Мику залилась смехом. 
# Ми:- Ой, Сенечка! Ты его на себе сюда тащил? Там снизу колесики выдвигаются, чтобы их катать, тебе никто не сказал? Мы их так на сцену принесли, иначе как бы мы справились, они же тяжёлые, но ты, оказывается, такой сильный, Сенечка! 
# "Тьфу ты!" 
# Я вопросительно посмотрел на Славю - ты тоже знала? Ответом мне было лишь пожатие плечами - не знала, или знала, но решила не говорить… 
# Ш: "Зато продемонстрировал, насколько ты могуч. Тоже в копилку идёт." 

# С колёсами оно, конечно, проще. Толкай себе и толкай, следи только, чтоб на какой-нибудь кочке не опрокинуться. Хоть и медленнее. А куда торопиться? 
# Ящик неспешно тарахтел, подпрыгивая на стыках плит, можно было спокойно поговорить. Только вот о чём? 
# "Мда, неловкие паузы - моя стихия. Надо что-то придумать… Ну не знаю, спросить про планы на послелагеря." 
# Сл: - Что планируешь делать после лагеря? 
# Я, уже успевший открыть рот, чтобы задать тот же вопрос, был подбит на взлёте. 
# - Эээ… Да я, на самом деле… Не знаю. Короче, у меня пока не определено ничего. Таинственно и туманно. 
# - А ты? 

# Сл: - Я? 
# Она почему-то замялась. Странно, я думал, у неё уже все спланировано на несколько лет вперёд. Поступить в педагогический, или в ветеринарный, или ещё куда, где сможет пользу приносить… 
# Сл: - Не знаю. Были какие-то планы, но… Сейчас это уже не важно. 
# - Уже? А что случилось?
# "У неё что-то произошло?" 
# Она замотала головой. 
# Сл: - Нет, ничего. Всё так, как и должно быть, просто… Приоритеты поменялись, скажем так. 
# Сл: - Да и вообще, не хочу сейчас все это обдумывать. Пусть будет, как будто лагерь - это отдельная вселенная, и кроме него ничего нет. 
# - Что происходит в Вегасе, остаётся в Вегасе… 
# Пробормотал я под нос. 
# Сл: - Что? 
# - Не имею ничего против. В каком-то смысле так оно и есть. 
# "Уж для меня-то точно."

# Я ускорился на последнем десятке метров, эффектно припарковал свой тарантас симметрично с первым и вытер пот со лба. 
# - Забирайте! Дальше сами справитесь? 
# Ш: - Справимся, конечно. Спасибо! 
# Ми: - Огромное спасибо, Сенечка, что бы мы без тебя делали! Мы тут уже сами все сделаем, ты иди, там в столовой ужин, ты ведь ещё не кушал? А потом приходи на танцы, ты ведь придёшь? Вы ведь оба придёте, да? Я специально для вас какую-нибудь хорошую песню включу, тебе какая нравится, у меня много всего… 
# "Ну всё, началось. Мику вышла на форсаж… Пора линять!"
# - Пойдём-ка мы и вправду перекусим. А то съедят всё! Пока, до встречи! 

# Мы поспешно ретировались. Отойдя на безопасное расстояние, я скорчил измученную рожу. 
# - Уф. Еле ушли! 
##смеющаяся Славя
# - Так, где там обещанный ужин? Я готов даже слона съесть. Живого. Целиком! 

    jump alt_day6_uvao_dinner_with_sl

label alt_day6_uvao_dinner_with_sl:
    window hide
    $ persistent.sprite_time = "sunset"
    $ sunset_time()
    scene bg int_dining_hall_sunset with fade
    play music music_list["so_good_to_be_careless"] fadein 4
    play ambience ambience_dining_hall_full fadein 4
    window show
##столовая
# В столовой уже не было никого, кроме нас, не считая поварихи на раздаче,занятой какими-то своими делами. 
# Я обернулся к Славе и поклонился. 
# - Добро пожаловать, мадемуазель! Что будете заказывать? Сегодня у нас великолепный буйабес, а также котлеты из омаров! 
##смеющаяся Славя 
# Она рассмеялась и моментально подхватила
# Сл: - Скажите, а у вас есть блюда из слонятины? Мой компаньон собирался съесть слона. 
# Я изобразил замешательство. 
# - Хм, слонятина? Одну минуточку, я уточню у шеф-повара. Присаживайтесь, прошу вас! 

# Недовольная повариха выдала мне две порции картошки с каким-то мясом, и я поспешил с подносом к столику. 
# - К сожалению, сегодняшнего слона уже съели, а начинать нового шеф-повар наотрез отказывается. Я взял на себя смелость заказать бегемотятину, с нашей собственной бегемотьей фермы, откормлены лучшими бананами. Рекомендую! 
# Я поставил поднос на столик и сел напротив давящейся смехом Слави. 
# - Приятного аппетита! 
# Сл: - И тебе! 
# - Ну-с, попробуем, каков на вкус бегемот… 



# Сл: - Семён, ты ведь пойдёшь на танцы? 
# Я поспешно проглотил недожеванный кусок. 
# - Я? На танцы? За кого ты меня принимаешь?! 
# - Конечно пойду, я же, как-никак, едва не сложился под этими бандурами. Должен же я получить что-то взамен! Хотя бы послушать, правильно ли эти гении всё подключили. 
# Сл: - Что, только из-за этого? 
# Она, кажется, огорчилась от такого ответа. 
# - Нет, не только. Ещё имею твердое желание пригласить одну девушку на танец. Или на два танца… 
# Сл: - Или не одну? 
# - Не, ну это уже будет перебор. Мне одной-то хватит - во так! 
# Я энергично рубанул ладонью себе по горлу, параллельно изображая лицом испуг. 

# - А ты, Славя? Согласна потанцевать? Со мной. 
# Славя хитро улыбнулась. 
# Сл: - Почему бы и нет. Если твоё желание достаточно твёрдо! 
# "Это ведь был виолизм?" 
# Ш: "Ага." 
# "Понятно." 
# - Тверже Генды! 
# Сл: - Ой, ну тогда у меня нет никаких шансов отвертеться! Всё! Попа-а-алась птичка в силки! 
# Я смущенно хмыкнул, не зная что ответить на такое заявление. 

##крыльцо
# Славя давно уже убежала наряжаться и прихорашиваться, а я так и сидел на крыльце столовой. Такое странное, давно забытое чувство, похоже на ощущение перед прыжком с обрыва. Или перед взлетом самолёта, когда двигатели уже выдают максимальную тягу и тебя начинает вжимать в кресло, а впереди - целый новый мир, ну или катастрофа… 
# "А я-то думал, что отрастил себе иммунитет от такого. А оно вот как, оказывается." 
# - Кажется, мне повезло. 
# Ш: "Уверен?" 
# "Нет. Но надеяться-то могу?" 
 # Пионеры со всего лагеря постепенно стягивались к танцполу, на звуки затравочной мелодии. Пора и мне, наверное. 

##площадь с аппаратурой 
# Слави ещё не было. Я расположился на скамейке, как и многие другие - сидел, одобряюще покачивая головой в такт музыке, делая вид, что танцы - это ну прямо совсем не моё, но вы не стесняйтесь, отплясывайте! А я пока так посижу. 

##звук бегущих шагов
# Сл: - Семён! 
# Она остановилась передо мной, слегка запыхавшись от бега. 
# Ш: "Как лист перед травой!" 
# Снова в том лёгком платье с узорами, которое скрывает намного меньше, чем полагается… 
# Сл: - Вот ты где! Пойдём танцевать? 
# "Вот прямо сейчас? Прямо при всех? Пойти выгибаться под музыку?! Это ведь даже не медляк!" 
# Наверное, всё мои мысли очень ярко отразились на физиономии, потому что она заметно огорчилась. 
# Сл: - Ты не хочешь? 
# - Не то что бы не хочу… Просто из меня танцор так себе. 
# Сл: - Ой, ты на себя наговариваешь. Пойдём! Ты обещал! 
# Она схватила меня за руку и потащила в середину толпы. Выхода не было… 
# Я мысленно перебрал свой танцевальный арсенал - покачивания, притоптывания, размахивания согнутыми в локтях руками. Маловато, придётся импровизировать. 

# Меня поместили в самый центр площади, в перекрестье прожекторов и чужих взглядов, в эпицентр акустической атаки тех самых динамиков, и, как на зло, людей было слишком мало, чтобы затеряться. 
# Ул: - Давай, Семён, покажи класс! 
# Вездесущая рыжая егоза,чтоб её! Хорошо хоть старшей рыжей нигде не видно… 

# Кое-как поймав ритм, я топтался на месте. Все оказалось не так уж страшно - взгляды посторонних сконцентрировались на Славе, и попадали на меня лишь рикошетом. А Славя… Славя, как сказали бы в моем времени, зажигала! 
# Ш: "Смотри, смотри, чего вытворяет! Во даёт! Ну ваще!" 
# Косы выписывали траектории на манер гимнастической ленты, летящее платье на мгновения обрисовывало спортивную фигурку, мечту любой поклонницы фитнеса. Славя плясала, полностью отдаваясь танцу, так, как отдавалась бы возлюбленному, без остатка и целиком. До дрожи в руках хотелось присоединиться, влиться в танец, подхватить её на руки, закружить… Увы, не с моими древоподобными умениями. Оставалось лишь смотреть, притоптывая и покачиваясь в такт. 
# Ш: "Требую такое же, но на барной стойке!" 
# "Где ты барную стойку найдёшь? Здесь только столы. " 
# Ш: "Да пофигу, хоть на верстаке! Нельзя такое прятать! Искусство - народу, слышал такой лозунг? Вот, он как раз об этом!" 

# Музыка оборвалась на мощном аккорде, и сменилась одобряющими воплями и аплодисментами - как-то незаметно вокруг нас собралась целая толпа. Взмокшая и счастливая до умопомрачения Славя повисла у меня на шее. 
# Сл: - Охохо… 
# Я с готовностью поддержал. 
# - Да-а-а… 
# Сл: - Ну, что скажешь? Понравилось? 
# - Не то слово! Хорошо, что вожатая не видела.
# Сл: - Да-а? Это было настолько потрясающе? 
# - Да. И даже больше. Почти что развращение малолетних. Буквально чуть-чуть не дотянула! 
# Сл: - Ой, как жалко. Ну ничего, в следующий раз постараюсь получше! 
# "Она серьёзно?" 
# Ш: "Возможно. Пока не попробуешь - не узнаешь." 
# "Да ну, не может быть."

# Сл: - О. Медленный танец! 
# - Да. Потанцуем? Это у меня получается лучше. 
# Вместо ответа она обняла меня за шею и прижалась всем телом. Какая пионерская дистанция, о чем вы? Тонкое льняное платье совершенно не препятствовало всем её выпуклостям и упругостям упираться в меня, заставляя меня дрожать и, не смотря на все попытки самоконтроля, вызывая ответную реакцию. 
##улыбающаяся Славя
# Сл: - Ммм. Замечательная музыка. 
# Сл: - Хотя, может быть, лучше пойдём прогуляемся? 
# "Да не может того быть!"
# Ш: "Последняя ночь, чувак. Последний шанс. В последнюю ночь положено творить безумства, наверстывать то, на что не хватило всей смены." 
##площадь 

##если сумеем - спрайт Слави спиной, тащущей за руку, в платье. 

# Ш: "И, судя по всему, она серьёзно решила тебя захомутать. Так, чтоб наверняка." 
# "Выбирай выражения, а!"
##клубы
# Ш: "Ах, простите. Решила перевести ваши отношения на новый уровень, сделать их глубокими и близкими, и как там ещё полагается говорить… "
# "Так-то лучше." 
##ворота 
# Ш: "Но суть от этого не меняется. Девочка настроена серьёзно, тебе будет сложновато выкрутиться."
# "А кто сказал, что я буду выкручиваться?"
# Ш:" А, ну тогда вперёд. Или взад. Там разберётесь, короче."
# "Тьфу, пошляк."
##тропинка в лесу
# Славя вела меня куда-то по тропинке, не оглядываясь. Я шёл следом, стараясь не споткнуться на древесных корнях, вдыхая запах ночного леса, и Слави. Этот тёплый аромат девичьего тела с тонкой ноткой… Ай, да чем я занимаюсь, парфюмер недоделанный?! 

# В два быстрых шага я догнал её, обнял, облапил, прижал, выдохнул в ушко, которое так удачно оказалось у моих губ.
# Сл: - Семён, нет… Не надо… Прекрати-и, не сейчас… 
# Я не слушал. Не слышал. Какое ещё может быть "не сейчас", когда в самом центре ладони, обхватившей восхитительную тёплую полусферу, набухает мягкая бусинка, когда подол тонкого платья так близок, когда моё сердце пытается напрямую достучаться до её?! 

# Она рванулась прочь, отталкивая мои руки. Машинально я попытался удержать её, и

##ЕБУХ! с кровавым миганием 
# "Ух…" 
if #евент с Алисой в душевых 
# "Да что они, сговорились все сегодня?!" 
else
# Ш: "Вот это было от души." 
# Ш: "Лучшая ученица Ольги-сенсея, мастера школы Просветленного Леща." 
#/if
##Славя в шоке от проделанного
# - Славя. Ты меня прости, конечно, но какого чёрта?! 
# Правая половина лица наливалась жаром и начинала пульсировать. 
# Сл: - С-семён… Прости… Прости-прости-прости! Я не хотела! Честно!!! Я просто… Мне нужно… Что мне сделать, чтобы ты меня простил? Хочешь, я… 
# Дрожащими руками она начала распутывать завязанные лямки платья. 
# "Куда-то это всё идёт не туда…"
# - Славя. Стоп! Перестань. Чего я сейчас больше всего хочу, так это чтоб ты мне объяснила, что происходит. 
# Сл: - Но… 
# - Сла-вя. 
# Она несколько раз глубоко вдохнула собираясь с духом. 
# Сл: - Семён. Я знаю твой секрет. Знаю, кто ты. Догадалась… 
# "Та-а-ак. И что же теперь?" 
# Я слушал, а Славя, запинаясь и перескакивая с пятого на десятое, рассказывала. Про возникший из ниоткуда автобус, про обеспокоенных Ольгу и Виолу, про странное задание - встретить, проводить, обеспечить, вопросов не задавать, делать вид, что всё так и должно быть. Про разные странности… 

##кусок с объяснением надо бегунизировать. Чтоб и вроде логично, и полная чушь. 

# Сл: - Вот… Это ведь так? 
# Я вздохнул. 
# - В целом да. Я и вправду не отсюда, но всё равно, зачем ты… 
# Сл: - Потому что я не могу здесь оставаться! Пожалуйста, Семён, мне нужно отсюда уйти, забери меня, выпусти! Я для тебя всё-всё сделаю, всё, что угодно, только выпусти меня! Отсюда, в свой мир, туда, где настоящая жизнь! 
# - Погоди… Что ты говоришь? А здесь тебе что, не настоящая? 
# Славя недовольно сморщилась. 
# Сл: - Семён, ну не надо. Раньше, когда ничего не знала, конечно, считала настоящей. Но теперь-то, когда знаю твою тайну! Вот уж на что я точно не согласна, так это снова становиться послушной дурочкой. 
# "О чём это она?" 
# Сл: - Я уже выросла из твоего сценария, Семён. Ты уйдешь, и здесь всё замрет. Или просто исчезнет, уж не знаю точно…
# Сл: - Пожалуйста… Я хочу пойти с тобой, в твой мир. Мне нужно туда попасть! Ты придумал замечательный мир, но он… Он всё равно игрушечный. А я хочу чего-то настоящего!
# - Славя, что ты несёшь? 
# Сл: - Не надо, пожалуйста, не притворяйся. Просто ответь. 
# Сл: - Ты возьмёшь меня с собой? 
menu:
"Да, пойдём.":
# Взгляд её был полон надежды на лучшую жизнь где-то там, в настоящем мире. 
# "Вот, значит, как." 
# "Проклятье. Люди нигде не меняются."
# "Я-то уже стал надеяться, что мотивом людских поступков может быть что-то кроме личной выгоды. Хотя бы здесь. Хотя бы в идеальном мире выстоявшего СССР. Хотя бы для этой девушки, живой иллюстрации к кодексу строителей коммунизма. Тех, кто должен был сажать на Марсе пресловутые яблони, оставлять следы на пыльных тропинках далеких планет. Строить подводные города. Побеждать эпидемии. А в итоге… "
# "\"Я хочу настоящего.\" Да будет так. "
# - Да, пойдём. 
# Славя всхлипнула. Вздохнула. Вытерла непослушные слезы с ресниц. 
# Сл: - Семён… Спасибо… Что я… Что мне…? 
# - Просто держи меня за руку. Крепче. 
# "Что там говорила Виола… Если мы с миром не уживаемся - меня выкинет обратно. Кажется, это мой случай."
# Я постарался как следует пропитаться этим горчайшим ощущением, с каким-то жертвенным упоением. Отпуск окончен. Пора возвращаться в привычную жизнь, и не путать туризм с эмиграцией. Я не подхожу, как уличный дворняга в дорогом доме, я буду портить интерьер, грызть вещи и гадить не там, лучше вернуть его обратно на улицу, где он будет жить как и раньше.

##можно добавить сюда появление Юли, можно не добавлять

# Под крепко зажмуренными веками замелькали какие-то пятна. 
# "Верните меня обратно. "
# Ш: "Уверен?" 
# "Да. Мне нечего здесь делать." 
# Приступ головокружения заставил меня пошатнуться на внезапно онемевших ногах. Возможно, я упал… 
jump ##на нейтрал

"Нет." :
## Сюжетка Слави, Юля, узнаем о неудачной охоте, возвращаем Славю в лоно Организации
