# Д6 левая ветка, хозработы со Славей.
# План-набросок
#
# Используется флаг alt_day3_duty дежурства по столовой в Д3
#
#
label alt_day6_uvao_left_dutywork
    # сцена - бельевой склад снаружи
    "Целью недолгой пробежки оказался бельевой склад."
    sl "Надо грязное постельное бельё отвезти в прачечную."
    "Объяснила нисколько не запыхавшаяся Славя."
    sl "Там сушилка была сломана, только вчера починили, вот и накопилось, а завтра конец смены, это ещё бельё со всего лагеря. {w}Пока всё постирают, а в пересменок с ним возиться особо некому будет..."
    "Несколько обалдев от вываливаемой на меня информации, я лишь кивал, восстанавливая дыхание."
    th "Не будь это Славя, я бы решил, что она волнуется из-за чего-то."
    th "А здесь - заразилась от Мику за завтраком, не иначе."
    "Славя отперла наконец дверь и мы зашли на склад."
    # сцена - склад изнутри.
    sl "Давай их наружу вынесем, я там тележку уже приготовила."
    "Славя показала на два объёмистых тюка."
    "Я примерно представлял себе, сколько может весить такой объём белья, и слегка приуныл, но тюк на удивление оказался не слишком-то тяжёлым."
    # сцена - бельевой склад снаружи
    "Сгрузив ношу на стоявшую здесь же тележку, мы готовы были уже тронуться в путь, как Славя вдруг всплеснула руками."
    sl "Ох, я совсем забыла! Подожди секунду."
    #hide sl
    "Девушка скрылась на складе и тут же вернулась с каким-то тряпичным свёртком."
    #show sl
    sl "Вот, я и своё постирать хотела заодно... Ой!"
    "Она неловко перехватила свой свёрток так, что тот раскрылся, выворачивая содержимое наружу."
    "Рефлексы мои оказались на высоте - я нырнул вперёд{w}... и в руках у меня оказался симпатичный и довольно объёмистый лифчик."
    "Кажется, на меня напал какой-то ступор - я стоял полусогнувшись и тупо разглядывал незатейливые кружева, которыми были отделаны чашечки."
    "Славя, проворно подбирающая прочие, надо полагать, не менее деликатные предметы белья, смущённо усмехнулась:"
    sl "Извини, но мне кажется, это не твой фасон."
    "Выпрямившись, она протянула руку, слегка порозовев от смущения."
    sl "Ну что ты, как маленький. Бюстгальтера никогда не видел?"
    "Забрав у меня лифчик, она вновь упаковала его вместе с остальными своими пожитками."
    "Сообщать Славе, что бюстгальтеров в своей жизни я повидал несколько больше, чем она могла бы подумать, явно не стоило."
    "Запоздало покраснев, я неловко пожал плечами."
    me "Да не то, чтобы совсем не видел, просто как-то неожиданно вышло. {w}Ты, когда в следующий раз решишь шоу устроить - предупреждай заранее, минут за пять, я приготовлюсь."
    # show sl испуганная
    "Моя неловкая попытка отшутиться почему-то произвела на Славю самое неожиданное действие - девушка разом изменилась в лице, и в глазах её мелькнул испуг."
    # show sl весёлая-радостная
    "Впрочем, через секунду она снова весело мне улыбалась."
    sl "Ну что, взялись?"
    #сцена - между домиками. Или у столовой. Или даже сразу площадь - уточнить по карте.
    "Толкать тележку вдвоём окзалось занятием вовсе не трудным."
    "Да что вдвоём - здесь и одному-то делать было особенно нечего - знай только, не давай тележке съехать с мощёной дорожки в сторону."
    "Я помалкивал, всё ещё слегка смущаясь после недавнего конфуза. Славя тоже не спешила заводить разговор, лишь то и дело поглядывая на меня искоса."
    dreamgirl "Не думаю, что он у неё был единственный."
    th "О, а я уже чуть было не заскучал без тебя. {w}Кстати, ты о чём?"
    drezmgirl "О лифчике. Ты уже минут пять пялишься на её грудь. {w}Так вот, под рубашкой на ней наверняка надёто всё, что положено."
    "Я смущённо отвёл взгляд в сторону."
    "Возможно, мне послышалось, но Славя, будто подслушав наш мысленный диалог, едва слышно хихикнула."
    # здесь должен быть какой-то бэк "возле прачечной" - это где-то возле администрации. Пока неясно, что с ним делать. Посмотреть, что там у Автора в Славя-руте насчёт здания администрации.
    "Наконец мы остановились у невзрачной пристройки на задворках здания администрации."
    sl "Подожди, я сейчас."
    "Бросила мне Славя и, без особого труда подхватив оба тюка разом, скрылась с ними внутри прачечной."
    "Я присел было на тележку, вяло размышляя, кому могло придти в голову разместить бельевой склад и прачечную в разных концах лагеря, но Славя уже вышла наружу."
    "Я поспешно вскочил на ноги, а на моё место плюхнулись два новых тюка, поменьше."
    sl "Это постиранное, надо на склад отвезти."
    "Пока я щёлкал клювом, прикидывая, не следует ли проявить себя джентльменом и предложить даме посильную помощь, Славя сбегала за ещё одной парой тюков, и мы отправились в обратный путь."
    # сцена где-то по дороге к складу, уточнить по карте
    "Разглядывая забранные из прачечной видавшие виды мешки, сшитые из полосатой когда-то материи, я невольно задумался о судьбе Славиного свёртка."
    th "Если его содержимое постирают так же, как мои несчастные джинсы, то на выходе даже тряпочек не останется."
    if alt_day3_duty:
        "Недавнее знакомство с чудом современной кухонной техники - местной картофелечисткой - оптимизма тоже не добавляло."
    th "Я-то думал, подобные вещи в те времена вручную стирали. {w}Вернее, стирают в {i}наше время{/i}, так что ли у меня теперь получается?"
    dreamgirl "Что же ты, надо было предложить девушке услуги по ручной стирке. Произвёл бы незабываемое впечатление - хозяйственные мужики во все времена нарасхват."
    "За всеми этими размышлениями о способах стирки и временных парадоксах на разговоры меня по-прежнему не тянуло."
    "Славя, беззаботно напевающая что-то себе под нос, с разговорами тоже не лезла."
    "Обратная дорога к складу никаких затруднений не вызвала - пусть груз и стал вдвое больше, зато теперь мы двигались преимущественно под уклон."
    # сцена - склад
    "Добравшись до склада, мы приткнули тележку возле двери и занесли мешки внутрь."
    # сцена - склад изнутри
    #show sl смущённая
    "Освободившись от своей ноши, Славя посмотрела на меня непривычно робко."
    sl "Семён, а Семён? Можно я тебя ещё поэксплуатирую?"
    #show sl грустная?
    sl "Или тебе надо бежать, выполнять то поручение?"
    th "Минутку, какое ещё поручение?"
    dreamgirl "Ну ты же сам ей возле столовой лапшу на уши вешал про {i}срочное поручение{/i}. А она запомнила, смотри-ка!"
    
# Рагружаются.
# Славя просит ещё помочь и постельное бельё разобрать по комплектам, (ГГ достаёт из тюка и сортирует в стопки наволочки-простыни-пододеяльники, а Славя набирает комплекты и раскладывает по полкам) но и эта работа - не бей лежачего, почти управились за пятнадцать минут.
    "Распотрошив до половины третий тюк, я не выдержал."
    me "Послушай, Славя, а зачем ты меня помочь-то просила?"
    #show sl surprise
    "Я отмахнулся от собиравшейся что-то возразить девушки и продолжил:"
    me "Работа не тяжёлая, да и сделала ты её почти всю сама, помощи от меня особой не было."
    me "Так что есть я, что нет - никакой разницы."
    #show sl serious
    "Помолчав несколько секунд, Славя отложила в сторону стопку белья и присела напротив меня на последний неразвязанный тюк."
    #show sl serious close 
    #вообще, дальше активно поиграться с эмоциями
    sl "Ты не думаешь, что мне не так уж весело быть всё время одной?"
    "Вздохнула она и посмотрела мне прямо в глаза."
    sl "Я понимаю, это странно звучит, ведь вокруг меня почти всегда полно народу, я всё время что-то организую, помогаю кому-то, что-то улаживаю."
    sl "На самом деле, мне это и вправду нравится. {w}Нравится быть всё время занятой, быть нужной и полезной моим товарищам."
#ЛБ: TODO возможно, здесь надо больше букв про приятность полезности. Подсмотреть у Автора.
    sl "Но ты знаешь, Семён..."
    "Девушка нервно стиснула руки, переплетя пальцы."
    sl "Иногда и мне хочется почувствовать себя не Славей-активисткой, а простой девушкой."
    sl "Хочется, чтобы кто-то позаботился обо мне, помог не по обязанности... да просто побыл рядом!"
    sl "Кто-то хороший, Семён. Такой, как ты..."
    "Последние слова Славя произнесла еле слышно, глядя в пол."
    "Я, слушавший это неожиданное признание с открытым ртом, растерянно заморгал, но девушка тут же выпрямилась, махнув рукой."
    #show sl какая-нибудь жизнерадостная
    sl "Ох, извини Семён. Что-то я разболталась."
    sl "У тебя, небось, своих дел полно, а тут я тебя мало того, что с тряпками возиться заставила, так ещё и всякими глупостями голову тебе забиваю, нашла время."
    "Она хотела было встать, но я, неожиданно для себя самого, удержал её за руку."
    "От прикосновения невольно вздрогнули оба. Славя медленно опустилась назад, вновь, как и за пару минут до того, пристально глядя мне прямо в глаза."
    me "Да нет, Славя, мне вовсе не трудно было тебе помочь."
    "Запинаясь, выдавил я из себя, отпуская руку девушки и стараясь сделать это по возможности деликатнее."
    me "И просто составить тебе компанию - я тоже рад. {w}Тем более, раз ты сама не против моего общества..."
    "Я неловко замолчал, чувствуя, что вступаю на тонкий лёд, но Славя, к счастью, не стала настаивать на продолжении."
    sl "Ну вот и хорошо! {w}Тогда давай заканчивать, да?"
    "Я кивнул, и мы вернулись к работе, некстати прерванной моим вопросом."
    "Простые искренние слова девушки невольно тронули меня".
    
# ГГ несколько смущён и тронут. Вероятно, что-то хорошее и растерянное думает про Славю. Что не видел от неё ничего, кроме добра и т.п.
# В последнем тюке оказываются стиранные личные вещи отыхающих - штаны-рубашки всякие. "Пусть лежат, потом разберу по отрядам, а дальше вожатые разберутся". Быстро заканчивают, выходят. Славя запирает склад. "Спасибо тебе большое". Слегка смущённо "Ты как, не против ещё немного помочь? Если я тебе не слишком надоела, конечно."
# У ГГ невольно вырывается "конечно же нет, не против!" - "Вот и славно!"
# далее идут готовить эстраду - скопипиздить из текста Сычёва - далее на обед.
# Вставить где-то в конце упоминание про танцы. "Ты и так на меня полдня потратил, но я наберусь всё же наглости и спрошу..."