# Зырим бесплатный стриптиз на умывальниках. Сюда попадаем с палевной ветки, если упорно отбрыкиваемся от беседы с Виолой.
label alt_day6_uvao_wash_dv_us:

# Ежеутренний чекпойнт, ряды умывальников, подключенных прямиком к тающим ледникам, ждали меня. Как всегда, я набирался духу для очередного испытания водой, закалки тела и, через него, духа, или наоборот…

##пауза с миганием интерфейса

# "Ну сколько можно уже резину тянуть! Фени, фиди, фидши..."
# Я был уже почти готов окунуться в обжигающе холодную воду, но тут

# А: - Давай сюда быстрей!

# Упс. Алиса, и, судя по голосу - далеко не в радужном настроении.

# А: - Ну давай уже! А то Шляпа запалит.

# "Лучше б мне не отсвечивать, наверное."
# Я, так и не умывшись, подхватил полотенце и занял наблюдательную позицию в густых кустах. И вовремя.

##спрайты Алисы и Ульяны. Можно поверх чумазые пятна накидать

# На умывальную площадку выбежала неразлучная парочка - Алиса, а с ней и Ульяна. Видок у них был…
# "Где это они так умудрились перемазаться, интересно?"

# А: - Никого нет? Отлично, тогда быстро раздевайся!
##брать спрайты

# "Ну почему мне так везёт?! Сейчас заметит - и до завтрака я не доживу."
# Оставалась лишь слабая надежда на то, что пронесёт, и меня не заметят.
# Ш: "Надейся, почему бы и нет. Надо же чем-то время занять."
# Ш: "Хотя… Все равно помирать, так может хоть краешком глаза глянем? А?"

# И чего я, спрашивается, ожидал?

##опять несколько раз показать-убрать интерфейс, с полсекундной паузой, олицетворяя колебания

# "Ладно."
# Ш: "Серьёзно?!"
# В конце концов, врага надо встречать лицом к лицу. Хотя бы для того, чтоб вовремя дать дёру.
# Ш: "Ага, и просто позырить хочется."
# Ш: "Не обманывай хотя б меня. Себя можно."
# Ш: "Ну, давай уже!"

# Мысленно вздохнув, я стал осторожно раздвигать ветки. 
##ЦГ в лифчиках
# Рыжая банда обосновалась у крайнего умывальника, форменные рубашки были разложены на соседней стойке. Я имею в виду, обе рубашки. 
# Ш: "Ву-хуу, джекпот!"
# Алиса, вооружившись какой-то импровизированной мочалкой, очищала с рубашек самые заметные пятна. Ульяна, недовольно ворча, набирала воду в горсти.
# У: - Брр, холоднючая!
# А: - Ты не рассуждай, ты отмывайся давай!
# У: - Но она же холоднючая!
# А: - Ах, холоднючая?
# - произнесла Алиса с весьма саблезубой улыбкой.
# А: - Сейчас согреешься!
# Она принялась усердно оттирать Ульяну той же мочалкой, которой чистила рубашки - то есть, скомканным галстуком. Ульяна лишь отфыркивалась, не сильно протестуя против такого обращения.

##здесь включаем волнующую музыку, как в оригинальном эвенте
# А: - Ну вот, теперь хоть на человека похожа.
# У: - А до этого на кого?
# А: - На порося!
# У: - Хи-хи… ХРЮ! 

# У: - Алис… а дай померить?
# А: - Чего?
# У: - Ну лифчик. Померить. 
# У: - У тебя ж вон какие выросли!

# Я непроизвольно затаил дыхание. Не может быть…

##звук съехавшей иглы грампластинки - хрен вам, а не стриптиз!
# А: - Ага, щас! Померить ей, а из-за кого мы так угваздались, не напомнишь?! Чтоб я еще раз…
##обратно спрайты
# А: - Пошли скорее, опоздаем - Шляпа хай подымет!
# Они натянули все еще мокрые рубашки и скорым шагом усвистали по тропе в сторону площади.

##опять мигнуть интерфейсом

# "Пронесло."
# Ш: "Блин, та-а-акой облом!"
# "Не-е. Ты заметил, что нам даже по голове не дали?"
# Ш: "Нет в тебе авантюризму. Подумаешь, голова…"
# "Она мне дорога, как память. Да и ты тоже в ней проживаешь, так что соответствуй!"
# Ш: "Ну лан."

# Ш: "Кстати, голова, а почему мы до сих пор лежим в кустах? Ждём продолжения стриптиза? Ну ок, щас Сыроега придёт, его позырим…"
# "Чур меня."
# Не рассусоливая, я наконец-то поплескал в лицо воды - действительно холоднючая! - и бодрым шагом направился обратно. Кажется, мне куда-то было нужно.

jump alt_day6_uvao_breakfast_with_viola