label alt_uvao_catapult_ending:
#
#"Где я? Что произошло?"
#Лето, лагерь… Воспоминания  роились в голове, странные, совсем не похожие на сон. Гораздо более реальные, чем моя "реальная" жизнь. 
#"Жаль просыпаться…"
#
##открываем глаза, видим полузатопленный автобус
#Вместо привычного интерьера квартиры… 
#"Какого… Автобус? Вода?!"
#Я вскочил… вернее, попытался. Конечности едва ощущались, и совершенно не собирались реагировать на приказы сознания. Я держался на поверхности воды, поднявшейся уже до уровня окон, только за счет куртки - раздувшийся непромокаемый пуховик служил импровизированным спасательным жилетом. Экстремальные условия, как обещалось на этикетке…
##можно пустить фоны лагеря через эффект снега
#"Я снова все запорол."
#"Попытался понять то, что понять невозможно."
#"Неудивительно, что задолбавшийся демиург просто взмахнул банхаммером и вышвырнул меня из своего мира."
#"Обратно сюда, где всё понятно и логично."
#"Теперь я счастлив?"
#
#Нужно собраться, испугаться, чтобы всплеском адреналина загнать немного воли в онемевшие руки, и действовать. Выдернуть шнур, выдавить стекло, как повелевала полустертая надпись! Повернуть ручку по стрелке и вытолкнуть люк…
#Нет.
#Это все не то.
#И намертво привинченый скобой и болтами люк - чтобы не дребезжал! - лишь мелкая деталь. Та, что должна подсказать правильный путь.
#Ш: "Путь - куда?"
#Туда, мой друг, туда. Куда неизбежно катится весь мир.
#Гейм овер.
#
###пауза секунд 5-10
#Загрузить.
#Добро пожаловать в лето, снова!
return
# титров не надо
