# ЮВАО концовки - нейтрал и нейтрал-бэд 
# TODO: скрипт! И мне не нравится кошкоэнд, больно уж трешовый.
    
label alt_uvao_ending_neutrals:    
	# Я снова кричал во сне.
	# Кричал, кричал, и проснулся от собственного крика.
	# Я был…
	# Я был…? 
	# Хмм?
	# Странно, я не мог вспомнить ни единой подробности сна. Обычно помнишь хоть что-то, хоть какую-то деталь - "там был дирижабль, и вулкан, и ещё отряд зеленых ниндзя", например. 
	# Здесь же… ни единой идеи, кроме ощущения, что что-то БЫЛО. Что-то важное…
	# Да ну нахрен. Не помню - и не надо.
	
	# Глаза, как всегда после пробуждения, конфликтовали с реальностью. Всюду плывут туманные пятна, фокус куда-то мимо. Пришлось несколько раз зажмуриться и встряхнуть головой.
	
	# "Я - Семён. Персунов. Двадцать восемь лет. Это Питер. Санкт-Петербург."
	# Даже такая дурацкая точка сборки, кажется, сработала. По крайней мере, зрение более-менее сфокусировалось и показало мне стол и экран ноутбука на нем, только-только вышедшего из спящего режима.
	# "Я тоже проснулся, хозяин! Какие будут приказания?"
	# Тьфу.

	# Пошатываясь, я поднялся. Мебель и прочий хлам совершенно недвусмысленно нацелились отбить мне все пальцы на ногах, но, тем не менее, я успешно добрался до ванной. 

	# Помятая угрюмая морда в зеркале дивно гармонировала с окружающей действительностью.
	# "Я тебя не знаю, но я тебя умою… Хотя ты и не существуешь. И я тоже."
	# Зазеркальный визави посмотрел на меня дикими глазами, но потом согласно кивнул.
	# - Это я сейчас должен испугаться и садануть кулаком по стеклу?
	# Ответа не воспоследовало. Ну ещё бы… 

	##Звук умывальника

	# "А это еще откуда взялось?"
	# На предплечье, почти у самого локтя, по-праздничному багровел синяк.
	# "Где это я так приложился? Или кто-то меня хватал, судя по очертаниям?"
	# Как ни старался, я не мог вспомнить, откуда у меня такие регалии. Вчерашний день ничем не отличался от позавчерашнего, и от позапоза-… 
	# Плюнув, я вторично набрал ледяной воды в горсти.

	# После водных процедур тело слушалось лучше. По крайней мере, не приходилось держаться за стенку, возвращаясь обратно. 
	# Ноут по-прежнему светил экраном, заманивая в волшебный мир смешных котиков и циничных спорщиков. К черту, не хочу.
	# "Пойти что ли прогуляться? Сигареты закончились…"

	# На столе зажужжал мобильник, нарушая мое  бездумное созерцание.
	## развилка на нейтрал-псих 
	if alt_uvao_D5_hentai:
	# Я сидел и смотрел, как чудо технической мысли медленно ползет к краю стола, пытаясь добиться моего внимания. Еще немного, еще чуть-чуть…
	# С глухим пластиковым звуком смартфон упал на пол. Крышка и батарейка потерялись где-то под кроватью, остальная часть уставилась черным экраном в потолок.
	# "Абонент недоступен и находится вне данной реальности…"
	# В голову лезет какой-то бред. Действительно, надо бы сходить, проветриться.

	## Хруп хруп снегом

	# Промозглый ветер привычно стремился пробуравить тонкослойное пальто. Так же привычно ёжась, я заткнул уши плеером и запихал руки поглубже в карманы. Отвали от меня, мир. Я самодостаточен и независим.

	## Слайды зимнего города

	# Похоже, внезапно включившийся автопилот привёл меня к автобусной остановке, а не к магазинчику. 
	# Это было бы объяснимо, будь я обычным офисным рабом, но для фрилансера, который неделями не выходит из своей конуры? 
	# Тем не менее, факт был неоспорим - вот он я, а вот она остановка, и вдали видны задние фонари только что отъехавшего автобуса.
	## Где-то тут включаем музыку - Чайф "Дверь в лето". 
	# Картонная коробка на скамейке покачнулась, наверное из-за ветра. Забыл кто-то, в автобус садясь. Или террористы оставили. Ха-ха.
	# ЦГ коробки.
	# Коробка дрогнула еще раз, и еще, уже без помощи ветра, из-под крышки что-то выглянуло. 
	# Кто-то.
	## ЦГ котенка в коробке
	# Два темно-рыжих уха, два желтых глаза. Розовый нос. И раззявленая в осипшем мяуканьи пасть.
	
	# "Почему холодно?! Где я?! Что за безобразие! Это совсем неподходящее место для котёнка! Должно быть лето! Должно быть тепло!"
	# Я слышал эти возмущенные тирады как наяву. Впрочем, тут не надо быть знатоком кошачьего.
	# - И что мне теперь с тобой делать?
	# "Он еще спрашивает! Спасать!"
	
	# Выбора мне, похоже, не оставили. Я расстегнул пальто и посадил найденыша за пазуху.
	# - Ну что, пойдем домой?

	# В магазинчике, кроме продуктов и сигарет, нашелся стеллаж с зоотоварами. 
	# Лоток, наполнитель, миска, пакет детского корма по совету продавца, даже какой-то мячик с пушистой висюлькой… возвращался я тяжело нагруженным.

	# Спущеный на пол котёнок понюхал воздух, сел на пол и стал вылизываться. То есть стала. Ну хотя бы с полом определились.
	# - И как мне тебя звать?
	# "Почему ж она на Ю? Юлькой кошку звать мою!" - внезапно всплыл в памяти детский стишок. А что, подходит.
	# - Значит, будешь Юлькой. Согласна?
	# Юлька вытянулась на коврике и зевнула. 
	# Кажется, теперь я не один.
	## Ачивка - "Без кота и жизнь не та."

	## Таймскип, возможно по флагу тру-прохождения

	# - Персунов, к вам делегация. Примете?
	# Как обычно, я не отвечаю. Всё равно я не могу отказаться, значит, можно игнорировать. Это у меня получается лучше всего - игнорировать. 
	# Я бездумно пересчитал вошедших. Восемь интернов, и доктор. Еще где-то на заднем плане маячит шкаф-санитар - перестраховываются. 
	# Виола-доктор: - Записывайте. Аномальная форма шизофрении, хронический галлюциноз…
	# Слушать не хотелось, и я вернулся к прерваному занятию. Гладить Юльку.
	# Помнишь, как всё началось? Да, я тоже помню. С ветеринара.

	# Эффект воспоминаний, можно фон ветеринарной клиники
	# - Мужчина, вы издеваетесь?!
	# - Но подождите…
	# - Пошёл отсюда, наркоман! Обкурятся своей дрянью… кошку ему вылечить, от прозрачности!
	# Звук "по мордасам" несколько раз.

	## Цг с мерцающей кошкой
	# Я не выдержал, вспылил… да, наверное, зря. Ты так и говорила. Но я и вправду беспокоился.
	# Дальше милиция, а потом и скорая, из психиатрички. Я уже был согласен на всё… 
	# Когда уже тут выяснилось, что они считают тебя галлюцинацией… и будут лечить меня… в общем, с тех пор этот шкаф, Саныч, все время присутствует где-то рядом.

	# Виола: - Был назначен курс нейролептиков, состояние пациента стабилизировалось, но улучшений не наблюдается. 

	# Эти поганые колеса даже не дают мне ничего почувствовать, Юля. Мне остается только равнодушно смотреть, как ты постепенно исчезаешь. 
	# Ты уже даже почти не разговариваешь, хотя я по-прежнему понимаю тебя, даже без слов.

	# Виола: - Динамика слабо-отрицательная, показан повторный курс с увеличением дозировки.  

	# Ещё немного, и всё закончится. Сначала исчезнешь ты, а я останусь… ненадолго. 
	# Хотя время уже не будет значить ничего. Ничто уже не будет важно. 
	# Я ускользну с тобой, оставив им лишь тупую оболочку, да, так и будет, Юля.
	# Ачивка "Без кота…"
		return
	else:
    # нейтрал «моментально в море»
     
    # "Удивительно, кому-то что-то от меня надо."
    # Я подождал,  пока неизвестному абоненту не надоест слушать заунывные гудки, но через несколько секунд телефон зазвонил снова. 

    # И потом еще раз. Кажется, меня вознамерились достать из-под земли. 
    # "Кому же это я настолько сильно нужен?"
    # - Алло. 
    # - Да. Нет. 
    # - А что стряслось? 
    # - Серьезно? 
    # - Ну в принципе могу. 
    # - Ладно. 
    # "Собирался прогуляться - вот, пожалуйста, срочный вызов. Всё пропало, все лежит, ничего не работает. Срочно приезжай и чини."
    # Вздохнув, я принялся собираться. Не первой свежести джинсы, мятая футболка… Кому может быть дело до того,  как выглядит нелюдимый лохматый тип, который периодически появляется что-то поковырять в компьютерах? Вот и мне никакого дела. 
    # Я не мог объяснить самому себе, зачем я вообще согласился ехать? Не из-за щедрой же оплаты, в самом деле! 
    ## nvl 
    ## Улицы, Семён спиной, хруп-хруп
    # Просто… 

    # Это всё из-за сна. Сна, который я не мог вспомнить, как ни старался, но который - я уверен - был. БЫЛ, именно так, жирными аршинными буквами. Был намного реальнее, чем мое теперешнее существование. 

    ##Остановка

    # Почему-то невозможность выудить из памяти ни единой подробности беспокоила,  как дырка на месте вырванного зуба. Фантомная боль моей ампутированной реальности.
    # "Ещё вопрос, кого именно отрезали - реальность от меня, или меня от реальности… Хотя результат один."
    ##/nvl
    ##автобус приехал
    # "Вот и мой транспорт. Привет из прошлого."
    # Престарелый ЛиАЗ, натужно звеня внутренностями, причалил к остановке и с шипением отворил створки. Карета подана. 

    # Я втянул себя внутрь по грязно-белому поручню и постарался устроиться на сиденье возле теплого железного короба. Проклятый климат уже успел запустить свои стылые щупальца мне под одежду, и хотелось согреться… 

    # Тщетно. Наверное, этот шедевр автостроения подлатали с помощью кувалды, лома и такой-то матери и выпустили на маршрут в последний рейс. Отопление салона же при этом ремонту не подлежало. 
    # Я поднял воротник пальто и спрятал руки поглубже в карманы. Относительно терпимо… 

    ##пауза. Если получится -цг с скрюченным чуваком на сиденье автобуса. 

    # Кажется, я задремал, несмотря на холод, тряску и шум двигателя. Я будто бы висел под потолком автобуса, вместо тусклой лампочки. 
     # "Это я сижу там, скрючившись на манер эмбриона. Почему-то я вижу себя со стороны."
    # "Напоминает рассказы пациентов, вовремя выведенных из клинической смерти. Я читал."
    # "Еще вроде бы доказали, что это лишь галлюцинации. Кажется, писали яркие запоминающиеся надписи на верхних полках шкафа, чтоб было видно только из-под потолка. Никто из пациентов их не увидел."
    # Я продолжал плавать в воздухе и наблюдать за собой,  забившимся в угол сиденья. Как будто бы все так и должно быть. По крайней мере, никакого неудобства это мне не причиняло, я всего лишь бесстрастно наблюдал, как я-он старается свернуться поуютнее на потрепанном кожзаме, не обращая внимания на происходящее снаружи. 
    # Не замечает он, не замечаю я.
    # Не замечаю, как автобус истошно загудел и вильнул в сторону. 
    # Не замечаю, как этот накренившийся рыдван юзом скользит к ограде моста. Не замечаю удара, нескольких секунд шаткого равновесия и - сначала медленного, а потом все быстрее и быстрее - падения в темную воду. 
    # "Это же всё сон, да? Это не может не быть сном. Иначе я бы должен был вскочить, выбить стекло,  постараться выбраться из идущего ко дну железного гроба…"
    # "Это сон. Незачем суетиться."

    ##затемнение
    ##пауза

    # - Эй! Приехали, выходи! 
    ##салон автобуса 
    # Я вздрогнул и открыл глаза.
    # "Действительно сон."
    # - Что, уже конечная? Метро? 
    # Водитель, кавказец какого-то изможденного вида, раздраженно замахал на меня руками.
    # - Да, да, приехали, конечная! 
    # Выставив меня прочь, он вернулся к своему занятию - пересчету медных десяток,  рассыпанных по покрытому ковром кожуху двигателя. 
    # "А я-то, кстати, заплатил? Не помню. Наверное, да."

    ##можно фон входа в метро со следами разрухи 

    # Странно. Вокруг ни души, будто вымерло всё. Неужели я один такой неприкаянный, еду в предпразничный вечер? 
    # "А куда я еду, кстати? Ах да."
    ##фон с эскалатором 
    # Створка двери с куском грязной фанеры вместо разбитого стекла, личность неопределенного пола и возраста за мутным стеклом будки, тусклый свет ламп. Я спускаюсь в подземное царство, оседлав адскую лестницу, готовую проглотить и перемолоть любого зазевавшегося путника. 
    # "Ходили раньше страшилки про пропадающих в тоннелях метро людях… Будто бы мутировавшие крысы отлавливают их себе в качестве домашнего скота, заставляют крутить колеса эскалаторов, а потом сжирают… Почему этот бред лезет мне в голову?"
    ##фон тусклеет, туманнеет, обесцвечивается
    # Эскалатор с едва слышным, но раздражающим скрипом несет меня в бездну. Я уже так глубоко, что выход потерялся в дымке, и такая же дымка скрывает конец тоннеля. Но это неважно. В конце концов я все-таки доеду туда, куда мне надо.
    ##все серое, едва видное, покрыто трещинами как фотография на могильном памятнике. 
    ##ачивка "Всего лишь сон"

