## Д6 после обеда
## Моем-моем трубочиста - Семён принимает душ перед амурной Славей. 
## площадь
# Пересекая площадь наискось, я поймал себя на том, что насвистываю какую-то незатейливую мелодию, и даже слегка пританцовываю, размахивая полотенцем.
# "А и пофигу! В кои-то веки у меня есть повод вести себя соответственно моей здешней роли…"
# Ш: "Вообще-то твоя всегдашняя роль - неудачник." 
# "За-дол-бал! Ты вообще чей друг, мой или медведя?!"
# Ш: "Я просто напоминаю. Должен сам привыкнуть, что если все складывается хорошо - жди беды."
# В чем-то мой ехидный комментатор был прав. Но, тем не менее, испортить хорошее настроение ему было не под силу. 
# "Не думаю. Пока всё складывается довольно неплохо - умоюсь, схожу со Славей на концерт, да и на танцы тоже… "
# Ш: "Ага, приходишь такой весь свежевымытый, а Славя и говорит - Семён, будь другом, помоги мне в сарае разобрать, позязя!"
# Ш: "Или еще что-нибудь такое же…"
# Ш: "Только мыло зря потратишь."
# "Так, кто только что мне втирал, что она просто решила взять штурвал в свои руки? Ты уж придерживайся какой-нибудь одной линии."
# Ш: "Не штурвал, а поводья тогда уж. А по поводу линии - ты всерьёз мне будешь объяснять, как должно вести себя раздвоение личности?!"
# Ш: "Я просто предостерегаю. Уж очень все внезапно, и без малейших усилий с твоей стороны. Подозрительно!"
# Наверное, стоило бы прислушаться… Но мне до жути не хотелось возвращаться к своему прежнему modus operandi. 
# "Да ерунда. Что такого может случиться, чего стоило бы опасаться?"
# "Ну может погуляем после танцев где-нибудь…"
##if кормили ежиков после турнира в д2
# "покормим еще каких-нибудь ежиков."
# "Все будет мило и романтично. И это - максимум!"
# Ш: "Ну-ну… "

##фон с душевыми
# За препирательствами я и не заметил, что уже дошел до цели, и едва не прошел мимо на автопилоте. 
# Так, где здесь Эм, и где тут Жо?
# Ш: "Да, главное, не перепутать. Впрочем, если там Славя..."
# "Да отвяжись ты уже."

##кое-кто переменил таблички М и Ж.

#if обедал с Алисой и отказался от Лены:
# Тем не менее, я проверил фанерную табличку на двери. Да, ошибок быть не может, треугольник острием вниз и кружочек над ним, выжженные в дереве - продукт творчества какого-то пионера с зачатками художественного таланта. 

# Успокоенный, я вошел внутрь, положил сверток с принадлежностями на скамейку и собрался раздеваться. 
##раздевающаяся Алиса в купальнике. 
# "Упс…"
##пауза
##фон, злобная Алиса в купальнике 
# Алиса: Т-ты… ты-ы… Скотина-а!!! 
# Что-то мелькнуло в воздухе, и я едва успел прикрыть глаз. Суровое советское вафельное полотенце, по ощущениям, содрало мне половину лица, не хуже наждачки.
# - Эй! Ты чего?!  Прекрати, придурошная!!! 
# Завопил я, отпрыгнув за пределы досягаемости острых кулаков.
# Алиса: - Я?! Я придурошная?! 
# - Ну не я же! Ты нахрена в мужской душ залезла?! 
# Алиса: - Какой еще мужской?! 
# - Такой, блин! 
# Вместо долгого спора я ткнул пальцем в табличку на весьма кстати приоткрывшейся двери.
##офигевшая Алиса
# Алиса: - Что-о?! Какого…? Еще вчера было наоборот! 
# Алиса: -Найду, кто перевесил… не жить ему больше! 

##смущенная/раздраженная Алиса
# Алиса: - Эй, хорош пялиться уже! Иди  на свою Ленку пялься! 
# "Мою Ленку? Когда это она успела стать моей?"
# Я не стал обострять конфликт и послушно вышел. 
# Шиза: "А я предупреждал. Когда всё хорошо - жди подляны."
# "Ну и ладно. Закончилось все вполне неплохо - всего лишь получил по физиономии полотенцем. Могло быть гораздо хуже."
# Шиза: "И лучше тоже. Можно было бы застать Алису совсем неглиже."
# "И получить уже не полотенцем, а, скажем, скамейкой. Нет, спасибо, оно того не стоит."

# "Всё-таки интересно, чьих рук это дело?"
# - Ульяна! 
# Фигурка в красной футболке, методично чеканящая мячик на поле, обернулась. 
# Ульяна: - Чего-о? 
# - Иди сюда!
##Ульяна
# Ульяна: - Чего зовешь? 
# Я кивнул на дверь. 
# - Твоя работа? 
# Ульяна: - А? Где?! 
# - Таблички ты поменяла? 
##раздраженная Алиса,уже одетая
# Алиса: - Ульяна! Ты совсем наглость потеряла?!
##возмущенная Ульяна
# Ульяна: - А что я?! Я тут вообще не при чем! 
# Ульяна: - Я же не совсем дура - такую подлость делать! Тем более тебе! 
##Ульяна покраснела
# Ульяна: - Тебя же могли… {b}голой{/b} увидеть! 
# Алиса: - А кто тогда?! 
##возмущенная Ульяна
# Ульяна: - Не знаю! Точно не я! 

# Из кустов поодаль раздалось сдавленное фырканье. Потом из зарослей вывалился какой-то белобрысый пацан, и, не прекращая хохотать, ломанулся прочь. 
# Ульяна: - Данька! Это он! 
# Алиса: - Стоять! Убью гада!!!
# Рыжие одновременно сорвались с места и бросились в погоню. 
# "Если они его догонят - я ему не завидую… Впрочем, заслужил."


#else:
##прямой выход на амуры со Славей

# Применить дедуктивный метод на практике мне не дали. 
# Женя: - ПОШЕЛ ВОН!!! 
# Изнутри раздался крик, дверь распахнулась и из нее спиной вперёд вывалился полуголый Сыроежкин. Дверь захлопнулась обратно, так,  что табличка с аршинной буквой М едва не рухнула на землю, вырвав шурупы. 
# "Этот голос… Стоп!"
# "Что Женя делает в мужской душевой?!"
# Я вопросительно уставился на Электроника, он ответил ошарашенным взглядом. 
# Эл: - Я ничего… Я вообще! 
# Шиза: "Ничего не делал, только вошёл!"
# Эл: - А там - она! 
# Это "она" было произнесено с такой гаммой чувств… 
# Шиза: "Мне всё ясно. Наш многоуважаемый гриб застал Евгению-свет-книгочеевну в весьма интересном виде, и до сих пор не может отойти от увиденного."
# Шиза: "А если б ты поторопился - этот шанс достался бы тебе!"
# "Ну уж нет, спасибо. С радостью уступлю право получить когтями по физиономии, к тому же он, кажется, не против."

# Дверь отворилась, и мы синхронно отпрянули. Излучая космический холод, Женя прошествовала мимо нас. Взгляд ее был подчеркнуто устремлен вперёд, грация и осанка напоминали ножницы по металлу - я почти слышал характерный скрежет. 
# Эл: - Женя, я… Извини… Но там ведь М написано было! Вот и… 
# Его лепет был проигнорирован на корню. Все так же не утруждаясь обратить на нас хоть толику своего царственного внимания, библиотекарша скрылась из виду. 
# Эл сокрушенно вздохнул, подобрал рубашку и поплелся прочь. 
# Шиза: "Да, не повезло чуваку. Из кожи вон лезет, чтоб она на него внимание обратила, а выходит сплошной облом."
# Шиза: "Тебе его жаль?"
# "Немного. Но не настолько, чтоб бежать его утешать."
#/if

# "У меня теперь другой насущный вопрос. Которую из душевых считать мужской - традиционную или фактическую?"
# Шиза: "Ориентируйся на таблички."
# "Да? Почему?"
# Шиза: "По нескольким причинам. Во-первых, снаряд два раза в одну воронку не попадает."
# Шиза: "Во-вторых, в случае чего притворишься дурачком, который ничего не знал - впрочем, тебе даже притворяться не надо."
# Шиза: "И, в-третьих, а вдруг кто-нибудь и вправду на огонёк заглянет?"
#if беседа с Алисой:
# Шиза: "Например, Лена… Ну или Славя."
#else:
# Шиза: "Славя, например."
#/if
# Вздохнув, я последовал совету комментатора. 

# На этот раз все прошло без эксцессов, и через некоторое время я, прямо-таки скрипя от чистоты, топал обратно. 

# Вожатой дома уже давно не было - как оказалось, моя возня в душевых заняла целый час! 
# "Эдак я и к концерту опоздаю!"
# Ш: "Что, не терпится к активисточке? Так не теряй времени, беги, тебя обязательно к чему-нибудь привлекут." 
# Ш: "Общественно-полезному."
# Ш:" Не знаю, покрасить что-нибудь или починить… Короче, дело найдётся!"
# Я привычно не обращал внимания на выходки внутреннего голоса. Бубнит себе и бубнит, радио "Ненависть" моё ... 
# Такое чувство, что он-она-оно меня… ревнует? 
# Ш: "Ну всё, ты меня раскрыл. Вывел на чистую воду, все пропало, пойду поплачу в углу."
# Конечно, разве так просто признается…

# Я закинул полотенце и прочее обратно в шкафчик и попытался в очередной раз завязать каноничный узел на галстуке. 
# "Похоже, это искусство выше моего понимания. Хрен с ним!"
# Пригладил перед зеркалом растрепанные после мытья волосы - ну, сойдёт. 
# "Ну что, я готов. Действительно, сходить помочь на сцене что ли?"
# Забавно. Недавний я согласился бы на это только под угрозой расправы, да и то не факт. Совсем давний я - воспользовался бы поводом, чтобы подкачать к понравившейся девушке, и только взаимная симпатия смогла бы искупить ту дурь, которую я стал бы вытворять. 
# А сейчас - я просто не против сделать что-то, не ожидая непременных дивидендов. 
# "Впрочем, отказываться я тоже не буду."
# Всё-таки удивительно, что такая девушка, как Славя, проявляет ко мне неподдельный интерес. Что же она такое во мне разглядела? Понятия не имею. 
# Ш: "Сие тайна великая есть." 
# Ш: "И Юле ты чем-то приглянулся… Как же ты будешь этот треугольник размыкать?" 
# "Да какой там треугольник…"

# "Я всего лишь следую совету Виолы - стараюсь пожить жизнью обычного пионера. Вроде бы пока получается."
## TODO: добавить оный совет в утренние разговоры 

##домик снаружи 
# Выйдя на крыльцо, я запер дверь и собрался бежать к сцене… 
# Ю: - Семён. 
# Я завертел головой, стараясь понять, откуда донесся голос. Откуда-то… сверху? 
##выглядывает сверху 
# Ю: - Привет, Семён. 
# - Юля! Ты чего там делаешь?! Тебя же заметят! 
# Ловко перекувыркнувшись в воздухе, она приземлилась рядом со мной. 
# Ю: - Не заметят, я хорошо прячусь. Даже ты меня не заметил. Пока я тебя не позвала. 
# - Всё равно, мало ли… А зачем ты меня искала? 
# Ю: - Узнать. Там что-то происходит интересное. 
# Ю: - Всё бегают и суетятся. Почему? 
# - Где? 
# Она махнула рукой в сторону. 
# Ю: - Там. Где большой дом без стены.И рядом. 
# - Ааа, на сцене? Концерт готовят. Выступление, понимаешь? 
# Ю: - Выступление? Концерт? 
# Она непонимающе смотрела на меня.
# - Ну да. Музыка, песни, может танцы. Каждый показывает, что он умеет. А остальные смотрят. 
# Ю: - Ааа. Поняла!
# Ю: - Я раньше видела. Но тогда не было интересно, а сейчас - интересно. 
# Ю: - Ты пойдёшь смотреть? 
# - Пойду, конечно. И потом тебе всё-всё расскажу! 
# Ю: - Зачем? Я сама посмотрю. 
# - Ты что?! Тебя же заметят! 
# Ю: - Нет. Я хорошо спрячусь, никто не увидит. Я хочу посмотреть. 
# "И как мне теперь выполнять просьбу Виолы, хотел бы я знать?"
# - Где ты там спрячешься? Там же…
# Ю: - В кустах. Залезу и притворюсь, будто я - тоже куст. 
# "Не нравится мне это. Столько народу, кто-нибудь точно заметит, а там - паника, все разбегаются, Алиса с Ульяной, наоборот, кидаются ловить… "
# Юля, будто прочитав мои мысли, засмеялась. 
# Ю: - Не бойся, меня никто не увидит. Я очень хорошо умею прятаться! 
# Ю: - А ты тоже со мной в кусты полезешь? 
# Ш:" Гусары, молчать."
# Я непроизвольно фыркнул. 
# "Даже и не знаю… Надо бы проследить, чтоб никто не заметил."
# "Вот только кто-то обязательно заметит меня. Я-то не смогу притвориться листиком дерева!"
# - Я, эээ, нет. Я, наверное, лучше на скамейке буду сидеть. 
# Ю: - Да, тебя труднее будет спрятать. Сиди лучше там. 

##звук начала концерта. Какое-нибудь музыкальное вступление? Первый звонок

# В воздухе разнеслась какая-то короткая мелодия, заставив нас с Юлей насторожить уши. 
# Ю: - Музыка? Началось уже? 
# - Кажется, нет, но скоро начнётся. 
# Ю: - Я побежала! Прятаться! 
# Лишь хвост мелькнул между кустов - и я остался один. 
# "А я-то надеялся просто посмотреть концерт… Теперь придётся постоянно следить, чтоб никто случайно не наткнулся на Юлю. "
# Ш:" А если наткнётся?"
# "Тогда… Не знаю. Придётся импровизировать."
# Кстати, мне тоже пора бежать, если я хочу успеть пораньше. 


# Концерт, ужин и побег со Славей с дискотеки - ветка, где считаем, что Славя нас окучивает с амурными целями
init:
    $ tl_7dl = Character(name=u"Толик", color="#A1752F", what_color="E2C778", drop_shadow = [ (-1, -1), (1, -1), (-1, 1), (1, 1) ], drop_shadow_color = "#000")
    $ alt_uvao_D6_CS_vetrov = False
# TODO: Перекинуть толика куда-нибудь
# Перед релизом последний alt_script возьмём туда и всунем. -R
label alt_day6_uvao_concert_with_sl:
    window hide
    $ alt_chapter(6, u"Юля. Концерт")
    scene bg ext_stage_normal_day
## сцена
# У сцены творилось небывалое оживление. Пионеры сгрудились кучками, кто-то торопился занять самые козырные места себе и друзьям, кто-то, наоборот, не спешил усесться, участники выступлений в спешке проводили самую распоследнюю репетицию… В воздухе витало радостное предвкушение вперемешку с волнением. 
# "Похоже, итоговый концерт и вправду все ждут. Совсем не так, как позавчерашнее насилие над слухом и зрением - то было для галочки, а тут все и впрямь стараются выступить, продемонстрировать умения перед товарищами…"
# Я поймал себя на мысли, что чертовски завидую им - вот так выйти под ослепляющие взгляды публики, заявить свое право на толику их внимания… 
# Ш: "Может, тебе тоже стоило бы поучаствовать?" 
# "С чем, интересно? Мой предел - три блатных аккорда, да и те уже не помню когда последний раз исполнял."
# "Пение - тоже не вариант. Может, голос у меня и не самый плохой, но… Короче, лучше не стоит."
# "А больше мне и нечем похвастаться."
# Ш: "Один вариант забыл. Стендап-комик." 
# "Да ну тебя."
# Ш: "Не, я серьёзно. Сделаем тебе амплуа белого клоуна, с которым постоянно какая-то ерунда происходит, будешь об этом со сцены вещать."
# Ш: "А с текстом я тебе буду подсказывать." 
# Ш: "Успех гарантирован! Ну, или побьют, что тоже признание…" 
# "Нет, спасибо!"

# Славя: - Семён! 
# Окликнули меня сзади. Я обернулся. 
## Славя, ОД и Мику
# ОД: -...Мику, делай всё как знаешь. Ты всё равно в этом лучше нас разбираешься. 
# - Привет. 
# Мику: - Хорошо-хорошо, я все сделаю, я просто хотела узнать как будет лучше, или вдруг у вас есть идеи, привет, Семён, ты тоже пришёл на нас посмотреть, а ты как думаешь, как будет лучше… 
# ОД: - Мику! Все вопросы - на твоё усмотрение. 
# Мику: - Ну я же так волнуюсь! Я раньше только выступала, а тут ещё надо программу вести, и фонограммы переключать, и руководить, ой столько всего, я ни за что не справлюсь, ужас-ужас… 
# Вздохнув, вожатая подхватила все продолжающую причитать японку под локоток и без лишних слов поволокла к сцене. 
# Сл: - Ох. 
# - Да. Полностью с тобой согласен. 
##смеющаяся Славя
# - Как ты думаешь, она справится? Мику, я имею в виду. 
## улыбчивая Славя
# Сл: - Конечно! На самом деле это она все и организовала - и программу составила, и номера младшим отрядам, и фонограммы подобрала…
# Сл: - А это она просто кокетничает. Звязда! 

# Она вдруг поглядела на меня и прыснула в кулачок. 
# - Что? 
# Сл: - Не, ничего… Просто ты такой взлохмаченный! 
# Мда, наверное, следовало всё-таки причесаться после душа. 
# - Увы, до парикмахера дойти не успел.
# Сл: - Ничего страшного, мне даже нравится. Знаешь, на кого похож? 
# - На кого? 
# Сл: - На Маугли! Или на Тарзана. 
# "Скорее, на йети. Будем сидеть рядом, как красавица и чудовище."
# Ш: "А вот последнюю фразу озвучь ртом. Полезно будет."

## смущенная улыбающаяся Славя
# В кои-то веки совет оказался дельным. 
# Сл: - Ой, скажешь тоже! 
# Отмахнулась она, но было заметно, что комплимент пришёлся по душе. 
# Сл: - Пойдём лучше место займём. 

# Наше место нашлось в предпоследнем ряду, посередине, откуда, по словам Слави, было лучше всего видно. Впрочем, смотреть было пока не на что, третий звонок ещё не прозвучал, и я просто глазел по сторонам. 
# "Кстати…"
# Я принялся пристально изучать кусты, в изобилии растущие сзади и по бокам от зрительских мест. 
# "Она должна быть где-то тут."
# Ш: "Если только не передумала." 
# "И пропустила такое интересное? Ну это уж вряд ли… "

# В одном из кустов что-то зашевелилось, и на свет показались два прижатых уха и пара желтых глаз. Юля тоже заметила меня и помахала рукой.
# "Спрячься, балда! Заметят же!"
# Сл: - Семён?
# Я вздрогнул.
# - Что?
# Сл: - Что там такое? Ты так в эти кусты уставился…
# - А? Нет, ничего.
# Я лишь на секунду отвел взгляд - а в кустах уже никого не было. Судя по недоумевающему взору Слави, она тоже никого не увидела.
# "Она и впрямь умеет прятаться."

##концерт начинается 
## звуковой эффект - свист микрофона 
# Ми: - Привет, Совёнок!
# Пронзительный голос ведущей, да еще и усиленный динамиками, заставил всех зрителей перестать заниматься ерундой и обратить внимание на сцену.
# Ми: - Я так рада видеть вас всех здесь! То есть, мы все рады, и надеемся, что наши выступления вам понравятся.
# Ми: - Вы знаете, когда я только приехала сюда, я не знала, удастся ли мне подружиться со всеми вами, я была совершенно чужой, в незнакомом месте, с незнакомыми людьми… Но оказалось, что эти незнакомцы - добрые и открытые люди, да-да, все вы! Я очень рада, что смогла подружиться с вами!
# Ми: - Ой, вы наверное, уже устали от моей болтовни, да? Всё-всё, я больше не буду, я лучше для вас спою! Вы готовы?
# Эта непродолжительная речь вызвала громкие аплодисменты и ободряющие крики с мест. 
# "Её тут тоже все любят, хоть и сторонятся немного."
# Неожиданно для себя я тоже присоединился к аплодисментам. 

##музыку
# Она что-то нажала на пульте, заиграла музыка - и Мику прямо-таки выпрыгнула на центр сцены, как освобожденная пружина.
# Она порхала по сцене, едва касаясь пола, и при этом умудрялась еще и петь в микрофон - что-то на японском, смутно знакомое, но настолько быстрое, что было невозможно разобрать ничего, кроме отдельных слогов.

## сюда надо песенку с подходящим смыслом. 2Dimension Dream Fever, например. Или Thousand Sakura Leaves.
# Сл: - Семён, а ты не знаешь, о чем она поёт?
# "Да тут бы и японист с двадцатилетним стажем не справился бы! Что уж говорить обо мне, все знание японского сводится к ходовым фразам из аниме?!"
# Ш: "Не кипеши. Песня-то знакомая."
# "Да?"
# Ш: "Именно. Ты, помнится, ею так проникся, что чуть ли не наизусть выучил."
# "Что ты несёшь? Не было такого!"
# Ш: "Ну как это не было? У меня админский доступ ко всей твоей памяти!"
# Ш: "Произведи впечатление на девушку, переведи песенку. Я тебе буду подсказывать, а ты адаптируй."

##здесь приделываем эффект субтитров - вверху на японском, внизу на английском, а Семён на ходу переводит, как умеет



# Славя в полнейшем изумлении смотрела на меня.
# Сл: - Семён… Ты знаешь японский?!
# - Эээ… нет. Я просто знаю эту песню.
# Сл: - Правда? А откуда?
# "И вправду. Откуда, а?"
# Ш: "Да говорю же. Ты её наизусть выучил."
# "Не было такого. Не-бы-ло!"
# Ш: "Ну, значит, это был не ты."
# С этими словами ощущение присутствия куда-то пропало.
# "Нагнал туману и ушел. Скотина."
# - Не помню уже. Просто знаю.
## озадаченная Славя

# На сцене тем временем продолжалось шоу. Нашу японскую звезду сменил хор мальчиков-зайчиков, за ними - танцоры, потом - акробатический этюд-пирамида… Недостаток умения с лихвой перекрывался старательностью, и зрители одаривали артистов овациями, не жалея ладоней.
# Я бы тоже, наверное, похлопал, но…

##милая улыбающаяся Славя. Или цг как сидим в обнимку. Что-то подобное было в Славя-руте

# Славя. Я не успел заметить, в какой момент она оказалась так близко ко мне. Настолько близко, что еще немного - и мы диффундируем друг в друга, слившись в сиамских близнецов. Ее голова совершенно естественным образом разместилась на моем плече, и от душистого запаха ее волос сознание шло кругом. 
# Что там происходит на сцене - какая разница? Все моё внимание было поглощено тем, что в сантиметре от моих губ - нежная кожа виска, с едва заметно пульсирующей жилкой. Наверное это феромоны всему виной - все мое существо тянулось преодолеть эту пустоту, разделяющую нас, обрывки мыслей складывались в одно громадное железобетонное "ХОЧУ!"... Противостоять этому не хватало не то что воли - мотивации.

# Мою капитуляцию приняли благосклонно - вздох, в котором явственно ощущается легкий смешок, едва заметная улыбка… Славя слегка поерзала, устраиваясь поудобнее на моем плече. Пользуясь моментом, я с деланной непринужденностью - всего лишь потягиваюсь, о чем вы?! - отправил свою руку в разведывательный рейд. Спина, талия, бедро...
# Вторжение было мгновенно обнаружено - Славина ладонь накрыла и прижала мою, пресекая дальнейшее движение. "Здесь можно, дальше - ни-ни!". Понял.

# На сцене тем временем появился какой-то тип неопределенного возраста - от пятнадцати до… не знаю, сорока, наверное. Он очень сосредоточенно устраивался на стуле из столовой - сядет, повертит головой, встанет, передвинет на пару сантиметров, снова сядет… Среди зрителей раздались смешки, но не было похоже, что ему есть какое-то дело. 
# - Славя, а кто это?
# Сл: - Это? Анатолий. Толя. Он из четвёртого отряда.
# - Из четвёртого? Там же… 
# Сл: - Да, ему с младшими лучше. Они его любят, и вожатым проще… Он вообще очень старательный, на самом деле. 
# - Я-а-асно-о-о… 
# Анатолий тем временем нашёл-таки идеальное положение стула, сел и торжественно водрузил на колени потертую балалайку. Я приготовился к худшему… 

## соло на балалайке сюда

# На удивление, всё оказалось совсем не так плохо. Даже хорошо! Анатолий вполне профессионально исполнил "Камаринскую", потом небольшой отрывок из "Полёта шмеля" , выдал немного импровизации, и… 
# "Ага, Яблочко. Сейчас ещё пойдёт вприсядку и споёт про \"подходи, буржуй, глазик выколю\". А Ольга-свет-Дмитриевна от сего перфомансу изволит лишиться чувств-с."
# Разумеется, ничего подобного не произошло. С последним аккордом музыкант встал, поклонился. 
# tl_7dl "А Ф И Ф О\ \ \ Ф А\ \ \ Ф Н И М А И Е."
# И ушёл за кулисы - с балалайкой в одной руке и стулом в другой. Под заслуженные аплодисменты, разумеется, но непохоже, чтобы они его сколько-нибудь интересовали. 
# - Во даёт! 
# Сл: - Да, и вправду. Я и не подозревала, что у него такой талант. 
# Она поежилась от внезапно налетевшего ветра, и вернула на место руку, которую я освободил для аплодисментов. 
# Сл: - Холодно что-то стало. Погрей меня. 
# - И вправду. Как бы дождь не начался… 
# Сл: - Нет уж, никакого дождя! Ты ведь не хочешь моё выступление пропустить? 
# - А ты тоже выступаешь? А с чем? 
# Сл: - А это сюрприз! Наберись терпения, и постарайся, чтобы не было дождя. 
# - Хорошо. Ради этого я согласен даже с дождём договариваться! 
# Удовлетворившись этим обещанием, Славя снова заняла свое место на моём плече. А я старательно работал грелкой - да, задача как раз по мне! Тем более, что такой близкий контакт поневоле заставлял сердце гнать кровь по телу всё быстрее… 

# Мне в бок ткнулся какой-то предмет. 
# ОД: - Поклюйте, голубки. 
## ржущая ОД
# - Мы… мы не! 
# ОД: - Ага, оно и видно, как вы не. Берите, это вам вместо полдника. 
# Когда это она успела сходить за припасами и раздать всем - я пропустил. Занят был. В свертке обнаружились две сдобные булочки, которые мы по-братски разделили со Славей. 
# "Главное, чтобы Юля себя не выдала. А то тут булки едят, и без неё… Безобразие! Такое терпеть нельзя, да."
## шуршит кустами
# Кажется, я слышал… 

# Сл: - Семён, что-то случилось? Ты как-то… напрягся. 
# Она обеспокоенно смотрела на меня, и мне пришлось оторваться от сканирования окрестных кустов в поисках ушастой особы. 
# - Нет, ничего. Ерунда. 
# - Кстати, смотри, тучи разошлись!
# Я поспешил сменить тему разговора. 
## удивленная Славя
# Сл: - И вправду… 
# - Теперь уж точно твоё выступление не пропущу. А когда оно, кстати? 
# Сл: - Кто… А, в самом конце. 
# Она стряхнула с себя непонятную растерянность и чарующе улыбнулась. 
# Сл: - Дождешься? 
# - Непременно! Сколько бы ни пришлось ждать! 
# Сл: - На самом деле уже скоро - сейчас Двачевская споёт, и мой выход. 
# Она поднялась, оправила юбку. 
# Сл: - Пойду наряжаться. А ты - жди! Как обещал. 
# Шутливо погрозила пальцем и убежала, мелькая стройными икрами в белых гольфах. А я - остался ждать, как приказано. 

# Ш: "Ты попал, чувак. Влип." 
# "Я-то?! Нет. Да. Наверное. Не знаю."
# Ш: "Влип, влип. Верь мне." 
# Ну влип так влип. Подумаешь, дело-то житейское… Было бы о чём голову ломать. Лучше вон Алису послушаю. 

# Алиса, против обыкновения, не стала устраивать никаких дебошей и провокаций - ну правда, не считать же за хулиганство её сценический наряд? Она в нём каждый день ходит, в этой подвязанной рубашке и с галстуком на запястье! И то, что она пренебрегла стулом и уселась прямо на край сцены, свесив ноги в первый ряд - ну право, что за мелочи! Все равно мужское население партера старательно отводит глаза, не рискуя даже бросить взгляд в манящую темноту под форменной юбкой - заметит, зарядит микрофонной стойкой прямо промеж глаз! 
# Да и репертуар оказался относительно нейтрален. Пара неожиданно лиричных песен авторства Янки, ещё что-то, смутно знакомое… Когда она встала и убежала со сцены, показав всем напоследок "козу", Ольга Дмитриевна наконец-то облегченно выдохнула. 
# ОД: - Ну хоть тут ничего не учудила… Хотя талант у неё, конечно, есть. Согласен, Семён? 

# - А?! 
# - А, ну да. Талант. Несомненный. Есть. 

# Ольга со вздохом махнула рукой. 
# Од: - Понятно всё с тобой. Какие вы смешные становитесь всегда… 
# Од: - Может, хоть у Слави получится из тебя человека вылепить. Мне это явно не под силу. 
# Ш: "Слышал? Тебя официально признали не поддающимся дрессировке."
# "Не поддающимся традиционным методам. Что характерно, никто не пытался действовать лаской." 
# "Так что у Слави действительно есть шансы на успех. "
# Ш:" Как низко ты пал, чувак."

# От спора с внутренним голосом меня отвлекла внезапно установившаяся тишина. Все разговоры внезапно смолкли, и даже, кажется дышать все стараются через раз. 
# Славя. В расшитом сарафане, красных сапожках… И с кокошником на голове. Русская красавица, прямиком из сказок! 
# Ш: "Вот только за подол такой длины ей бы повыдергивали обе косы… А так, конечно, весьма и весьма есть на что посмотреть!" 

# Выйдя к краю сцены, она развела руки в стороны, будто стараясь обнять всех, сидящих перед ней, и, выдержав паузу, запела. Без музыки, и уж тем более без фонограммы.
# Сл: - Ой да девица краса, полюбила-полюбила парня-молодца… 

## ЦГ, если найдём, фоновая музыка, принудительная пауза секунд на 5
#… 

# Из транса меня вывел гром аплодисментов. Спохватившись, я тоже принялся с жаром отбивать ладони и, не удержавшись, засвистел. Славя, которая раскланивалась на краю сцены, с улыбкой послала мне - да, именно мне! - воздушный поцелуй. 
# "Вот это да! Это было что-то… с чем-то. Кто бы мог подумать?"
# Ш: "Ведьма, что с неё взять. Но откаблучивала знатно, не хуже цирковой лошади!" 
# Я не обратил внимания на попытки внутреннего циника испортить волшебство. Пусть себе ворчит. А я постараюсь потверже запечатлеть этот образ в памяти… 

# На сцену вышла Ольга - я с удивлением обнаружил её отсутствие рядом. Когда это она успела уйти? 
# ОД: - Дорогие ребята! Я надеюсь, вам понравился наш концерт? Тогда давайте ещё раз громко крикнем нашим артистам - молодцы! 

# Всё, и я в том числе, радостно заорали
# - Мо-лод-цы-ы-ы! 

# ОД: - Огромное им спасибо! И спасибо всем вам за поддержку! 

# ОД: - На этом отчетный концерт объявляется закрытым. Ждём всех на вечерней дискотеке! 

# С неизбежным шумом и гомоном пионеры начали расходиться. Я тоже стал пробираться к сцене. К Славе, поздравить с выступлением. 
# "Знал бы - цветов надергал, ромашек там или васильков каких… "
# Артистка обнаружилась за сценой, уже переодевшаяся в обычную форму. 
# - Славя! Вот ты где. 

# Сл: - Семён! Тебе понравилось? 
# - Очень. Просто слов нет! Я и не думал, что у тебя такие разнообразные таланты. Просто кладезь! Комсомолка, спортсменка, артистка и просто красавица… 

# Я заливался соловьём, Славя с улыбкой внимала… Идиллию, как всегда, нарушила вожатая. 
# ОД: - Воркуете, голубки? 
# "Да сколько можно уже?! Виола меня иначе как пионером не зовёт, теперь Ольга со своими голубками… Да, воркуем, и что?!" 
# ОД: - А я вам работы припасла. Надо аппаратуру на площадь перетащить, и там всё организовать. Справитесь? 
## расстроенная Славя 
# Славя как-то замялась, наверное, разрываясь между долгом и желанием провести время со мной, и я поспешил избавить её от от мук выбора. 
# - Справимся, конечно. Я помогу. 
# ОД: - Ну и ну, Семён! Это так на тебя непохоже… 
##ржущая ОД

# Таскать громоздкие бандуры, конечно, не самое интересное занятие, но… Славя же! Нельзя ударить в грязь лицом! Я подволок динамик к краю сцены, примерился, как я буду его взваливать на спину… 
##взволнованная Славя
# Сл: - Надорвешься! Осторожнее! 
# - Кто, я? Да ни в жисть! Я и не такое... 
# ИииЭэээх! 
# Под весом, навалившимся на меня, я непроизвольно присел, 
# "Вот это я понимаю, тяжёлая музыка!" 
# с усилием выпрямился и побрёл по дорожке.
# Сл: - Семён, тебе правда не тяжело? Давай помогу! 
# - Нет… Нормально… Донесу… Ты лучше дорогу подсказывай, а то я только то, что под ногами вижу. 
## площадь 
# Спустя пару вечностей я скинул осточертевший ящик рядом с Гендой, где кибернетики уже колдовали с проводами, под руководством Мику. 
# - Вот! Забирайте этот гроб! А я сейчас отдохну и пойду за вторым… Хотя почему это я один должен их таскать, пока вы тут прохлаждаетесь?! 
# Электроник с Шуриком переглянулись, а Мику залилась смехом. 
# Ми:- Ой, Сенечка! Ты его на себе сюда тащил? Там снизу колесики выдвигаются, чтобы их катать, тебе никто не сказал? Мы их так на сцену принесли, иначе как бы мы справились, они же тяжёлые, но ты, оказывается, такой сильный, Сенечка! 
# "Тьфу ты!" 
# Я вопросительно посмотрел на Славю - ты тоже знала? Ответом мне было лишь пожатие плечами - не знала, или знала, но решила не говорить… 
# Ш: "Зато продемонстрировал, насколько ты могуч. Тоже в копилку идёт." 

# С колёсами оно, конечно, проще. Толкай себе и толкай, следи только, чтоб на какой-нибудь кочке не опрокинуться. Хоть и медленнее. А куда торопиться? 
# Ящик неспешно тарахтел, подпрыгивая на стыках плит, можно было спокойно поговорить. Только вот о чём? 
# "Мда, неловкие паузы - моя стихия. Надо что-то придумать… Ну не знаю, спросить про планы на послелагеря." 
# Сл: - Что планируешь делать после лагеря? 
# Я, уже успевший открыть рот, чтобы задать тот же вопрос, был подбит на взлёте. 
# - Эээ… Да я, на самом деле… Не знаю. Короче, у меня пока не определено ничего. Таинственно и туманно. 
# - А ты? 

# Сл: - Я? 
# Она почему-то замялась. Странно, я думал, у неё уже все спланировано на несколько лет вперёд. Поступить в педагогический, или в ветеринарный, или ещё куда, где сможет пользу приносить… 
# Сл: - Не знаю. Были какие-то планы, но… Сейчас это уже не важно. 
# - Уже? А что случилось?
# "У неё что-то произошло?" 
# Она замотала головой. 
# Сл: - Нет, ничего. Всё так, как и должно быть, просто… Приоритеты поменялись, скажем так. 
# Сл: - Да и вообще, не хочу сейчас все это обдумывать. Пусть будет, как будто лагерь - это отдельная вселенная, и кроме него ничего нет. 
# - Что происходит в Вегасе, остаётся в Вегасе… 
# Пробормотал я под нос. 
# Сл: - Что? 
# - Не имею ничего против. В каком-то смысле так оно и есть. 
# "Уж для меня-то точно."

# Я ускорился на последнем десятке метров, эффектно припарковал свой тарантас симметрично с первым и вытер пот со лба. 
# - Забирайте! Дальше сами справитесь? 
# Ш: - Справимся, конечно. Спасибо! 
# Ми: - Огромное спасибо, Сенечка, что бы мы без тебя делали! Мы тут уже сами все сделаем, ты иди, там в столовой ужин, ты ведь ещё не кушал? А потом приходи на танцы, ты ведь придёшь? Вы ведь оба придёте, да? Я специально для вас какую-нибудь хорошую песню включу, тебе какая нравится, у меня много всего… 
# "Ну всё, началось. Мику вышла на форсаж… Пора линять!"
# - Пойдём-ка мы и вправду перекусим. А то съедят всё! Пока, до встречи! 

# Мы поспешно ретировались. Отойдя на безопасное расстояние, я скорчил измученную рожу. 
# - Уф. Еле ушли! 
##смеющаяся Славя
# - Так, где там обещанный ужин? Я готов даже слона съесть. Живого. Целиком! 

    jump alt_day6_uvao_dinner_with_sl

label alt_day6_uvao_dinner_with_sl:
    window hide
    $ persistent.sprite_time = "sunset"
    $ sunset_time()
    scene bg int_dining_hall_people_day with fade
    play music music_list["so_good_to_be_careless"] fadein 4
    play ambience ambience_dining_hall_full fadein 4
    window show
    "Славя, сидевшая в опустевшей столовой, хоть и улыбалась, но выглядела слегка недовольной. На столе два полных подноса. Видно не ела ещё, меня ждала. Блин, не хватало мне ещё всё завалить в последний момент!"
    show sl normal pioneer with dissolve
    me "Славь, прости-прости!"
    "С ходу начал я и лёгкая тень недовольства покинула чистый лик девочки."
    me "Виноват, оправдаю, исправлюсь. Просто мне интересно было на диджейский пульт Мику посмотреть."
    sl "Ладно, ешь садись."
    show sl normal pioneer close with dissolve
    "Я не заставил себя упрашивать. С того момента, когда вожатая приносила булочки на концерт, прошло уже порядочно времени и я был голоден как волк."
    sl "Чего это тебя так пульт заинтересовал? Готовишься стать профессиональным музыкантом?"
    me "Да не то, чтобы. Просто всякими техническими новинками интересуюсь."
    "Ответил я, умолчав, что этой «технической новинке» в моём времени самое место в музее."    
    window hide
    scene bg int_dining_hall_sunset with fade
    window show
    "Наскоро разделавшись с ужином, мы поспешили на площадь, где уже всё было готово к дрыгоножеству и рукомашеству."
    window hide
    scene bg ext_square_night_party with fade
    window show
    "Мику в наушниках священнодействовала за пультом. Вожатая вещала в микрофон что-то о прощальном вечере."
    "Мы со Славей подошли к ней. Ольга отложила микрофон в сторону."
    show mt normal dress at cleft
    show sl normal pioneer at cright
    with dissolve
    mt "Пришли наконец. Развлекайтесь, ребята, сегодня прощальная дискотека. Повеселитесь как следует. Пусть эта смена запомнится вам."
    dreamgirl "Да уж запомнится, как без этого. Одна Юлечка чего стоит"
    th "Вот не надо сейчас о ней. У меня Славя вообще-то есть. И, судя по всему, у нас дело на мази."
    dreamgirl "А ты и хвост распустил. Посмотрим, как ты это дело провернёшь."
    th "Ты будешь первым, кто узнает – как именно."
    sl "Сём, пойдём прогуляемся."
    "Славя схватила меня за руку и повела в сторону от светящихся гирляндами деревьев и постепенно затихающей музыки."
    "Нетерпеливая девочка, всё время ускоряя шаг, буквально вихрем потащила меня за собой."
    window hide
    $ persistent.sprite_time = "night"
    $ night_time()
    scene ext_houses_night with fade
    show sl normal pioneer at cleft with dissolve
    window show
    extend " Мы почти бегом прошагали мимо всех домиков"
    window hide
    scene bg ext_clubs_night with fade
    show sl normal pioneer at cleft with dissolve
    window show
    extend ", позади остались Клубы"
    window hide
    play ambience ambience_camp_center_night fadein 2
    scene bg ext_no_bus_night with fade
    show sl normal pioneer at cleft with dissolve
    window show
    extend " и, наконец, показались ворота лагеря."
    me "Эй-эй! А нам обязательно было так бежать?"
    "Осведомился я, переводя дыхание и прислоняясь к статуе пионера."
    show sl smile pioneer at center with dspr
    sl "Да в общем-то нет."
    "Улыбнулась Славя."
    show sl laugh pioneer at center with dspr
    sl "Я просто не хотела, чтобы ты передумал. А то кто тебя знает – взял бы и остался. А девочек много вокруг красивых – уведут ещё. Или всё же хотел потанцевать?"
    me "Да не собирался я. Разве что исключительно с тобой."
    show sl smile2 pioneer at center with dspr
    "Славя молча и слегка задумчиво улыбнулась в ответ на мой комплимент. Казалось она о чём-то напряжённо размышляет. Я тоже не знал, как продолжить разговор и стоял молча."
    th "Спасите меня кто-нибудь из этой дурацкой ситуации. Ведь я сейчас всё испорчу. Славя просто обидится и уйдёт! А я за столько лет своего затворничества совершенно забыл, как надо общаться с девушками по настоящему."
    "И тут в разговор вмешалась Шиза."
    dreamgirl "Ну и чего ты застыл, как истукан? Давай, решайся уже на что-нибудь! Понятно ведь, что девочка ждёт от тебя решительных действий. Кто мужчина здесь, в конце концов? Обними, поцелуй её. Эх, будь у меня физическое тело!"
    "Этот призыв подействовал на меня, как удар электрическим током. Я отбросил все сомнения, подошёл к Славе, обнял её и попытался поцеловать…"
    with vpunch
    show sl serious pioneer close at center with dissolve
    "Вечер внезапно перестал быть томным.{w} Щёку обожгло, а в голове зазвенело. Я отшатнулся и, чтобы не упасть, был вынужден опереться на ближайшее дерево. Я помотал головой - в глазах всё ещё плясали разноцветные звёздочки."
    sl "Дурак! Я тебя не за этим сюда позвала!"
    th "Сама дура! А зачем же тогда, чёрт побери?!" 
    "Славя виновато смотрела на меня."
    show sl normal pioneer close at center with dspr
    sl "Слушай, Сём, тебе очень больно? Ты извини, у меня рефлекс сработал."
    me "Славь, если я слишком спешу, ты могла бы просто сказать об этом, без рукоприкладства."
    "Потирая щёку, мрачно ответил я."
    show sl smile2 pioneer close at center with dspr
    sl "Извини. Я в самом деле не ожидала, что ты так решительно в бой ринешься."
    "Славя силилась улыбнуться. Несмотря на весь драматизм ситуации, я не мог не улыбнуться в ответ. Правда улыбка вышла довольно кривенькой. Ну а я-то – набросился на девочку, как сексуальный маньяк какой. Она ведь явно шокирована моим поведением. Тихоня тихоней, а тут на тебе."
    dreamgirl "Да, брат. Чего-то мы тут с тобой не додумали."
    "Почесала в затылке Шиза."
    th "Не мы, а ты."
    dreamgirl "Да маньяк-то ты, а не я. У меня вот и тела даже нет. А из тебя и маньяк так себе - нифига не сексуальный. А какой напор, какая грация. Кстати можно ещё раз попробовать – а ну как повезёт? Вот будешь знать в другой раз, как девок обжимать по углам."
    th "Что? Да кто меня подстрекал-то?…"
    dreamgirl "А ты меня слушай больше. Кстати, можешь утешиться тем, что легко отделался. А то знаешь, какие случаи бывают…"
    th "Да не отделался ещё… И как мне теперь вести себя со Славей?"
    "Девочка, похоже, взяла себя в руки и теперь полностью контролировала ситуацию. Ну или почти."
    show sl normal pioneer close at center with dspr
    sl "Семён. На самом деле, мне нужно было поговорить с тобой наедине. Подальше от чужих ушей."
    "Её сухой деловой тон настолько контрастировал с недавним поведением, что я растерялся."
    me "Что? Просто поговорить?…"
    sl "Да, поговорить. Нам нужно обсудить очень важные вещи."
    me "Да, это я уже слышал. Но я подумал…"
    sl "Прости меня, если я ненамеренно ввела тебя в заблуждение, относительно моего к тебе отношения. Мне было приятно твоё внимание, не скрою. Но мой интерес к тебе сугубо профессиональный. Ну почти."
    "Всё же подсластила пилюлю."
    "Моё разочарование казалось можно было ощутить физически. Вот тебе и Очень Важный Разговор."
    me "Профессиональный интерес? Это в какой же области? Может быть ты психолог? Изучаешь редкие виды Семёнов?"
    sl "Семён, ты не обижайся только. Сначала я и правда хотела просто получить от тебя информацию. Она очень важная, в том числе и для меня лично; и касается твоего будущего тоже. Но потом…"
    show sl smile2 pioneer close at center with dspr
    "Тут она улыбнулась."
    sl "Ты стал мне и самом деле симпатичен. Так что, если у нас в дальнейшем всё сложится хорошо, то мы можем попробовать."
    me "Что попробовать?"
    "Славя кивнула головой."
    sl "Что-нибудь ещё."
    "Я усмехнулся. Вместо синицы в непосредственной близости, мне предлагают журавля в долгосрочной перспективе. Да ещё и с какими-то намёками таинственными. Ну что же, выбора у меня похоже особого и нет…"
    "Что меня ждёт после окончания этой волшебной, загадочной, мистической смены? Я просто испарюсь из автобуса? Или даже из кровати? А потом проснусь у себя дома? А может и вообще нигде не проснусь. Рассыплюсь на атомы и буду вечно летать над нашей голубой планетой, создавая помехи в эфире."
    "А здесь Славя, судя по всему, владеет какой-то информацией. Готова обменяться ей, взамен на… не знаю что. Да и что я такого знаю, в самом деле? Вряд ли ей пригодится знание того, что я помню имена всех пилотов Евангелиона, или как набрать секретный код Конами с закрытыми глазами."
    "Хотя я лукавлю, конечно. На правах пришельца из будущего, я могу рассказать много интересного о своём мире миру этому. Но что об этом может знать Славя? А самое интересное – откуда? Надо проявить осторожность."
    stop music fadeout 4
    dreamgirl "Да-да, брат, ты поосторожнее. А то сдадут тебя на опыты и будешь до конца своих дней сидеть в белой комнате, сдавать анализы и решать тесты на сообразительность."
    me "Ладно, я так понимаю, дальнейшая беседа пойдёт не о делах амурных."
    show sl normal pioneer close at center with dspr
    play music music_list["just_think"] fadein 4
    sl "Точно. Не знаю даже с чего начать…"
    "Замялась девочка."
    me "Начни сначала."
    "Поощрил я её."
    sl "Ну что же… Слушай тогда."
    "Славя начала свой рассказ и чем больше она рассказывала, тем больше я офигевал."
    sl "Я расскажу тебе краткую предысторию, чтобы ты лучше понял мою мысль."
    sl "Благодаря многолетним исследованиям советских и зарубежных учёных, такое понятие как «параллельные вселенные» стало уже практически доказанным фактом."
    sl "Разумеется, все подобные данные держатся в строжайшей секретности. Но утечки всё же случаются, из-за всяких непредвиденных обстоятельств. Например, появление людей, утверждающих, что они прибыли из другого мира, разговаривающих на незнакомом языке, одетых в странную одежду."
    sl "Думаю, ты наверняка слышал, или читал что-то подобное."
    sl "Притом, хоть и ведут они себя странно, они совершенно нормальны, с точки зрения психиатрии. Просто они и самом деле пришельцы из другого мира. Вот как ты, например."
    me "Славь, ты бы сейчас видела себя со стороны… Что ты несёшь?"
    sl "Спокойно, я уже подхожу к сути. Так вот, к нашей ситуации эта теория о параллельных мирах не имеет никакого отношения. Правда в том, что этого мира на самом деле не существует. Вернее он существует, но только благодаря тебе."
    sl "Реален только твой мир. Этот же мир существует, пока ты проецируешь его в своей голове. Здесь всё выдуманное. Тобой."
    sl "Это даже не полноценный мир, а вырванный кусок реальности на отдельно взятом отрезке пространства-времени. Этот лагерь, пионеры. Всё это ненастоящее. За пределами лагеря не существует ничего. Кажется ты уже пробовал убежать отсюда в первый день." # К какому момету эта отсылка?
    if alt_day2_us_escape:
        sl "А потом ещё предпринял вторую попытку вместе с Ульяной, поездом."
        th "Или она со мной."
        sl "Хоть в этот раз ты готовился лучше, это тебе не сильно помогло."
        "От её тона я помаленьку начинал закипать."
    else:
        sl "Ну как, получилось у тебя?"
        me "Откуда…"
    me "Откуда ты знаешь?!"
    sl "Неважно. Ты находишься в выдуманном тобой иллюзорном мире. А для твоего подсознания он параллельный. Возможно ты на подсознательном уровне захотел что-то изменить. Я не знаю, что послужило этому причиной."
    sl "Возможно сильное эмоциональное потрясение, потеря близкого человека, простая неудовлетворённость текущей жизненной ситуацией."
    sl "Но желание создать свой собственный мир со своими правилами было очень велико и вот ты здесь. Идеальный мир, идеальный лагерь, идеальные пионеры… {w}и пионерки."
    "Тут она сорвалась на крик."
    show sl scared pioneer close at center with dspr
    sl "Ты всё это придумал! И меня тоже!"
    "Она закрыла лицо руками и заплакала. Я в смятении смотрел на неё, не зная, как реагировать на это заявление."
    me "Да кто я по твоему – Господь Бог?!"
    dreamgirl "Падите ниц, жалкие черви! Иначе величие Семёна Всемогущего испепелит вас!"
    sl "Я не знаю, кто ты такой. Я не знаю, кто я такая."
    "Всхлипывая, ответила девочка."
    sl "Но я знаю, что как только ты исчезнешь отсюда, то исчезну и я тоже."
    "Да, такую забористую информацию не так-то просто уложить в моём невеликом умишке."
    me "Послушай, Славя."
    "Медленно начал я."
    me "Прежде всего – с чего ты это всё взяла? Откуда такая информация? Что за бред? Кошмар приснился? Книжек фантастических начиталась?"
    "Девочка немного успокоилась."
    sl "Нет, так получилось, что я случайно подслушала разговор осведомлённых людей. Я не буду их называть, это неважно. Но там много интересного было. О тебе очень много."
    me "Чего? Обо мне? А кому какое до меня может быть дело?!"
    sl "А ты думал, никто ничего не заметил?"
    "Славя прищурилась."
    sl "Твою одежду не по сезону, твои вещи, твоё поведение."
    sl "Если ты так думаешь, то очень сильно ошибаешься."
    sl "Но вообще, просто не забивай себе голову проблемами мира иллюзорного. Подумай лучше о мире настоящем. О том, что тебе пора бы уже вернуться в него."
    "Тут она бросилась ко мне и крепко обняла."
    sl "И забери меня с собой, пожалуйста!"
    "Да, Славя явно знает, о чём говорит. И отпираться мне уже теперь, судя по всему… бессмысленно? Да, именно так – бессмысленно. В принципе, я уже ожидал чего-то подобного. Особенно после такой эмоциональной сцены."
    me "Да куда я тебя заберу-то?"
    "Пробормотал я, тщетно делая попытки высвободиться."
    dreamgirl "Сомневаешься? И правильно делаешь. Я для неё никакой перспективы здесь не вижу. Бредовая теория и бредовая попытка. Не заберёшь ты её с собой, даже если очень захочешь."
    sl "С собой забери меня, в свой мир.{w} Выпусти меня{w=.4} в РЕАЛЬНОСТЬ."
    "Ответила Славя, умоляюще глядя мне прямо в глаза."
    "Её лицо было очень близко от моего. Чувственные губы манили взгляд."
    "Не, ну это уже запрещённый приём! Я отвёл глаза в сторону, чтобы немного успокоить некоторые реакции моего организма. Помогло правда не очень."
    me "Ну допустим, я бы захотел вернуться. Что мне для этого нужно сделать?"
    sl "А вот это как раз очень просто. Нужно просто захотеть вернуться. Очень сильно захотеть."
    me "А ты как со мной сможешь уйти?"
    sl "Тебе нужно думать и обо мне тоже. Тогда мы вернёмся вместе."
    me "Славя, ты понимаешь, что ты очень сильно рискуешь? Не говоря уже о полной бредовости этой затеи, ты ведь оставляешь всё, что тебе близко и знакомо. Если, ЕСЛИ всё получится – то что ты будешь делать в моём мире?"
    sl "Сейчас главное, чтобы ты вытащил нас отсюда. И как можно скорее. Я не знаю, что произойдёт после окончания этого дня. Скорее всего я просто исчезну. А я не хочу! Я хочу жить!"
    "В принципе, вернуться домой было бы неплохой идеей. Я чувствовал, что слегка подустал от этой чересчур идеальной пионерской романтики. Хотелось вернуться в свою знакомую берлогу, за свой компьютер, к своим, хоть и монотонным, но таким спокойным дням."
    "Это был неплохой отпуск, но видно пришло время сдавать ключи от номера. И кажется вернусь я домой не только с новыми силами и отдохнувший, но и с приятным бонусом. В виде Слави."
    dreamgirl "В багаж сдашь, или ручной кладью провезём?"
    th "Голубиной почтой. Не мешай, я думаю."
    dreamgirl "А, ну думай, думай. Мыслитель."
    "Славя продолжала с надеждой смотреть на меня."
    play sound sfx_bush_leaves
    show sl scared pioneer close at cleft 
    show uv rage at cright behind sl
    with dissolve
    "Внезапно сзади затрещали кусты и на нас выскочила взъерошенная Юля!"
    hide sl with dissolve
    "Славя мгновенье смотрела на неё, открыв рот, а потом взвизгнула и спряталась за меня."
    uv "Семён, не верь ей! Она всё неправильно говорит. Лагерь настоящий. И люди настоящие. И я тоже настоящая!"
    sl "Сёма, кто это?"
    "Опасливо спросила Славя, выглядывая у меня из за спины."
    me "Ну… это Юля."
    "Не придумал ничего более умного я."
    sl "Ты её знаешь? О чём она говорит?"
    me "Ну можно сказать, что знаю. И похоже она не согласна с тобой насчёт того, что этот мир ненастоящий. Для неё он самый что ни на есть настоящий."
    uv "Конечно настоящий! Я ведь здесь живу, значит он точно настоящий."
    "Безупречная логика."
    me "Значит ты всё слышала. И почему ты так уверена в том, что тут всё взаправду? Вдруг я и тебя выдумал тоже?"
    show uv upset at cright behind sl with dspr
    "Юля насупилась."
    uv "Никто меня не выдумывал. Я всегда здесь была. Я точно знаю. И вот эта –"
    "Она показала пальцем на Славю."
    uv "- ошибается. Лагерь всегда есть. Даже когда тебя не было, он всё равное был."
    "Славя наконец отважилась выйти из за меня."
    show sl serious pioneer close at cleft with dissolve
    #?????
    # СРАЧ СРАЧ СРАЧ. Оп, и познакомились. Если честно я чёт поржал, но кмк надо чутка переделать -R
    sl "Во первых, я не «эта». Меня зовут Славяна. Но все зовут меня Славя. И ты тоже зови."
    uv "Ладно. Я Юля."
    sl "Что ты знаешь о лагере?"
    uv "Знаю, что лагерь всегда есть. И когда тепло и людей много. И когда холодно и всё белое, а людей нету. Я тогда сплю много."
    uv "А за лагерем нету ничего. Никто не приходит в него и никто не уходит из него. Люди просто появляются и исчезают. И это всегда повторяется. Но они не помнят ничего."
    "Славя задумалась."
    sl "Да, я смутно помню свою жизнь вне этого лагеря. И это очень странно."
    sl "Но кто же ты? Почему ты всё помнишь? Ты тоже из другого мира?"
    uv "Я не знаю. Я всегда тут была. Люди боятся меня, когда я показываюсь. Кричат. Убегают."
    uv "Иногда приходят такие как Семён. Они другие. Они могут помнить. Они не боятся. Я таких во сне иногда вижу, перед тем, как они появляются."
    window hide
    scene bg ext_camp_entrance_night 
    show owl :
        pos (931, 88)
    show uvao_d1 at left
    show prologue_dream 
    with fade3
    $ renpy.pause(2, hard=True)
    scene bg ext_no_bus_night with fade
    show uv upset at cright behind sl
    show sl serious pioneer close at cleft
    with dissolve
    window show
    "И тут я снова вспомнил своё видение: девочка, задающая такой простой и одновременно такой сложный вопрос – «ты пойдёшь со мной?» Все кусочки мозаики наконец сложились в единую картину. Я дал своё согласие и Юля перебросила меня в этот лагерь. Как и зачем – совершенно непонятно."
    "Славя отвела меня в сторону."
    show sl serious pioneer close at center
    show uv upset far at cright behind sl
    with dissolve
    sl "Семён, нам нужно каким-то образом поймать эту… это существо и заставить её вернуть нас в реальный мир."
    "Очень тихо прошептала она."
    sl "Я уверена, что она каким-то образом связана с этими перемещениями."
    "Юля обладала очень тонким слухом."
    uv "Не советую. Я кусаться могу. И царапаться. Ты уже пробовала один раз. Ещё хочешь?"
    sl "Что?! Я пробовала поймать тебя?"
    uv "Пробовала. Но ты не помнишь. А я помню. И предупреждаю тебя – будет плохо. Как в прошлый раз."
    "Ну вот и приехали. Все хвосты подобраны, все мосты сожжены, Рубикон перейдён. Назад дороги нет."
    "Что делать-то? Где мой внутренний голос, когда он так нужен?"
    dreamgirl "Да здесь я."
    "Очень спокойно и даже как-то лениво отозвалась Шиза."
    dreamgirl "Что ты хочешь, чтобы я сделал… сделала… сделало? В общем неважно. Чего надо-то тебе, короче?"
    th "Совет нужен, вестимо. Я совершенно запутался и не знаю, что делать."
    dreamgirl "А какой тут совет тебе может быть? Вариантов немного – верить или не верить, третьего не дано."
    menu:
        "К Вожатой" if not alt_uvao_D6_CS_vetrov:
            # TODO: текст и jump
            pass
        "К Виоле" if alt_uvao_D6_CS_vetrov:
            # TODO: текст и jump
            pass
        "Поймать Юлю!":
            pass
    "Славя крепко взяла меня за руку и в который раз уже за сегодня заглянула прямо в глаза. В её взгляде читалось: «Я буду с тобой, чтобы ни случилось, просто дай мне шанс». И вдруг внезапно я ощутил решимость и поддержку, подобной которой не ощущал уже много лет."
    "Наверное с тех самых пор, когда съехал от родителей, в поисках самостоятельности, сразу после окончания школы. Причина конечно была самая банальнейшая - вечная проблема отцов и детей. Надоели постоянные придирки и упрёки. Я просто собрал свои немногочисленные вещи и переехал на съёмную квартиру."
    "Ничего у меня, конечно, не вышло – я ничего не добился и ничего не достиг. У меня не получилось даже окончить институт. Единственный, сомнительный в моём случае, плюс – самостоятельность и независимость. Но, как оказалось, я даже не был способен быть самостоятельным."
    "Были разрушены и разбиты в прах жестокие иллюзии - мир вовсе не готов был восторженно принять Семёна Персунова. Никто не стремился помогать мне адаптироваться. Я не был никому нужен со своими проблемами."
    "Рядом со мной не было никого, кто бы подставил дружеское плечо и протянул руку помощи в трудную минуту. А потом существование такого человека вообще перестало быть критичным."
    "Не сразу, но я научился обходиться без посторонней помощи, а в дальнейшем, и вовсе старательно абстрагироваться от любой попытки влезть в мою жизнь."
    "Но вот теперь, рядом со мной человек, который говорит: «Я тот, кто тебе был нужен все эти годы». Человек, готовый рискнуть разделить со мной все тяготы моего бесцельного существования."
    "Пусть и не совсем бескорыстно. Но ведь альтруизм в чистом виде встречается только в сказках, правда? И как я могу оттолкнуть эту девочку, готовую пойти вместе со мной на сделку с неизвестностью? Готовую рискнуть ради меня самим своим существованием?"
    "И пусть я не знаю, что случится в дальнейшем. Но раз Славя готова рискнуть, то и я тоже. Решено – мы сбежим из этого лагеря вместе. А поможет нам в этом Юля. Хочет она этого, или нет."
    show uv rage at cright
    show sl serious far at fleft
    with dissolve
    "Переглянувшись со Славей, мы начали обходить Юлю с двух сторон. Девочка-кошка страшно зашипела, шерсть встала дыбом, а глаза загорелись. Хвост ходил ходуном. Вид у неё был поистине дьявольский я даже на секунду засомневался в адекватности нашей затеи. Но времени на раздумья больше не было."
    sl "Семён, давай!"
    scene bg black with fade
    "Отчаянно крикнула Славя и мы одновременно бросились на Юлю. Но не успели даже коснуться – сверкнула ярчайшая вспышка света, нас отбросило в разные стороны и сознание померкло."
    if alt_uvao_D5_hentai:
        jump alt_uvao_ending_neutral_bad
    else:
        jump alt_uvao_ending_neutral
