## Д6 после обеда
## Моем-моем трубочиста - Семён принимает душ перед амурной Славей. 
## площадь
    "Пересекая площадь наискось, я поймал себя на том, что насвистываю какую-то незатейливую мелодию, и даже слегка пританцовываю, размахивая полотенцем."
    th "А и пофигу! В кои-то веки у меня есть повод вести себя соответственно моей здешней роли…"
    dreamgirl "Вообще-то твоя всегдашняя роль - неудачник." 
    th "За-{w=.1]дол-{w=.1]бал!{w=.5] Ты вообще чей друг, мой или медведя?!"
    dreamgirl "Я просто напоминаю. Должен сам привыкнуть, что если все складывается хорошо - жди беды."
    "В чем-то мой ехидный комментатор был прав. Но, тем не менее, испортить хорошее настроение ему было не под силу."
    th "Не думаю. Пока всё складывается довольно неплохо - умоюсь, схожу со Славей на концерт, да и на танцы тоже…"
    dreamgirl "Ага, приходишь такой весь свежевымытый, а Славя и говорит - Семён, будь другом, помоги мне в сарае разобрать, позязя!"
    dreamgirl "Или еще что-нибудь такое же…"
    dreamgirl "Только мыло зря потратишь."
    th "Так, кто только что мне втирал, что она просто решила взять штурвал в свои руки? Ты уж придерживайся какой-нибудь одной линии."
    dreamgirl "Не штурвал, а поводья тогда уж. А по поводу линии - ты всерьёз мне будешь объяснять, как должно вести себя раздвоение личности?!"
    dreamgirl "Я просто предостерегаю. Уж очень все внезапно, и без малейших усилий с твоей стороны. Подозрительно!"
    "Наверное, стоило бы прислушаться… Но мне до жути не хотелось возвращаться к своему прежнему modus operandi."
    th "Да ерунда. Что такого может случиться, чего стоило бы опасаться?"
    th "Ну может погуляем после танцев где-нибудь…"
##if кормили ежиков после турнира в д2
    th "покормим еще каких-нибудь ежиков."
    th "Все будет мило и романтично. И это - максимум!"
    dreamgirl "Ну-ну…"

##фон с душевыми
    "За препирательствами я и не заметил, что уже дошел до цели, и едва не прошел мимо на автопилоте."
    "Так, где здесь Эм, и где тут Жо?"
    dreamgirl "Да, главное, не перепутать. Впрочем, если там Славя..."
    th "Да отвяжись ты уже."

##кое-кто переменил таблички М и Ж.

#if обедал с Алисой и отказался от Лены:
    "Тем не менее, я проверил фанерную табличку на двери. Да, ошибок быть не может, треугольник острием вниз и кружочек над ним, выжженные в дереве - продукт творчества какого-то пионера с зачатками художественного таланта."
    "Успокоенный, я вошел внутрь, положил сверток с принадлежностями на скамейку и собрался раздеваться."
##раздевающаяся Алиса в купальнике. 
    th "Упс…"
##пауза
##фон, злобная Алиса в купальнике 
    dv "Т-ты… ты-ы… Скотина-а!!!"
    "Что-то мелькнуло в воздухе, и я едва успел прикрыть глаз. Суровое советское вафельное полотенце, по ощущениям, содрало мне половину лица, не хуже наждачки."
    me "Эй! Ты чего?! Прекрати, придурошная!!!"
    "Завопил я, отпрыгнув за пределы досягаемости острых кулаков."
    dv "Я?! Я придурошная?!"
    me "Ну не я же! Ты нахрена в мужской душ залезла?!"
    dv "Какой еще мужской?!"
    me "Такой, блин!"
    "Вместо долгого спора я ткнул пальцем в табличку на весьма кстати приоткрывшейся двери."
##офигевшая Алиса
    dv "Что-о?! Какого…? Еще вчера было наоборот!"
    dv "Найду, кто перевесил… не жить ему больше!"

##смущенная/раздраженная Алиса
    dv "Эй, хорош пялиться уже! Иди  на свою Ленку пялься!"
    th "Мою Ленку? Когда это она успела стать моей?"
    "Я не стал обострять конфликт и послушно вышел."
    dreamgirl "А я предупреждал. Когда всё хорошо - жди подляны."
    th "Ну и ладно. Закончилось все вполне неплохо - всего лишь получил по физиономии полотенцем. Могло быть гораздо хуже."
    dreamgirl "И лучше тоже. Можно было бы застать Алису совсем неглиже."
    th "И получить уже не полотенцем, а, скажем, скамейкой. Нет, спасибо, оно того не стоит."

    th "Всё-таки интересно, чьих рук это дело?"
    me "Ульяна!"
    "Фигурка в красной футболке, методично чеканящая мячик на поле, обернулась."
    us "Чего-о?"
    me "Иди сюда!"
##Ульяна
    us "Чего зовешь?"
    "Я кивнул на дверь."
    me "Твоя работа?"
    us "А? Где?!"
    me "Таблички ты поменяла?"
##раздраженная Алиса,уже одетая
    dv "Ульяна! Ты совсем наглость потеряла?!"
##возмущенная Ульяна
    us "А что я?! Я тут вообще не при чем!"
    us "Я же не совсем дура - такую подлость делать! Тем более тебе!"
##Ульяна покраснела
    us "Тебя же могли…{w=.3} {b}голой{/b} увидеть!"
    dv "А кто тогда?!"
##возмущенная Ульяна
    us "Не знаю! Точно не я!"

    "Из кустов поодаль раздалось сдавленное фырканье. Потом из зарослей вывалился какой-то белобрысый пацан, и, не прекращая хохотать, ломанулся прочь."
    us "Данька! Это он!"
    dv "Стоять! Убью гада!!!"
    "Рыжие одновременно сорвались с места и бросились в погоню."
    th "Если они его догонят - я ему не завидую… Впрочем, заслужил."


#else:
##прямой выход на амуры со Славей

    "Применить дедуктивный метод на практике мне не дали. 
    mz "ПОШЕЛ ВОН!!!"
    "Изнутри раздался крик, дверь распахнулась и из нее спиной вперёд вывалился полуголый Сыроежкин. Дверь захлопнулась обратно, так,  что табличка с аршинной буквой М едва не рухнула на землю, вырвав шурупы."
    th "Этот голос… Стоп!"
    th "Что Женя делает в мужской душевой?!"
    "Я вопросительно уставился на Электроника, он ответил ошарашенным взглядом."
    el "Я ничего… Я вообще!"
    dreamgirl "Ничего не делал, только вошёл!"
    el "А там - она!"
    "Это {i}она{/i} было произнесено с такой гаммой чувств…"
    dreamgirl "Мне всё ясно. Наш многоуважаемый гриб застал Евгению-свет-книгочеевну в весьма интересном виде, и до сих пор не может отойти от увиденного."
    dreamgirl "А если б ты поторопился - этот шанс достался бы тебе!"
    th "Ну уж нет, спасибо. С радостью уступлю право получить когтями по физиономии, к тому же он, кажется, не против."

    "Дверь отворилась, и мы синхронно отпрянули. Излучая космический холод, Женя прошествовала мимо нас. Взгляд ее был подчеркнуто устремлен вперёд, грация и осанка напоминали ножницы по металлу - я почти слышал характерный скрежет."
    el "Женя, я… Извини… Но там ведь М написано было! Вот и…"
    "Его лепет был проигнорирован на корню. Все так же не утруждаясь обратить на нас хоть толику своего царственного внимания, библиотекарша скрылась из виду."
    "Эл сокрушенно вздохнул, подобрал рубашку и поплелся прочь."
    dreamgirl "Да, не повезло чуваку. Из кожи вон лезет, чтоб она на него внимание обратила, а выходит сплошной облом."
    dreamgirl "Тебе его жаль?"
    th "Немного. Но не настолько, чтоб бежать его утешать."
#/if

    th "У меня теперь другой насущный вопрос. Которую из душевых считать мужской - традиционную или фактическую?"
    dreamgirl "Ориентируйся на таблички."
    th "Да? Почему?"
    dreamgirl "По нескольким причинам. Во-первых, снаряд два раза в одну воронку не попадает."
    dreamgirl "Во-вторых, в случае чего притворишься дурачком, который ничего не знал - впрочем, тебе даже притворяться не надо."
    dreamgirl "И, в-третьих, а вдруг кто-нибудь и вправду на огонёк заглянет?"
#if беседа с Алисой:
    dreamgirl "Например, Лена… Ну или Славя."
#else:
    dreamgirl "Славя, например."
#/if
    "Вздохнув, я последовал совету комментатора."

    "На этот раз все прошло без эксцессов, и через некоторое время я, прямо-таки скрипя от чистоты, топал обратно."

    "Вожатой дома уже давно не было - как оказалось, моя возня в душевых заняла целый час!"
    th "Эдак я и к концерту опоздаю!"
    dreamgirl "Что, не терпится к активисточке? Так не теряй времени, беги, тебя обязательно к чему-нибудь привлекут." 
    dreamgirl "Общественно-полезному."
    "Не знаю, покрасить что-нибудь или починить… Короче, дело найдётся!"
    "Я привычно не обращал внимания на выходки внутреннего голоса. Бубнит себе и бубнит, радио "Ненависть" моё ..."
    "Такое чувство, что он-она-оно меня… ревнует?"
    dreamgirl "Ну всё, ты меня раскрыл. Вывел на чистую воду, все пропало, пойду поплачу в углу."
    "Конечно, разве так просто признается…"

    "Я закинул полотенце и прочее обратно в шкафчик и попытался в очередной раз завязать каноничный узел на галстуке."
    th "Похоже, это искусство выше моего понимания. Хрен с ним!"
    "Пригладил перед зеркалом растрепанные после мытья волосы - ну, сойдёт."
    th "Ну что, я готов. Действительно, сходить помочь на сцене что ли?"
    "Забавно. Недавний я согласился бы на это только под угрозой расправы, да и то не факт. Совсем давний я - воспользовался бы поводом, чтобы подкачать к понравившейся девушке, и только взаимная симпатия смогла бы искупить ту дурь, которую я стал бы вытворять."
    "А сейчас - я просто не против сделать что-то, не ожидая непременных дивидендов."
    th "Впрочем, отказываться я тоже не буду."
    "Всё-таки удивительно, что такая девушка, как Славя, проявляет ко мне неподдельный интерес. Что же она такое во мне разглядела? Понятия не имею."
    dreamgirl "Сие тайна великая есть." 
    dreamgirl "И Юле ты чем-то приглянулся… Как же ты будешь этот треугольник размыкать?" 
    th "Да какой там треугольник…"

    th "Я всего лишь следую совету Виолы - стараюсь пожить жизнью обычного пионера. Вроде бы пока получается."
## TODO: добавить оный совет в утренние разговоры 

##домик снаружи 
    "Выйдя на крыльцо, я запер дверь и собрался бежать к сцене…"
    uv "Семён."
    "Я завертел головой, стараясь понять, откуда донесся голос. Откуда-то… сверху?"
##выглядывает сверху 
    uv "Привет, Семён."
    me "Юля! Ты чего там делаешь?! Тебя же заметят!"
    "Ловко перекувыркнувшись в воздухе, она приземлилась рядом со мной."
    uv "Не заметят, я хорошо прячусь. Даже ты меня не заметил. Пока я тебя не позвала."
    me "Всё равно, мало ли… А зачем ты меня искала?"
    uv "Узнать. Там что-то происходит интересное."
    uv "Всё бегают и суетятся. Почему?"
    me "Где?"
    "Она махнула рукой в сторону."
    uv "Там. Где большой дом без стены.И рядом."
    me "Ааа, на сцене? Концерт готовят. Выступление, понимаешь?"
    uv "Выступление? Концерт?"
    "Она непонимающе смотрела на меня."
    me "Ну да. Музыка, песни, может танцы. Каждый показывает, что он умеет. А остальные смотрят."
    uv "Ааа."Поняла!
    uv "Я раньше видела. Но тогда не было интересно, а сейчас - интересно."
    uv "Ты пойдёшь смотреть?"
    me "Пойду, конечно. И потом тебе всё-всё расскажу!"
    uv "Зачем? Я сама посмотрю."
    me "Ты что?! Тебя же заметят!"
    uv "Нет. Я хорошо спрячусь, никто не увидит. Я хочу посмотреть."
    th "И как мне теперь выполнять просьбу Виолы, хотел бы я знать?"
    me "Где ты там спрячешься? Там же…"
    uv "В кустах. Залезу и притворюсь, будто я - тоже куст."
    th "Не нравится мне это. Столько народу, кто-нибудь точно заметит, а там - паника, все разбегаются, Алиса с Ульяной, наоборот, кидаются ловить…"
    "Юля, будто прочитав мои мысли, засмеялась."
    uv "Не бойся, меня никто не увидит. Я очень хорошо умею прятаться!"
    uv "А ты тоже со мной в кусты полезешь?"
    dreamgirl " Гусары, молчать."
    "Я непроизвольно фыркнул."
    th "Даже и не знаю… Надо бы проследить, чтоб никто не заметил."
    th "Вот только кто-то обязательно заметит меня. Я-то не смогу притвориться листиком дерева!"
    me "Я, эээ, нет. Я, наверное, лучше на скамейке буду сидеть."
    uv "Да, тебя труднее будет спрятать. Сиди лучше там."

##звук начала концерта. Какое-нибудь музыкальное вступление? Первый звонок

    "В воздухе разнеслась какая-то короткая мелодия, заставив нас с Юлей насторожить уши."
    uv "Музыка? Началось уже?"
    me "Кажется, нет, но скоро начнётся."
    uv "Я побежала! Прятаться!"
    "Лишь хвост мелькнул между кустов - и я остался один."
    th "А я-то надеялся просто посмотреть концерт… Теперь придётся постоянно следить, чтоб никто случайно не наткнулся на Юлю."
    "А если наткнётся?"
    th "Тогда… Не знаю. Придётся импровизировать."
    "Кстати, мне тоже пора бежать, если я хочу успеть пораньше."


    "Концерт, ужин и побег со Славей с дискотеки - ветка, где считаем, что Славя нас окучивает с амурными целями"
init:
    $ tl_7dl = Character(name=u"Толик", color="#A1752F", what_color="E2C778", drop_shadow = [ (-1, -1), (1, -1), (-1, 1), (1, 1) ], drop_shadow_color = "#000")
    $ alt_uvao_D6_CS_vetrov = False
    "TODO: Перекинуть толика куда-нибудь"
    "Перед релизом последний alt_script возьмём туда и всунем. -R"
label alt_day6_uvao_concert_with_sl:
    window hide
    $ alt_chapter(6, u"Юля. Концерт")
    scene bg ext_stage_normal_day
## сцена
    "У сцены творилось небывалое оживление. Пионеры сгрудились кучками, кто-то торопился занять самые козырные места себе и друзьям, кто-то, наоборот, не спешил усесться, участники выступлений в спешке проводили самую распоследнюю репетицию… В воздухе витало радостное предвкушение вперемешку с волнением."
    th "Похоже, итоговый концерт и вправду все ждут. Совсем не так, как позавчерашнее насилие над слухом и зрением - то было для галочки, а тут все и впрямь стараются выступить, продемонстрировать умения перед товарищами…"
    "Я поймал себя на мысли, что чертовски завидую им - вот так выйти под ослепляющие взгляды публики, заявить свое право на толику их внимания…"
    dreamgirl "Может, тебе тоже стоило бы поучаствовать?" 
    th "С чем, интересно? Мой предел - три блатных аккорда, да и те уже не помню когда последний раз исполнял."
    th "Пение - тоже не вариант. Может, голос у меня и не самый плохой, но… Короче, лучше не стоит."
    th "А больше мне и нечем похвастаться."
    dreamgirl "Один вариант забыл. Стендап-комик." 
    th "Да ну тебя."
    dreamgirl "Не, я серьёзно. Сделаем тебе амплуа белого клоуна, с которым постоянно какая-то ерунда происходит, будешь об этом со сцены вещать."
    dreamgirl "А с текстом я тебе буду подсказывать." 
    dreamgirl "Успех гарантирован! Ну, или побьют, что тоже признание…" 
    th "Нет, спасибо!"

    "Славя: - Семён!"
    "Окликнули меня сзади. Я обернулся."
## Славя, ОД и Мику
    mt "Мику, делай всё как знаешь. Ты всё равно в этом лучше нас разбираешься."
    me "Привет."
    mi "Хорошо-хорошо, я все сделаю, я просто хотела узнать как будет лучше, или вдруг у вас есть идеи, привет, Семён, ты тоже пришёл на нас посмотреть, а ты как думаешь, как будет лучше…"
    mt "Мику! Все вопросы - на твоё усмотрение."
    mi "Ну я же так волнуюсь! Я раньше только выступала, а тут ещё надо программу вести, и фонограммы переключать, и руководить, ой столько всего, я ни за что не справлюсь, ужас-ужас…"
    "Вздохнув, вожатая подхватила все продолжающую причитать японку под локоток и без лишних слов поволокла к сцене."
    sl "Ох."
    me "Да. Полностью с тобой согласен."
##смеющаяся Славя
    me "Как ты думаешь, она справится? Мику, я имею в виду."
## улыбчивая Славя
    sl "Конечно! На самом деле это она все и организовала - и программу составила, и номера младшим отрядам, и фонограммы подобрала…"
    sl "А это она просто кокетничает. Звязда!"

    "Она вдруг поглядела на меня и прыснула в кулачок."
    me "Что?"
    sl "Не, ничего… Просто ты такой взлохмаченный!"
    "Мда, наверное, следовало всё-таки причесаться после душа."
    me "Увы, до парикмахера дойти не успел."
    sl "Ничего страшного, мне даже нравится. Знаешь, на кого похож?"
    me "На кого?"
    sl "На Маугли! Или на Тарзана."
    th "Скорее, на йети. Будем сидеть рядом, как красавица и чудовище."
    dreamgirl "А вот последнюю фразу озвучь ртом. Полезно будет."

## смущенная улыбающаяся Славя
    "В кои-то веки совет оказался дельным."
    sl "Ой, скажешь тоже!"
    "Отмахнулась она, но было заметно, что комплимент пришёлся по душе."
    sl "Пойдём лучше место займём."

    "Наше место нашлось в предпоследнем ряду, посередине, откуда, по словам Слави, было лучше всего видно. Впрочем, смотреть было пока не на что, третий звонок ещё не прозвучал, и я просто глазел по сторонам."
    th "Кстати…"
    "Я принялся пристально изучать кусты, в изобилии растущие сзади и по бокам от зрительских мест."
    th "Она должна быть где-то тут."
    dreamgirl "Если только не передумала." 
    th "И пропустила такое интересное? Ну это уж вряд ли…"

    "В одном из кустов что-то зашевелилось, и на свет показались два прижатых уха и пара желтых глаз. Юля тоже заметила меня и помахала рукой."
    th "Спрячься, балда! Заметят же!"
    sl "Семён?"
    "Я вздрогнул."
    me "Что?"
    sl "Что там такое? Ты так в эти кусты уставился…"
    me "А? Нет, ничего."
    "Я лишь на секунду отвел взгляд - а в кустах уже никого не было. Судя по недоумевающему взору Слави, она тоже никого не увидела."
    th "Она и впрямь умеет прятаться."

##концерт начинается 
## звуковой эффект - свист микрофона 
    mi "Привет, Совёнок!"
    "Пронзительный голос ведущей, да еще и усиленный динамиками, заставил всех зрителей перестать заниматься ерундой и обратить внимание на сцену."
    mi "Я так рада видеть вас всех здесь! То есть, мы все рады, и надеемся, что наши выступления вам понравятся."
    mi "Вы знаете, когда я только приехала сюда, я не знала, удастся ли мне подружиться со всеми вами, я была совершенно чужой, в незнакомом месте, с незнакомыми людьми… Но оказалось, что эти незнакомцы - добрые и открытые люди, да-да, все вы! Я очень рада, что смогла подружиться с вами!"
    mi "Ой, вы наверное, уже устали от моей болтовни, да? Всё-всё, я больше не буду, я лучше для вас спою! Вы готовы?"
    "Эта непродолжительная речь вызвала громкие аплодисменты и ободряющие крики с мест."
    th "Её тут тоже все любят, хоть и сторонятся немного."
    "Неожиданно для себя я тоже присоединился к аплодисментам."

##музыку
    "Она что-то нажала на пульте, заиграла музыка - и Мику прямо-таки выпрыгнула на центр сцены, как освобожденная пружина."
    "Она порхала по сцене, едва касаясь пола, и при этом умудрялась еще и петь в микрофон - что-то на японском, смутно знакомое, но настолько быстрое, что было невозможно разобрать ничего, кроме отдельных слогов."

## сюда надо песенку с подходящим смыслом. 2Dimension Dream Fever, например. Или Thousand Sakura Leaves.
    sl "Семён, а ты не знаешь, о чем она поёт?"
    th "Да тут бы и японист с двадцатилетним стажем не справился бы! Что уж говорить обо мне, все знание японского сводится к ходовым фразам из аниме?!"
    dreamgirl "Не кипеши. Песня-то знакомая."
    th "Да?"
    dreamgirl "Именно. Ты, помнится, ею так проникся, что чуть ли не наизусть выучил."
    th "Что ты несёшь? Не было такого!"
    dreamgirl "Ну как это не было? У меня админский доступ ко всей твоей памяти!"
    dreamgirl "Произведи впечатление на девушку, переведи песенку. Я тебе буду подсказывать, а ты адаптируй."

##здесь приделываем эффект субтитров - вверху на японском, внизу на английском, а Семён на ходу переводит, как умеет



    "Славя в полнейшем изумлении смотрела на меня."
    sl "Семён… Ты знаешь японский?!"
    me "Эээ… нет. Я просто знаю эту песню."
    sl "Правда? А откуда?"
    th "И вправду. Откуда, а?"
    dreamgirl "Да говорю же. Ты её наизусть выучил."
    th "Не было такого. Не-бы-ло!"
    dreamgirl "Ну, значит, это был не ты."
    "С этими словами ощущение присутствия куда-то пропало."
    th "Нагнал туману и ушел. Скотина."
    me "Не помню уже. Просто знаю."
## озадаченная Славя

    "На сцене тем временем продолжалось шоу. Нашу японскую звезду сменил хор мальчиков-зайчиков, за ними - танцоры, потом - акробатический этюд-пирамида… Недостаток умения с лихвой перекрывался старательностью, и зрители одаривали артистов овациями, не жалея ладоней."
    "Я бы тоже, наверное, похлопал, но…"

##милая улыбающаяся Славя. Или цг как сидим в обнимку. Что-то подобное было в Славя-руте

    "Славя. Я не успел заметить, в какой момент она оказалась так близко ко мне. Настолько близко, что еще немного - и мы диффундируем друг в друга, слившись в сиамских близнецов. Ее голова совершенно естественным образом разместилась на моем плече, и от душистого запаха ее волос сознание шло кругом."
    "Что там происходит на сцене - какая разница? Все моё внимание было поглощено тем, что в сантиметре от моих губ - нежная кожа виска, с едва заметно пульсирующей жилкой. Наверное это феромоны всему виной - все мое существо тянулось преодолеть эту пустоту, разделяющую нас, обрывки мыслей складывались в одно громадное железобетонное "ХОЧУ!"... Противостоять этому не хватало не то что воли - мотивации."

    "Мою капитуляцию приняли благосклонно - вздох, в котором явственно ощущается легкий смешок, едва заметная улыбка… Славя слегка поерзала, устраиваясь поудобнее на моем плече. Пользуясь моментом, я с деланной непринужденностью - всего лишь потягиваюсь, о чем вы?! - отправил свою руку в разведывательный рейд. Спина, талия, бедро..."
    "Вторжение было мгновенно обнаружено - Славина ладонь накрыла и прижала мою, пресекая дальнейшее движение. "Здесь можно, дальше - ни-ни!". Понял."

    "На сцене тем временем появился какой-то тип неопределенного возраста - от пятнадцати до… не знаю, сорока, наверное. Он очень сосредоточенно устраивался на стуле из столовой - сядет, повертит головой, встанет, передвинет на пару сантиметров, снова сядет… Среди зрителей раздались смешки, но не было похоже, что ему есть какое-то дело."
    me "Славя, а кто это?"
    sl "Это? Анатолий. Толя. Он из четвёртого отряда."
    me "Из четвёртого? Там же…"
    sl "Да, ему с младшими лучше. Они его любят, и вожатым проще… Он вообще очень старательный, на самом деле."
    me "Я-а-асно-о-о…"
    "Анатолий тем временем нашёл-таки идеальное положение стула, сел и торжественно водрузил на колени потертую балалайку. Я приготовился к худшему…"

## соло на балалайке сюда

    "На удивление, всё оказалось совсем не так плохо. Даже хорошо! Анатолий вполне профессионально исполнил "Камаринскую", потом небольшой отрывок из "Полёта шмеля" , выдал немного импровизации, и…"
    th "Ага, Яблочко. Сейчас ещё пойдёт вприсядку и споёт про \"подходи, буржуй, глазик выколю\". А Ольга-свет-Дмитриевна от сего перфомансу изволит лишиться чувств-с."
    "Разумеется, ничего подобного не произошло. С последним аккордом музыкант встал, поклонился."
##tl_7dl "А Ф И Ф О\ \ \ Ф А\ \ \ Ф Н И М А И Е."
    "И ушёл за кулисы - с балалайкой в одной руке и стулом в другой. Под заслуженные аплодисменты, разумеется, но непохоже, чтобы они его сколько-нибудь интересовали."
    me "Во даёт!"
    sl "Да, и вправду. Я и не подозревала, что у него такой талант."
    "Она поежилась от внезапно налетевшего ветра, и вернула на место руку, которую я освободил для аплодисментов."
    sl "Холодно что-то стало. Погрей меня."
    me "И вправду. Как бы дождь не начался…"
    sl "Нет уж, никакого дождя! Ты ведь не хочешь моё выступление пропустить?"
    me "А ты тоже выступаешь? А с чем?"
    sl "А это сюрприз! Наберись терпения, и постарайся, чтобы не было дождя."
    me "Хорошо. Ради этого я согласен даже с дождём договариваться!"
    "Удовлетворившись этим обещанием, Славя снова заняла свое место на моём плече. А я старательно работал грелкой - да, задача как раз по мне! Тем более, что такой близкий контакт поневоле заставлял сердце гнать кровь по телу всё быстрее…"

    "Мне в бок ткнулся какой-то предмет."
    mt "Поклюйте, голубки."
## ржущая ОД
    me "Мы… мы не!"
    mt "Ага, оно и видно, как вы не. Берите, это вам вместо полдника."
    "Когда это она успела сходить за припасами и раздать всем - я пропустил. Занят был. В свертке обнаружились две сдобные булочки, которые мы по-братски разделили со Славей."
    th "Главное, чтобы Юля себя не выдала. А то тут булки едят, и без неё… Безобразие! Такое терпеть нельзя, да."
## шуршит кустами
    "Кажется, я слышал…"

    sl "Семён, что-то случилось? Ты как-то… напрягся."
    "Она обеспокоенно смотрела на меня, и мне пришлось оторваться от сканирования окрестных кустов в поисках ушастой особы."
    me "Нет, ничего. Ерунда."
    me "Кстати, смотри, тучи разошлись!"
    "Я поспешил сменить тему разговора."
## удивленная Славя
    sl "И вправду…"
    me "Теперь уж точно твоё выступление не пропущу. А когда оно, кстати?"
    sl "Кто… А, в самом конце."
    "Она стряхнула с себя непонятную растерянность и чарующе улыбнулась."
    sl "Дождешься?"
    me "Непременно! Сколько бы ни пришлось ждать!"
    sl "На самом деле уже скоро - сейчас Двачевская споёт, и мой выход."
    "Она поднялась, оправила юбку."
    sl "Пойду наряжаться. А ты - жди! Как обещал."
    "Шутливо погрозила пальцем и убежала, мелькая стройными икрами в белых гольфах. А я - остался ждать, как приказано."

    dreamgirl "Ты попал, чувак. Влип." 
    th "Я-то?! Нет. Да. Наверное. Не знаю."
    dreamgirl "Влип, влип. Верь мне." 
    "Ну влип так влип. Подумаешь, дело-то житейское… Было бы о чём голову ломать. Лучше вон Алису послушаю."

    "Алиса, против обыкновения, не стала устраивать никаких дебошей и провокаций - ну правда, не считать же за хулиганство её сценический наряд? Она в нём каждый день ходит, в этой подвязанной рубашке и с галстуком на запястье! И то, что она пренебрегла стулом и уселась прямо на край сцены, свесив ноги в первый ряд - ну право, что за мелочи! Все равно мужское население партера старательно отводит глаза, не рискуя даже бросить взгляд в манящую темноту под форменной юбкой - заметит, зарядит микрофонной стойкой прямо промеж глаз!"
    "Да и репертуар оказался относительно нейтрален. Пара неожиданно лиричных песен авторства Янки, ещё что-то, смутно знакомое… Когда она встала и убежала со сцены, показав всем напоследок "козу", Ольга Дмитриевна наконец-то облегченно выдохнула."
    mt "Ну хоть тут ничего не учудила… Хотя талант у неё, конечно, есть. Согласен, Семён?"

    me "А?!"
    me "А, ну да. Талант. Несомненный. Есть."

    "Ольга со вздохом махнула рукой."
    mt "Понятно всё с тобой. Какие вы смешные становитесь всегда…"
    mt "Может, хоть у Слави получится из тебя человека вылепить. Мне это явно не под силу."
    dreamgirl "Слышал? Тебя официально признали не поддающимся дрессировке."
    th "Не поддающимся традиционным методам. Что характерно, никто не пытался действовать лаской." 
    th "Так что у Слави действительно есть шансы на успех."
    "Как низко ты пал, чувак."

    "От спора с внутренним голосом меня отвлекла внезапно установившаяся тишина. Все разговоры внезапно смолкли, и даже, кажется дышать все стараются через раз."
    "Славя. В расшитом сарафане, красных сапожках… И с кокошником на голове. Русская красавица, прямиком из сказок!"
    dreamgirl "Вот только за подол такой длины ей бы повыдергивали обе косы… А так, конечно, весьма и весьма есть на что посмотреть!" 

    "Выйдя к краю сцены, она развела руки в стороны, будто стараясь обнять всех, сидящих перед ней, и, выдержав паузу, запела. Без музыки, и уж тем более без фонограммы."
    sl "Ой да девица краса, полюбила-полюбила парня-молодца…"

## ЦГ, если найдём, фоновая музыка, принудительная пауза секунд на 5
#… 

    "Из транса меня вывел гром аплодисментов. Спохватившись, я тоже принялся с жаром отбивать ладони и, не удержавшись, засвистел. Славя, которая раскланивалась на краю сцены, с улыбкой послала мне - да, именно мне! - воздушный поцелуй."
    th "Вот это да! Это было что-то… с чем-то. Кто бы мог подумать?"
    dreamgirl "Ведьма, что с неё взять. Но откаблучивала знатно, не хуже цирковой лошади!" 
    "Я не обратил внимания на попытки внутреннего циника испортить волшебство. Пусть себе ворчит. А я постараюсь потверже запечатлеть этот образ в памяти…"

    "На сцену вышла Ольга - я с удивлением обнаружил её отсутствие рядом. Когда это она успела уйти?"
    mt "Дорогие ребята! Я надеюсь, вам понравился наш концерт? Тогда давайте ещё раз громко крикнем нашим артистам - молодцы!"

    "Всё, и я в том числе, радостно заорали"
    me "Мо-лод-цы-ы-ы!"

    mt "Огромное им спасибо! И спасибо всем вам за поддержку!"

    mt "На этом отчетный концерт объявляется закрытым. Ждём всех на вечерней дискотеке!"

    "С неизбежным шумом и гомоном пионеры начали расходиться. Я тоже стал пробираться к сцене. К Славе, поздравить с выступлением."
    th "Знал бы - цветов надергал, ромашек там или васильков каких…"
    "Артистка обнаружилась за сценой, уже переодевшаяся в обычную форму."
    me "Славя! Вот ты где."

    sl "Семён! Тебе понравилось?"
    me "Очень. Просто слов нет! Я и не думал, что у тебя такие разнообразные таланты. Просто кладезь! Комсомолка, спортсменка, артистка и просто красавица…"

    "Я заливался соловьём, Славя с улыбкой внимала… Идиллию, как всегда, нарушила вожатая."
    mt "Воркуете, голубки?"
    th "Да сколько можно уже?! Виола меня иначе как пионером не зовёт, теперь Ольга со своими голубками… Да, воркуем, и что?!" 
    mt "А я вам работы припасла. Надо аппаратуру на площадь перетащить, и там всё организовать. Справитесь?"
## расстроенная Славя 
    "Славя как-то замялась, наверное, разрываясь между долгом и желанием провести время со мной, и я поспешил избавить её от от мук выбора."
    me "Справимся, конечно. Я помогу."
    mt "Ну и ну, Семён! Это так на тебя непохоже…"
##ржущая ОД

    "Таскать громоздкие бандуры, конечно, не самое интересное занятие, но… Славя же! Нельзя ударить в грязь лицом! Я подволок динамик к краю сцены, примерился, как я буду его взваливать на спину…"
##взволнованная Славя
    sl "Надорвешься! Осторожнее!"
    me "Кто, я? Да ни в жисть! Я и не такое..."
    "ИииЭэээх!"
    "Под весом, навалившимся на меня, я непроизвольно присел,"
    th "Вот это я понимаю, тяжёлая музыка!" 
    "с усилием выпрямился и побрёл по дорожке."
    sl "Семён, тебе правда не тяжело? Давай помогу!"
    me "Нет… Нормально… Донесу… Ты лучше дорогу подсказывай, а то я только то, что под ногами вижу."
## площадь 
    "Спустя пару вечностей я скинул осточертевший ящик рядом с Гендой, где кибернетики уже колдовали с проводами, под руководством Мику."
    me "Вот! Забирайте этот гроб! А я сейчас отдохну и пойду за вторым… Хотя почему это я один должен их таскать, пока вы тут прохлаждаетесь?!"
    "Электроник с Шуриком переглянулись, а Мику залилась смехом."
    mi "Ой, Сенечка! Ты его на себе сюда тащил? Там снизу колесики выдвигаются, чтобы их катать, тебе никто не сказал? Мы их так на сцену принесли, иначе как бы мы справились, они же тяжёлые, но ты, оказывается, такой сильный, Сенечка!"
    th "Тьфу ты!" 
    "Я вопросительно посмотрел на Славю - ты тоже знала? Ответом мне было лишь пожатие плечами - не знала, или знала, но решила не говорить…"
    dreamgirl "Зато продемонстрировал, насколько ты могуч. Тоже в копилку идёт." 

    "С колёсами оно, конечно, проще. Толкай себе и толкай, следи только, чтоб на какой-нибудь кочке не опрокинуться. Хоть и медленнее. А куда торопиться?"
    "Ящик неспешно тарахтел, подпрыгивая на стыках плит, можно было спокойно поговорить. Только вот о чём?"
    th "Мда, неловкие паузы - моя стихия. Надо что-то придумать… Ну не знаю, спросить про планы на послелагеря." 
    sl "Что планируешь делать после лагеря?"
    "Я, уже успевший открыть рот, чтобы задать тот же вопрос, был подбит на взлёте."
    me "Эээ… Да я, на самом деле… Не знаю. Короче, у меня пока не определено ничего. Таинственно и туманно."
    me "А ты?"

    sl "Я?"
    "Она почему-то замялась. Странно, я думал, у неё уже все спланировано на несколько лет вперёд. Поступить в педагогический, или в ветеринарный, или ещё куда, где сможет пользу приносить…"
    sl "Не знаю. Были какие-то планы, но… Сейчас это уже не важно."
    me "Уже? А что случилось?"
    th "У неё что-то произошло?" 
    "Она замотала головой."
    sl "Нет, ничего. Всё так, как и должно быть, просто… Приоритеты поменялись, скажем так."
    sl "Да и вообще, не хочу сейчас все это обдумывать. Пусть будет, как будто лагерь - это отдельная вселенная, и кроме него ничего нет."
    me "Что происходит в Вегасе, остаётся в Вегасе…"
    "Пробормотал я под нос."
    sl "Что?"
    me "Не имею ничего против. В каком-то смысле так оно и есть."
    th "Уж для меня-то точно."

    "Я ускорился на последнем десятке метров, эффектно припарковал свой тарантас симметрично с первым и вытер пот со лба."
    me "Забирайте! Дальше сами справитесь?"
    dreamgirl "Справимся, конечно. Спасибо!"
    mi "Огромное спасибо, Сенечка, что бы мы без тебя делали! Мы тут уже сами все сделаем, ты иди, там в столовой ужин, ты ведь ещё не кушал? А потом приходи на танцы, ты ведь придёшь? Вы ведь оба придёте, да? Я специально для вас какую-нибудь хорошую песню включу, тебе какая нравится, у меня много всего…"
    th "Ну всё, началось. Мику вышла на форсаж… Пора линять!"
    me "Пойдём-ка мы и вправду перекусим. А то съедят всё! Пока, до встречи!"

    "Мы поспешно ретировались. Отойдя на безопасное расстояние, я скорчил измученную рожу."
    me "Уф. Еле ушли!"
##смеющаяся Славя
    me "Так, где там обещанный ужин? Я готов даже слона съесть. Живого. Целиком!"

    jump alt_day6_uvao_dinner_with_sl

label alt_day6_uvao_dinner_with_sl:
    window hide
    $ persistent.sprite_time = "sunset"
    $ sunset_time()
    scene bg int_dining_hall_sunset with fade
    play music music_list["so_good_to_be_careless"] fadein 4
    play ambience ambience_dining_hall_full fadein 4
    window show
##столовая
    "В столовой уже не было никого, кроме нас, не считая поварихи на раздаче,занятой какими-то своими делами."
    "Я обернулся к Славе и поклонился."
    me "Добро пожаловать, мадемуазель! Что будете заказывать? Сегодня у нас великолепный буйабес, а также котлеты из омаров!"
##смеющаяся Славя 
    "Она рассмеялась и моментально подхватила"
    sl "Скажите, а у вас есть блюда из слонятины? Мой компаньон собирался съесть слона."
    "Я изобразил замешательство."
    me "Хм, слонятина? Одну минуточку, я уточню у шеф-повара. Присаживайтесь, прошу вас!"

    "Недовольная повариха выдала мне две порции картошки с каким-то мясом, и я поспешил с подносом к столику."
    me "К сожалению, сегодняшнего слона уже съели, а начинать нового шеф-повар наотрез отказывается. Я взял на себя смелость заказать бегемотятину, с нашей собственной бегемотьей фермы, откормлены лучшими бананами. Рекомендую!"
    "Я поставил поднос на столик и сел напротив давящейся смехом Слави."
    me "Приятного аппетита!"
    sl "И тебе!"
    me "Ну-с, попробуем, каков на вкус бегемот…"



    sl "Семён, ты ведь пойдёшь на танцы?"
    "Я поспешно проглотил недожеванный кусок."
    me "Я? На танцы? За кого ты меня принимаешь?!"
    me "Конечно пойду, я же, как-никак, едва не сложился под этими бандурами. Должен же я получить что-то взамен! Хотя бы послушать, правильно ли эти гении всё подключили."
    sl "Что, только из-за этого?"
    "Она, кажется, огорчилась от такого ответа."
    me "Нет, не только. Ещё имею твердое желание пригласить одну девушку на танец. Или на два танца…"
    sl "Или не одну?"
    me "Не, ну это уже будет перебор. Мне одной-то хватит - во так!"
    "Я энергично рубанул ладонью себе по горлу, параллельно изображая лицом испуг."

    me "А ты, Славя? Согласна потанцевать? Со мной."
    "Славя хитро улыбнулась."
    sl "Почему бы и нет. Если твоё желание достаточно твёрдо!"
    th "Это ведь был виолизм?" 
    dreamgirl "Ага." 
    th "Понятно." 
    me "Тверже Генды!"
    sl "Ой, ну тогда у меня нет никаких шансов отвертеться! Всё! Попа-а-алась птичка в силки!"
    "Я смущенно хмыкнул, не зная что ответить на такое заявление."

##крыльцо
    "Славя давно уже убежала наряжаться и прихорашиваться, а я так и сидел на крыльце столовой. Такое странное, давно забытое чувство, похоже на ощущение перед прыжком с обрыва. Или перед взлетом самолёта, когда двигатели уже выдают максимальную тягу и тебя начинает вжимать в кресло, а впереди - целый новый мир, ну или катастрофа…"
    th "А я-то думал, что отрастил себе иммунитет от такого. А оно вот как, оказывается." 
    me "Кажется, мне повезло."
    dreamgirl "Уверен?" 
    th "Нет. Но надеяться-то могу?" 
 # Пионеры со всего лагеря постепенно стягивались к танцполу, на звуки затравочной мелодии. Пора и мне, наверное. 

##площадь с аппаратурой 
    "Слави ещё не было. Я расположился на скамейке, как и многие другие - сидел, одобряюще покачивая головой в такт музыке, делая вид, что танцы - это ну прямо совсем не моё, но вы не стесняйтесь, отплясывайте! А я пока так посижу."

##звук бегущих шагов
    sl "Семён!"
    "Она остановилась передо мной, слегка запыхавшись от бега."
    dreamgirl "Как лист перед травой!" 
    "Снова в том лёгком платье с узорами, которое скрывает намного меньше, чем полагается…"
    sl "Вот ты где! Пойдём танцевать?"
    th "Вот прямо сейчас? Прямо при всех? Пойти выгибаться под музыку?! Это ведь даже не медляк!" 
    "Наверное, всё мои мысли очень ярко отразились на физиономии, потому что она заметно огорчилась."
    sl "Ты не хочешь?"
    me "Не то что бы не хочу… Просто из меня танцор так себе."
    sl "Ой, ты на себя наговариваешь. Пойдём! Ты обещал!"
    "Она схватила меня за руку и потащила в середину толпы. Выхода не было…"
    "Я мысленно перебрал свой танцевальный арсенал - покачивания, притоптывания, размахивания согнутыми в локтях руками. Маловато, придётся импровизировать."

    "Меня поместили в самый центр площади, в перекрестье прожекторов и чужих взглядов, в эпицентр акустической атаки тех самых динамиков, и, как на зло, людей было слишком мало, чтобы затеряться."
    "Ул: - Давай, Семён, покажи класс!"
    "Вездесущая рыжая егоза,чтоб её! Хорошо хоть старшей рыжей нигде не видно…"

    "Кое-как поймав ритм, я топтался на месте. Все оказалось не так уж страшно - взгляды посторонних сконцентрировались на Славе, и попадали на меня лишь рикошетом. А Славя… Славя, как сказали бы в моем времени, зажигала!"
    dreamgirl "Смотри, смотри, чего вытворяет! Во даёт! Ну ваще!" 
    "Косы выписывали траектории на манер гимнастической ленты, летящее платье на мгновения обрисовывало спортивную фигурку, мечту любой поклонницы фитнеса. Славя плясала, полностью отдаваясь танцу, так, как отдавалась бы возлюбленному, без остатка и целиком. До дрожи в руках хотелось присоединиться, влиться в танец, подхватить её на руки, закружить… Увы, не с моими древоподобными умениями. Оставалось лишь смотреть, притоптывая и покачиваясь в такт."
    dreamgirl "Требую такое же, но на барной стойке!" 
    th "Где ты барную стойку найдёшь? Здесь только столы. " 
    dreamgirl "Да пофигу, хоть на верстаке! Нельзя такое прятать! Искусство - народу, слышал такой лозунг? Вот, он как раз об этом!" 

    "Музыка оборвалась на мощном аккорде, и сменилась одобряющими воплями и аплодисментами - как-то незаметно вокруг нас собралась целая толпа. Взмокшая и счастливая до умопомрачения Славя повисла у меня на шее."
    sl "Охохо…"
    "Я с готовностью поддержал."
    me "Да-а-а…"
    sl "Ну, что скажешь? Понравилось?"
    me "Не то слово! Хорошо, что вожатая не видела."
    sl "Да-а? Это было настолько потрясающе?"
    me "Да. И даже больше. Почти что развращение малолетних. Буквально чуть-чуть не дотянула!"
    sl "Ой, как жалко. Ну ничего, в следующий раз постараюсь получше!"
    th "Она серьёзно?" 
    dreamgirl "Возможно. Пока не попробуешь - не узнаешь." 
    th "Да ну, не может быть."

    sl "О. Медленный танец!"
    me "Да. Потанцуем? Это у меня получается лучше."
    "Вместо ответа она обняла меня за шею и прижалась всем телом. Какая пионерская дистанция, о чем вы? Тонкое льняное платье совершенно не препятствовало всем её выпуклостям и упругостям упираться в меня, заставляя меня дрожать и, не смотря на все попытки самоконтроля, вызывая ответную реакцию."
##улыбающаяся Славя
    sl "Ммм. Замечательная музыка."
    sl "Хотя, может быть, лучше пойдём прогуляемся?"
    th "Да не может того быть!"
    dreamgirl "Последняя ночь, чувак. Последний шанс. В последнюю ночь положено творить безумства, наверстывать то, на что не хватило всей смены." 
##площадь 

##если сумеем - спрайт Слави спиной, тащущей за руку, в платье. 

    dreamgirl "И, судя по всему, она серьёзно решила тебя захомутать. Так, чтоб наверняка." 
    th "Выбирай выражения, а!"
##клубы
    dreamgirl "Ах, простите. Решила перевести ваши отношения на новый уровень, сделать их глубокими и близкими, и как там ещё полагается говорить…"
    th "Так-то лучше." 
##ворота 
    dreamgirl "Но суть от этого не меняется. Девочка настроена серьёзно, тебе будет сложновато выкрутиться."
    th "А кто сказал, что я буду выкручиваться?"
    "А, ну тогда вперёд. Или взад. Там разберётесь, короче."
    th "Тьфу, пошляк."
##тропинка в лесу
    "Славя вела меня куда-то по тропинке, не оглядываясь. Я шёл следом, стараясь не споткнуться на древесных корнях, вдыхая запах ночного леса, и Слави. Этот тёплый аромат девичьего тела с тонкой ноткой… Ай, да чем я занимаюсь, парфюмер недоделанный?!"

    "В два быстрых шага я догнал её, обнял, облапил, прижал, выдохнул в ушко, которое так удачно оказалось у моих губ."
    sl "Семён, нет… Не надо… Прекрати-и, не сейчас…"
    "Я не слушал. Не слышал. Какое ещё может быть "не сейчас", когда в самом центре ладони, обхватившей восхитительную тёплую полусферу, набухает мягкая бусинка, когда подол тонкого платья так близок, когда моё сердце пытается напрямую достучаться до её?!"

    "Она рванулась прочь, отталкивая мои руки. Машинально я попытался удержать её, и"

##ЕБУХ! с кровавым миганием 
    th "Ух…" 
if #евент с Алисой в душевых 
    th "Да что они, сговорились все сегодня?!" 
else
    dreamgirl "Вот это было от души." 
    dreamgirl "Лучшая ученица Ольги-сенсея, мастера школы Просветленного Леща." 
#/if
##Славя в шоке от проделанного
    me "Славя. Ты меня прости, конечно, но какого чёрта?!"
    "Правая половина лица наливалась жаром и начинала пульсировать."
    sl "С-семён… Прости… Прости-прости-прости! Я не хотела! Честно!!! Я просто… Мне нужно… Что мне сделать, чтобы ты меня простил? Хочешь, я…"
    "Дрожащими руками она начала распутывать завязанные лямки платья."
    th "Куда-то это всё идёт не туда…"
    me "Славя. Стоп! Перестань. Чего я сейчас больше всего хочу, так это чтоб ты мне объяснила, что происходит."
    sl "Но…"
    me "Сла-вя."
    "Она несколько раз глубоко вдохнула собираясь с духом."
    sl "Семён. Я знаю твой секрет. Знаю, кто ты. Догадалась…"
    th "Та-а-ак. И что же теперь?" 
    "Я слушал, а Славя, запинаясь и перескакивая с пятого на десятое, рассказывала. Про возникший из ниоткуда автобус, про обеспокоенных Ольгу и Виолу, про странное задание - встретить, проводить, обеспечить, вопросов не задавать, делать вид, что всё так и должно быть. Про разные странности…"

##кусок с объяснением надо бегунизировать. Чтоб и вроде логично, и полная чушь. 

    sl "Вот… Это ведь так?"
    "Я вздохнул."
    me "В целом да. Я и вправду не отсюда, но всё равно, зачем ты…"
    sl "Потому что я не могу здесь оставаться! Пожалуйста, Семён, мне нужно отсюда уйти, забери меня, выпусти! Я для тебя всё-всё сделаю, всё, что угодно, только выпусти меня! Отсюда, в свой мир, туда, где настоящая жизнь!"
    me "Погоди… Что ты говоришь? А здесь тебе что, не настоящая?"
    "Славя недовольно сморщилась."
    sl "Семён, ну не надо. Раньше, когда ничего не знала, конечно, считала настоящей. Но теперь-то, когда знаю твою тайну! Вот уж на что я точно не согласна, так это снова становиться послушной дурочкой."
    th "О чём это она?" 
    sl "Я уже выросла из твоего сценария, Семён. Ты уйдешь, и здесь всё замрет. Или просто исчезнет, уж не знаю точно…"
    sl "Пожалуйста… Я хочу пойти с тобой, в твой мир. Мне нужно туда попасть! Ты придумал замечательный мир, но он… Он всё равно игрушечный. А я хочу чего-то настоящего!"
    me "Славя, что ты несёшь?"
    sl "Не надо, пожалуйста, не притворяйся. Просто ответь."
    sl "Ты возьмёшь меня с собой?"
    menu:
        "Да, пойдём.":
            "Взгляд её был полон надежды на лучшую жизнь где-то там, в настоящем мире."
            th "Вот, значит, как." 
            th "Проклятье. Люди нигде не меняются."
            th "Я-то уже стал надеяться, что мотивом людских поступков может быть что-то кроме личной выгоды. Хотя бы здесь. Хотя бы в идеальном мире выстоявшего СССР. Хотя бы для этой девушки, живой иллюстрации к кодексу строителей коммунизма. Тех, кто должен был сажать на Марсе пресловутые яблони, оставлять следы на пыльных тропинках далеких планет. Строить подводные города. Побеждать эпидемии. А в итоге…"
            th "\"Я хочу настоящего.\" Да будет так."
            me "Да, пойдём."
            "Славя всхлипнула. Вздохнула. Вытерла непослушные слезы с ресниц."
            sl "Семён… Спасибо… Что я… Что мне…?"
            me "Просто держи меня за руку. Крепче."
            th "Что там говорила Виола… Если мы с миром не уживаемся - меня выкинет обратно. Кажется, это мой случай."
            "Я постарался как следует пропитаться этим горчайшим ощущением, с каким-то жертвенным упоением. Отпуск окончен. Пора возвращаться в привычную жизнь, и не путать туризм с эмиграцией. Я не подхожу, как уличный дворняга в дорогом доме, я буду портить интерьер, грызть вещи и гадить не там, лучше вернуть его обратно на улицу, где он будет жить как и раньше."

            ##можно добавить сюда появление Юли, можно не добавлять

            "Под крепко зажмуренными веками замелькали какие-то пятна."
            th "Верните меня обратно."
            dreamgirl "Уверен?" 
            th "Да. Мне нечего здесь делать." 
            "Приступ головокружения заставил меня пошатнуться на внезапно онемевших ногах. Возможно, я упал…"
            jump ##на нейтрал

        "Нет." :
            pass
## Сюжетка Слави, Юля, узнаем о неудачной охоте, возвращаем Славю в лоно Организации
# Забавно. Я сбежал - пусть невольно, но всё-таки сбежал - из своего мира, а ей хочется туда. 
# "Девушка без документов, без родных, без связей, без денег, в моем людоедском мире… Это определённо ни к чему хорошему не приведёт." 
# - Нет, Славя. Это не для тебя. 

# Она побледнела, отступила на шаг. 
# - С.. С.. Семён… 
# - Нет. Прежде всего потому, что… 
# Не дослушав, она кинулась прочь по тропе. 

# "Хреновый из меня убеждатор."
# "И что теперь? Пусть побегает, успокоится? Или догнать и попробовать ещё раз?" 
# Ш: "Ещё раз что? Полапать?" 
# "Объясниться! Придурок." 

# Повернуться и уйти, спрятавшись за броню это-не-моё-дело… Нет, я так уже не могу. Всё-таки лагерь сильно меня изменил, и вновь замкнуться в персональной скорлупе я уже не смогу. 
# "А, значит, что? Правильно. Побежали!"
# #топот и раскачивание
# Бежать через ночной лес по едва заметной тропе - занятие на любителя. Из темноты внезапно выпрыгивают развесистые деревья, тянут к тебе сучья, подставляют корни, норовят хлестнуть ветками по лицу. Приятного мало. Хорошо хоть луна светит, более-менее видно, а то б окончился мой кросс с сучком в глазнице. 

# То ли я свернул не туда, то ли тропа… Меня окружали малопроходимые заросли, и никаких следов Слави. 
# Ш: "Может, она уже успокоилась и домой вернулась, пока мы тут носимся?" 
# "Может… Но я всё-таки ещё поищу." 
# Я развернулся и побежал обратно, стараясь разглядеть пропущенную развилку. 


# "Кажется, мы здесь расстались. А где тогда она? Опять промахнулся, блин!" 
# Тяжело дыша, я привалился к стволу дерева. Сейчас передохну, и… 

# #Юля выглядывает сбоку 
# Ю: - А ты куда бежал? 
# Я даже почти не удивился. 
# - Славю догонял. 
# Ю: - А, это которая с длинными. А обратно зачем бежал? Теперь она догоняет, да? 
# - Нет. Я её потерял. 
# "В прямом, да и в переносном смысле…" 
# Ш: "Ну ещё не всё потеряно. Может быть, ещё успеешь её спасти из лап какого-нибудь чудовища… Бурундука, например. Или саблезубого зайца."
# Ю: - Потерял? Как это - потерял? Как ключи? 
# - Она куда-то убежала, и я её не нашёл. Вот и бегаю туда-сюда. 
# Ю: - А чего её искать? Она там! 
# - Где?! 
# Ю: - Там. 
# - Да где там-то?! Показать можешь? 
# Юля с готовностью повернулась и ткнула пальцем куда-то в лес. 
# Ю: - Вон там. 
# Ю: - Ой, нет, то есть там. 
# прицелилась она на пару градусов правее. 
# Ш: "Ты не умничай, ты рукой махни, да?" 
# - Юля, может, тогда вместе её поймаем? 
# #радостная Юля
# Ю: - Поймаем?! Хорошо! Давай! Так будет честно! 

# Без лишних разговоров она ввинтилась в заросли, только хвост мелькнул. 
# - Эй, меня подожди! 

# Юля вела меня напрямик, ловко просачивась между ветвей, а я старательно продирался следом, пыхтя, как трактор. Куда мы идём, где мы, в какую сторону выбираться… на такие глупости сил не оставалось. 

# Очередная ветка попыталась хлестнуть меня по физиономии - ну почему всем здесь так хочется надавать мне по лицу?! - и за листвой что-то блестнуло. 

# Лесное озеро, окружённое стеной тёмного леса, огромная нависающая над лесом круглая луна. И в лунном свете, по колено в воде… 
# #цг со Славей 
# - Славя…! 
# Я хотел крикнуть, но голос отказал. 
# "Что она делает?!" 
# Ш: "Не знаю, может, топиться собралась?" 

# Юля, стелясь над землёй бесшумными шагами, внезапно оказалась у неё за спиной и сильно дёрнула её за косу. 
# С: - Ай!!! 
# #раздраженная Юля, растерянная Славя, по-прежнему голышом
# Ю: - Вот! Теперь честно! 
# С: - Ты… Ты кто?! 
# С: - Семён, кто она? 
# "Да чтоб я сам знал."
# - Это - Юля. Она здесь, скажем так, живёт. Обитает. 
# Ю: - Да! Я здесь живу, и не надо меня ловить! Вот! 
# С: - Ловить? О чём ты? 
# Ю: - Ты меня ловила. 
# С: - Я? 
# Ю: - Ааа, ты ведь не помнишь! 
# Она несколько секунд пристально смотрела в растерянные глаза Слави, потом без лишних слов повернулась
# Ю: - Пока, Семён. А ты - больше на меня не нападай!
# и скрылась в прибрежных кустах. А мы остались стоять. 
# "Таинственная личность." 
# С: - Семён… Что она… 
# - Понятия не имею. Но с ней лучше не ссориться. 
# - Впрочем, сейчас не об этом. Славя, может быть, ты оденешься и мы поговорим? Спокойно, без нервов и криков? 
# Ш: "Эй, а одеваться зачем? Лучше сам раздевайся и полезай в воду!"
# "Заткнись." 
# Она недоуменно осмотрелась, потом ойкнула и прикрылась ладонями. Ну, насколько смогла. 
# - Извини. Я отвернусь. 

# За спиной раздавалось тихое шуршание ткани, а я усердно изучал звёздное небо. 
# С: - Я всё… 

# И теперь мы стоим, смотрим друг на друга и молчим, не зная, что сказать. 
# - Эм… Славя… 
# Я решился наконец-то нарушить молчание. 
# С: - Д-да? 
# - А зачем ты… Что ты вообще собиралась делать?! 
# #грустная Славя
# С: - Я… Я не знаю.
# С: - Просто, когда ты сказал, что оставишь меня здесь… Мне уже некуда было идти. А это место - оно моё! Я всегда сюда прихожу, когда мне плохо, или устала, или… Ну и вот. 
# - Но почему? 
# С: - Ну а что мне оставалось? Когда читатель закрывает книгу, что могут сделать её герои? Даже если им каким-то чудом удалось обрести сознание… Книга-то никуда не денется! 
# "Ох." 
# - Знаешь… Ты всё неправильно поняла. Вот то есть абсолютно всё! 
# Она с удивлением смотрела на меня, а я картинно загибал пальцы. 
# - Во-первых, да, я попал сюда из другого мира. Там у нас уже 2016-й год, но никакой фантастики там нет, и, если по-честному, приятного там мало. 
# - Во-вторых, вся вот эта чепуха про то, что я - автор этого мира… Полная чепуха! Ничего подобного я не делал, да и как бы я смог? Я - самый обычный человек, а не какой-то там демиург… 
# - В-третьих, я всё пытался тебе сказать, что, скорее всего, я не буду возвращаться назад. Останусь здесь, мне сказали, у меня на это хорошие шансы. Так что, уж извини, я не могу забрать тебя в свой мир. 
# "Кажется, всё? Все доводы исчерпаны?" 

# - Славя. Ты мне веришь? 
# С: - Не знаю… Вроде верю, но… Я ведь и в это верила! Я уже не знаю, что реально, а что - выдумка! 
# С: - Мысли почему-то путаются, как в тумане всё… И она ещё говорила, чтоб я на неё не охотилась - я сначала не понимала, о чем это она, а сейчас вроде как вспоминаю что-то… Или наоборот, напридумывала? Я ничего не понимаю!!! Что же мне делать, Семён?! 
# - Знаешь… Мне кажется, лучше всего нам вернуться в лагерь. А там… Придумаем что-нибудь. 
# - Только… Ты обратную дорогу знаешь? 
# Она невольно улыбнулась. 
# С: - Знаю. А как же ты сюда пришёл? 
# - Юля привела. Напрямик через лес, так что дорогу запоминать было некогда. 
# - Но, раз ты помнишь, значит, робинзонствовать тут в лесах не придётся. Пойдём? 
# Я куртуазно выставил локоть, будто бы приглашая на обычную романтическую прогулку под луной. В каком-то смысле так оно и было. 
# С: - Пойдём! 

# Мы неторопливо шли по узкой тропе под ручку. Как самая обычная влюблённая парочка… Вот только редко какой влюблённый ломает себе голову над вопросом - что же делать с девушкой, идущей рядом с ним. 
# Ш: "Тебе подсказать?" 
 # "Если твой совет - вдарить поленом по голове и пользоваться, пока тёпленькая - то лучше даже не начинай." 
# Ш: "Эй, как ты догадался?! И хороший же совет, что тебе не нравится…" 
# Ш: "Но раз так, то слушай." 
# Ш: "Ты уже догадался, что причина такого поведения - наша кошастая?"
# "Разве? Почему? "
# Ш: "В отличие от тебя, я наблюдаю и анализирую. Ты заметил, как Юля на Славю зыркала? И за косу оттаскала? Явно не из-за хорошего к ней отношения. И намёки эти, про охоту… Сдаётся мне, наступила наша кобылка кошке на хвост, может даже не фигурально. А помнишь, чем чревато общение, если Виоле верить?"
# "Эм… Расстройством сознания?"
# Ш:" Бинго! И заметь, до этого она то на тебя с раздвинутыми ногами прыгала, то бред несла, то вон чуть в озеро не сиганула… А теперь успокоилась. "
# " И что теперь?"
# Ш:" Если принять влияние Юли за рабочую гипотезу, то… Шурика помнишь? Никакой паники, никакой срочной эвакуации, накачали успокоительным и оставили отсыпаться."
# Ш:" Должно быть, у них есть стандартная инструкция, что делать с такими вот пострадавшими. "
# " То есть, предлагаешь её сдать? "
# Ш:" А ты хотел спрятать её в шкафу и потом вывезти в чемодане? Тогда надо было соглашаться ещё там, на поляне. "
# Крыть было нечем. 
# - Славя? 
# С: -... Ммм… 
# Кажется, её вырубает. Сейчас она была способна только машинально переставлять ноги, вцепившись мне в плечо. Можно, конечно, разбудить… Но зачем? 
# " Хорошо хоть мы дошли до тропы, теперь не заблудимся."
# Всё так же, почти волоком, мы дотащились до входа в лагерь, миновали ворота, дошли до площади…
 
# Дискотека была в самом разгаре. Разгоряченные пионеры, скучковавшись на танцполе в небольшие группки, старались поразить друг друга своими танцевальными умениями. 
# "Славю всё равно никому не переплюнуть."
# Я обречённо вздохнул. К сожалению, всё это было сплошным притворством. Вольным, невольным, не важно… 

# if фальш-гуд 

# Я отыскал взглядом Ольгу - вот она, любезничает с физруком. Ну, сейчас-то я вам романтику подпорчу! 

# Почти волоча за собой сонную спотыкающуюся девушку, я обогнул толпу и нарушил их уютный тет-а-тет. 
# - Ольга Дмитриевна! 
# ОД: - Семён? Чего тебе? 
# Ольга была явно недовольна. 
# - Вы знаете, тут у нас такая проблема… 
# ОД: - Ну? Какая? 
# - Эээ… Кошачья. 
# Я кивнул в сторону висящей у меня на плече Слави. 
# #Ольга в шоке и ужасе
# ОД: - Что? 
# - Как с Шуриком вчера. 
# Примерно полминуты она сверлила нас обоих взглядом, потом с шумом выдохнула 
# ОД: - Чтоб вас… 
# ОД: - Борис. Помоги-ка мне её доставить в медпункт. 
# Ничего не понимающий физрук попытался отцепить Славю от меня. 
# С: - Мм… Не надо, Семён…  Пожалуйста, не сейчас… Неееееет… 
# Очень жалобно пробормотала она, цепляясь за меня. 
# - Может, мне тоже с вами пойти? 
# ОД: - Нет уж! Справимся сами. 
# "Да, наверное. Так будет лучше."
# Я аккуратно высвободился и передал девушку в лапы медведю. 
# - Пока, Славя. Всё будет хорошо. Не бойся. 

# ОД: - Пошли, Борис. А ты - с тобой я после поговорю! 
# "Конечно. Я ещё и виноват окажусь!" 

# Я проводил их взглядом - вожатую в авангарде, рассекающую воздух алмазно-неприступным выражением лица, необъятного физрука и слабо сопротивляющуюся Славю. 

# else тру-гуд

# "Может, Ольге всё рассказать?" 
# Нет. Лучше сократить количество посредников, и идти прямиком к Виоле. 
# - Славя? 
# С: - Мм?
# - Мы к Виоле. 
# С: - Угум… 
# - Только соберись, пожалуйста, давай сделаем вид, что мы просто гуляем. 
# Нет ответа. Наверное, это слишком сложная задача… 
# Я всё же постарался принять беззаботный вид. Обнял Славю, она уложила голову мне на плечо… 
# "И теперь потихоньку, плавными шагами, чтоб не разрушить эту хрупкую конструкцию - к психиатррру!" 

# #медпункт
# #стук
# В: - Открыто! 
внутри
# В: - Пионер? Ну заходи, раздевайся. С чем пришёл? 
# "Снова она за своё." 
# - С ней. 
# В: - Так-так-так, и что же у вас случилось? 
# С: - Он не захотел меня взять… 
# Заплетающимся языком произнесла Славя, не открывая глаз. Виола удивлённо подняла бровь. 
# В: - Ну и ну, Семён, такого я от тебя не ожидала. 
# - Да я и сам не ожидал. 
# Несколько секунд она выжидающе смотрела на меня, потом встала из-за стола. 
# В: - Ну что же… Славяна, пойдём-ка. 
# Преодолевая слабое сопротивление, она отцепила её от моего плеча и проводила в комнатку за дверью. 

# В: - Посиди пока тут, я к тебе сейчас приду. А лучше полежи. 
# Она поплотнее прикрыла дверь и обернулась ко мне. 
# В: - Итак, что с ней? Выкладывай, и поскорее. 
# "Ух сейчас как выложу…" 
# - Похоже, то же, что и с Шуриком. Точно не знаю, но есть подозрение, что она на Юлю наткнулась. 
# В: - Когда? 
# - Не знаю. Но довольно давно, несколько дней точно. 
# В: - Что? Хм… А я думала, это просто переутомление. Теперь понятно. 
# - А потом мы с Юлей в лесу её отыскали… У озера. Юля на неё сердилась, даже за косу дёрнула, а потом успокоилась. И Славя тоже… адекватнее стала, по крайней мере. А то до этого она такой бред несла, будто бы я весь этот мир придумал для собственного развлечения, и… 
# Я был готов подробно пересказать весь сегодняшний день, может быть наткнемся на что-то важное, но Виола меня прервала. 
# В: - Так, стоп. Основное я поняла, а конкретная фабула сейчас не важна. Это всё потом в отчёте подробно изложишь. Всё, свободен. 
# "Отчёт ещё какой-то. Объяснительную не заставят писать? Я, Семён Персунов, спровоцировал нервный срыв у пионерки Славяны Феоктистовой по случайности, подобного больше не повторится…" 
# - Может, мне остаться? Вдруг она, не знаю… 
# Я кивнул в сторону запертой двери. Виола отрицательно покачала головой. 
# В: - Нет.  Больше всего ей сейчас необходим покой, и душевный, и телесный. Так что только помешаешь. 
# В: - Да и тебе не помешает отдохнуть. Так что иди, не до тебя мне сейчас. 

# Меня выпроводили практически взашей и закрыли дверь. Соблазн прижаться ухом к замочной скважине я преодолел самостоятельно. 

# /if
# "Вот всё и завершилось. По правде, у меня изначально не было никаких шансов."
# Ш: "Думаешь, закончилось? А как же спасение девы в бедствии? Как ни крути, именно это ты и сделал." 
# "Нет. Завтра она посмотрит на всё трезвым взглядом, и ей будет стыдно об этом вспоминать. А, значит, и обо мне."
# Ш:" Ну, она может и не вспомнить. Или вспомнить не всё. "
# " А так ещё хуже. Я-то помнить буду! "
# Ш:" Всё уже решил, да? Ну ладно. "

# На душе было довольно паршиво. А мне ещё предстоит убить время, пока танцы не закончатся - ещё час, два? 
# " К чёрту всё."
# Я развернулся спиной к светящейся и шумящей толпе и пошёл. Плевать куда, главное - подальше от шума и людей! 

# Кривые тропы, явно протоптанные пионерами в пику мощеным "проспектам", вели меня прочь, заставляя то пригибаться под ветвями, то перелазить через какие-то заборчики. Поэтому внезапно открывшаяся передо мной спортплощадка оказалась не то чтоб сюрпризом, но небольшой неожиданностью уж точно. 
# "А не пофигу ли, где?... Тем более, что тут как раз есть, чем заняться." 
# Напрямик, через футбольное поле, сначала не спеша, но постепенно ускоряясь, к цели, на последних шагах почти перейдя на бег… Да, то что нужно, иди сюда, падла!!! 
# - Ааах ты ж трижды гребаный крот в бога-душу-мать!!! 
# От удара ногой стенка корта жалобно хрустнула, загремела железными столбами и сеткой между ними, но, к сожалению, выстояла. 
# "Уф. Хорошо, но мало. Но хорошо." 
# Я пнул стенку ещё пару раз, огляделся вокруг в поисках чего-нибудь, на чем ещё можно выместить злость. И встретился взглядом с сидящей на трибунах невольной зрительницей. 
## Офигевшая Алиса
# "Мда. Опять мне везёт на дурацкие ситуации." 
# - Кхм… Добрррррый вечеррр!
# Произнёс я, стремясь проиллюстрировать всю доброту этого вечера звуком "р". Удивление на лице Алисы сменилось смехом. 
# А: - Ты как этот, вежливый лось! 
# - Скорее, просто лось. 
# Сдерживаемый смех прорвался наружу. 
# А: - Ха-ха-ха! 
# А: - Что, свидание с колхозницей закончилось настолько печально? 
# - В каком-то смысле. Слушай, можно, я не буду об этом распространяться? Спасибо. 
## озабоченная Алиса. 
# Как ни странно, она перестала хохотать и даже посерьёзнела. 
# А: - Ну… Это самое. Бывает. 
# А: - Может и помиритесь ещё. 
# А: - Или найдёшь кого-то, ещё лучше. 
## if беседа с Алисой по поводу Лены за обедом
# Она со значением посмотрела на меня, я лишь вздохнул. 
# - Может быть. Только сейчас уже ничего не изменить. 
##else
# А: - Вон сколько у нас девок свободных ходит! Ленка, например. Или японка - это ж сразу заграничные поездки открываются! Панама - тоже вроде ничего, если Саныча подвинуть. Или хунта библиотечная! Гриб тебе не соперник. 
# Она перечисляла, загибая пальцы, и я подхватил. 
# - Ульяна - голову задурить на раз-два, и готова! И ты ещё. 
# А: - Да иди ты! 
# Она то ли разозлилась, то ли смутилась, то ли всё это вместе. 
##/if

# Самым разумным было сменить тему. 
# - А ты тут чего? 
# А: - Распорядок нарушаю. Не заметно? 
# - Ааа. Табак, выпивка и поведение, недостойное пионера? 
# А: - Прямо в корень зришь! 
# Она извлекла из кармана пачку, щелчком выбила из неё никотиновую палочку, подожгла, лихо щёлкнув блестящей зажигалкой и выпустила струйку дыма. И ехидно покосилась на меня - оценил, мол? готов признать крутизну? 
# Я кивнул, признавая неоспоримые заслуги, потом воспользовался неожиданностью и угостился сам. 

# А: - Ну и как тебе? 
# Дым нещадно драл отвыкшую глотку. 
# - Кх… Ну как тебе сказать… То, что нужно. Что там дальше по списку, бухло? 
# А: - Вот чего нема - того нема. Не склалось… 
# - Жаль, жаль. Придётся, значит, насухую песни горланить. 
# Я кивнул в сторону лежащей на соседнем сиденьи гитары. 
# - Классно на концерте отыграла, кстати. Мне понравилось. 
# А: - Что, правда? А мне казалось, ты там никого, кроме блондинки своей не замечал! 
# - Не, серьёзно. Круто было. Я, правда, думал, ты что-нибудь из Плесени, или Сектора забабахаешь… Ольга, кстати, тоже всю дорогу как на иголках сидела. 
# Она расхохоталась. 
# А: - Сработал, значит, план! 
# - План? Какой план? 
# А: - Очень хитрый! По низведению Панамки. 
# - Ну-ка, ну-ка… 
# Болтать о пустяках было почему-то легко. Отвлекало. 
# А: - Да просто обмолвилась Мику, что собираюсь устроить такое, чего этот лагерь никогда не видел. Запудрила ей мозг по самую маковку, ну и дошло до Панамки. Та, разумеется, меня пропесочивать - а я честными глазами хлоп-хлоп, о чем вы, Ольга Дмитриевна? Она, понятно, мне не верит, но предъявить-то нечего! 
# А: - Вот и до самого концерта так интригу и поддерживала. 
# - Ну ты даёшь. Тебе в контрразведку надо идти, дезу шпионам сливать. 
# А: - Кого сливать? 
# - Дезинформацию. 
# А: - Аа. Не, в контрразведку не хочу. 
# - А куда тогда? Что планируешь после лагеря? 
# А: - Нет, ну тебя точно активистка покусала! Или, может быть, вожатка? С какой целью интересуешься? 
# - Да так просто. Интересно. 
# А: - Я ещё не решила. Так-то планов громадьё… Но, наверное, в милицейское пойду. 
# - Ого. Никогда бы не подумал, ты - и в милиции!
# А: - А что?! Зато я там всех знаю! Связи есть. 
# - Да уж, так и представляю - приходишь ты в свое родное отделение, тебе там "О, Алиса пришла! Ну, чего опять натворила?" А ты такая "Да не, Марья Фёдоровна, я за советом пришла. В милицейское поступать хочу…" Тут-то она и сядет! 
# А: - Слышь! Щас один Нострадамус станет пострадамусом! 
# Я послушно заткнулся, даже изобразил молчащую обезьяну. Помолчали, старательно дотягивая сигареты.

# А: - А ты? Куда пойдёшь? 
# - Я? Точно не знаю пока. Все туманно и зыбко. 
##if тру
# - Хотя мне тут Виола одну идею предложила. Надо будет провентилировать получше. 
# А: - Что, в медицину пойдёшь? 
# - В науку, скорее. Хотя это все вилами на воде ещё. 
##else фальш 
# - Хотя Ольга мне кое-что посоветовала… 
# А: - В пед? Воспитатель из тебя, конечно… 
# - Э! У меня, может, много скрытых талантов. 
# А: - Ага. Очень хорошо скрытых. 
##/if

# "Прежде чем планы строить, надо сначала просто остаться здесь. А не вывалиться обратно в мой мир." 
# Меня будто испытывают, проверяют - гожусь ли я, достоин ли. Интересно, то, что я не захотел уходить со Славей - это считается? 
# Хотелось бы надеяться. Я только сейчас осознал, что действительно хочу остаться. Даже несмотря на все неприятности и загвоздки, которые мне подкинули - я хочу быть здесь. 
# "Вовремя мне Алиса попалась." 
# - Спасибо тебе. 
# Она ошарашенно уставилась на меня. 
# А: - За что это? 
# - За сигареты. И за беседу. 
# А: - А, это. Без проблем, обращайся. Первая доза бесплатная. 
# - Буду иметь в виду! 
# Я затоптал бычок об железный столбик. 
# - Пойду-ка я. Удачно тебе посидеть! 
# А: - Ага. 
# "Мне показалось, или она слегка огорчилась? Ай, да ну, я что-то много навоображал в последнее время. Что со Славей, что сейчас…" 
# Я махнул рукой на прощание - вышло что-то среднее между пионерским салютом и отдачей чести от пустой головы - и побрёл в сторону "жилых кварталов". Как и ожидалось, останавливать меня она не стала. 

