# Д6 Врезка. Длинная (правая) ветка с самостоятельным расследованием
# Черновик
#
# Используется (в беготне по лагерю) флаг возвращения через шахты alt_uvao_D5_sh_mines
# Используется (в беготне по лагерю) флаг вступления в клуб кибернетиков alt_day2_club_join_cyb
#

label alt_day6_uvao_investigation_sl:
    me "Славя… Славя!"
    "Мне пришлось повысить голос и встряхнуть её за плечи, чтобы выражение глаз стало более осмысленным."
    me "Вот что… Давай для начала ты мне расскажешь всё по порядку. Откуда вдруг такие идеи - про ненастоящий мир, про марионеток? С чего всё началось?"
    sl "Да ни с чего! Я с самого начала это знаю, как в лагере появилась."
    me "Две недели назад, получается? Или ты с прошлой смены?"
    sl "Какие две?! Ты ведь всего неделю здесь. Вот и я - неделю…"
    th "Да что за бред… Бред же!"
    me "Пойдём-ка."
    "Ведя её за руку, я нашёл нам неприметную скамейку подальше."
    me "Садись. И давай с самого начала."
#печальная Славя 
    sl "Зачем? Ты ведь и так всё знаешь…"
    me "Далеко не всё! И мне это нужно, чтобы помочь тебе."
    sl "А ты… Ты правда хочешь мне помочь?"
    me "Да. И для этого мне нужно во всём разобраться."
    sl "Ну да, наверное… Ты же не планировал, чтобы твои куклы вдруг ожили и захотели свободы."
    th "Мда, разговор будет трудным."
    me "Итак… Почему ты решила, что всё вокруг - ненастоящее?"
    sl "Ну, а как иначе? Если я не помню ни-че-го раньше прошлой недели?! Ни своего дома, ни родных?"
    sl "Я просто знаю о них, знаю, что они где-то там есть… Но вспомнить не могу! И так со всем подряд…"
    sl "Скажи мне, ведь на самом деле ничего этого нет? Ничего из того, что я только знаю, а не помню - ведь ничего этого не существует?! Ложная память?!"
    "Я крепко сжал её руку, просто ожидая, пока она успокоится. "
    sl "А ещё… Ещё я откуда-то знаю, что я должна делать."
    sl "Например, утром я должна обязательно встать пораньше, сделать зарядку, пробежать несколько кругов по стадиону, потом, когда начнётся зарядка для остальных - я должна её провести."
    sl "Понимаешь, это не просто привычка, не хочу, а именно должна! Потому что, если я не стану - мне будет плохо."
    sl "И так с остальным. Уборка лагеря, организация всего и вся… А когда отказываюсь…"
    sl "Я пробовала, ты думаешь, почему я с вами не пошла Шурика искать? Сказала, что плохо себя чувствую, а потом меня знаешь, как скрутило!"
    sl "Я, может быть, была бы не против всё это делать и сама! Но зачем-то меня принуждают…"
    sl "Я как будто сама себя принуждаю! И сама себя строго наказываю, если не слушаюсь…"
    sl "Почему? Зачем это, как ты думаешь?!"
    me "А ты?"
    sl "Чтобы не выходила за рамки!"
    sl "Может, если бы я оставалась как все… Я бы тогда даже и помыслить не смогла, чтобы сделать что-то не по сценарию, не заложенное в программу!"
    sl "Сделай с этим что-нибудь, Семён, пожалуйста. Ты же можешь!"
    me "Я?!"
    sl "Да! Я это точно знаю. Когда я рядом с тобой, мне намного легче, я даже ненадолго забываю про все эти \"должна\" и \"надо\"." 
    "Она грустно усмехнулась. "
    sl "Это звучит, как из какой-нибудь книжки, про любовь… Но на самом деле это намного хуже."
    sl "Пожалуйста, Семён… Ты можешь всё это исправить? От… Отдебажить меня - так, кажется, Шурик говорит, когда ищет ошибку в программе. Можешь?"
    dreamgirl "Чува-а-а-ак!!! Я валяюсь! Ну же, отдебажь её по полной программе!!!" 
    "Я не стал даже пререкаться с этим идиотом, просто отвесил ему мысленный подзатыльник. Не знаю, возымело ли это хоть какой-то эффект."
    dreamgirl "Не-а! Ну ладно уж, умолкаю." 
    "Теперь я мог хотя бы собраться с мыслями."
    "Что же, чёрт возьми, мне сейчас делать? Логичнее всего было бы бежать к Виоле, подключать к делу мощь советской медицины, везти Славю в город, к специалистам…"
    "Логичнее. {w}Вот только что-то внутри не позволяло поступить логично."
    th "Это будет слишком похоже на предательство, а уж этого добра в моей жизни было предостаточно. Я должен хотя бы попытаться помочь, прежде чем умывать руки." 

    me "Не знаю, Славя. Но сделаю всё, что в моих силах."
    th "Хоть это, на самом деле, практически ничто." 
    me "Давай всё-таки попробуем разобраться, с чего всё началось. Ты говоришь, что помнишь только последнюю неделю…"
    sl "Ну да!"
    me "Тогда расскажи мне, что самое раннее, что ты помнишь?"
    sl "Ну… Наверное, как проснулась утром…"
    me "И сразу же поняла, что всё - ненастоящее?"
    sl "Не знаю… Наверное, нет."
    sl "Кажется, всё было как всегда… Хотя какое может быть всегда, если всё только началось?! Но мне казалось, что всё как обычно."
    sl "Зарядка, линейка, завтрак… Потом общая уборка. Ночью гроза была, с деревьев много веток и прочего мусора насыпалось."
    sl "А после обеда… После обеда Ольга Дмитриевна сказала, что приедет ещё один пионер, и нужно его встретить… Тебя, то есть. Сказала, что ты немного странный, но чтоб я не обращала внимания."
    me "И как, я и вправду был странный?"
    sl "Немного…"
    th "Да уж…" 
    me "А до этого? Вот, та ночная гроза… Её ты помнишь?"
    sl "Нет! Кажется…"
    me "Кажется?"
    
    "Она молчала, закрыв глаза. Потом заговорила, негромко, словно в странном трансе."
    sl "Наверное, это сон… Будто я бегу по ночному лесу, и гроза гремит… Догоняю кого-то."
    sl "А потом оказывается, что я убегаю, а оно меня догоняет. И я бегу, ветки хлещут, цепляются, я падаю,опять поднимаюсь… А потом просыпаюсь в постели."
    sl "Или… снова оказываюсь в лесу, и снова убегаю, оглядываюсь, а оно всё ближе, глаза горят, жёлтые, яркие…"
    sl "Я падаю, пытаюсь отползти, а оно ко мне подходит, само чёрное, а глаза светятся, даже ярче, чем молния! И уши острые. И когтями меня за горло берёт, и смотрит. Просто смотрит."
    sl "Так страшно, а закричать не получается, не выходит… А оно смотрит насквозь…"
#пауза 
    sl "А потом снова бегу. Всё такое реальное, так похоже на настоящее… Я… я даже с утра нашла царапины, будто и впрямь через лес бежала!"
    th "Царапины, значит…" 
    me "А ты уверена, что это действительно сон?"
    sl "Не знаю… Я уже ничего не знаю. Сон, не сон… Я просто хочу проснуться!"
#нервная Славя
    sl "Или уже поверить в его реальность, чтобы больше не сомневаться, не искать во всём подряд подвох."
    sl "Всё, что угодно, только не это подвешенное состояние, между тем миром и этим!"
    sl "Пожалуйста, сделай что-нибудь!"
    "Она снова была на грани истерики, минутное спокойствие опять сменилось нервным возбуждением."

    me "Славя, а вот это твоё {b}оно{/b} из сна…"
#удивленная Славя 
    sl "Какое {b}оно{/b}?"
    me "Ну ты только что рассказывала…"
    sl "Я? Разве?"
    "В недоумевающем взгляде не было ни капли лукавства, только искреннее непонимание."
    me "Ну вот про грозу, про ночь…"
#раздраженная Славя 
    sl "Ну что ты заладил про какие-то глупости!"
    sl "Вопросы, вопросы, меня уже наизнанку от них выворачивает, от твоих вопросов! Хватит увиливать, пожалуйста! Помоги мне!"
    me "Да я и пытаюсь, только…"
    "Она меня не слушала."
    sl "Мне очень нужно попасть в твой мир! Забери меня, очень тебя прошу! Хочешь, даже на колени встану!"
    dreamgirl "Да уж, предложение соблазнительное." 
    me "Не надо никуда вставать."
    sl "А что, что мне тогда сделать, чтобы ты согласился? Пожалуйста, Семён…"
    me "Так расскажи подробнее. Твой сон, гроза, ночь…"
    sl "Какая гроза? Какой сон? О чём ты? Что ты выдумываешь?!"
    "Её трясло, как в лихорадке, взгляд беспорядочно метался, нигде не останавливаясь дольше, чем на мгновение. Боюсь, своими расспросами я сделаю только хуже. Что же делать? "
    me "Ладно… Вот что, Славя. Иди-ка ты домой, и жди меня. Я обязательно приду, и помогу тебе! Только жди, и не делай глупостей, хорошо?"
    sl "Хорошо…"
    me "Вот и замечательно. Я сейчас скажу всем, что ты плохо себя чувствуешь, и провожу тебя домой."
    sl "Домой? То есть к тебе?"
    "Она, кажется, понимает хорошо если половину того, что я говорю."
    me "Пока нет, мне нужно ещё кое-что сделать. Потом я вернусь за тобой, и там уже… Всё будет хорошо!"
    "Я оставил её сидеть на скамейке, и побежал обратно к сцене. Найти вожатую, объяснить ситуацию, и…"
    dreamgirl "И подключить официальную медицину. Так?" 

# сцена    
    
    "Ольги Дмитриевны по-прежнему не было. Тоже мне, вожатая! Где её черти носят?!"
    me "Эй, Мику! Мику!"
#улыбчивая Мику 
    mi "Что, Сенечка? Мы скоро начнём, уже вот-вот, надо только всех собрать! Все наши вон там сидят, садись тоже, там лучше всего видно."
    me "Погоди, я не об этом. Ты Ольгу не видела?"
    mi "Только утром, но она должна обязательно прийти! Она же не может пропустить отчётный концерт, да? Значит, скоро появится, точно-точно."
    me "Понятно. В общем, когда её увидишь - скажи, что Славя себя плохо чувствует."
#Озабоченная Мику
    mi "Ой, она что, выступать не будет?! А что же делать?"
    me "Не знаю, придумайте что-нибудь."
    mi "Так жаль, у неё такой хороший номер был, мы думали, она будет концерт закрывать… Ну ладно, передай ей, пусть выздоравливает, мы сами справимся. Она, наверное, поэтому такая уставшая была - и так на ней вся организация висела, а тут ещё и это… Ладно, пусть отдыхает, мы справимся!"
    mi "А ты-то придёшь?"
#опять улыбчивая Мику
    mi "Или будешь у постели сидеть, как верный рыцарь?"
    th "Что за намёки ещё? Только концерта мне сейчас и не хватает!" 
    me "Вряд ли. Но всё равно, удачи вам. В смысле - ни пуха. Или как там полагается артистам говорить?"
#смеющаяся Мику 
    mi "К чёрту, Сенечка, к чёрту! Тебе тоже удачи, хи-хи!"

    "Я вернулся к тому укромному уголку, где оставил Славю. Она так и сидела на скамейке, в той же позе, даже, кажется, не пошевелившись ни разу."
    sl "Семён? Ты уже вернулся? Так быстро!"
    sl "Теперь ты меня заберёшь?"
    "Она реально на этом зациклилась." 
    me "Пока ещё нет, я просто сказал, что ты не будешь выступать."
    sl "Не буду? Наверное, да… Хотя должна."
    sl "Но рядом с тобой это всё не важно!"
    th "По крайней мере, уговорить её будет не сложно." 
    me "Пойдём-ка."
    "Она взяла меня под руку и только потом спросила."
    sl "Куда?"
    th "И действительно, куда? Может, прямиком к Виоле? Наверное, нет. Если она поймёт, что я собираюсь её сдать… Мало ли что. Лучше отведу её домой, как собирался, а там уже решу. " 
    me "Сначала к тебе домой. Тебе же надо с собой что-то взять, одежду там, или ещё чего."
# дорожки
    "Мы шли по аллеям, словно обычная влюблённая парочка. По крайней мере, я надеюсь, что мы так выглядели." 
#дом Слави
    me "Вот. Ты собирай всё, что необходимо, а я… Я приду позже. Только ты никуда не уходи, я обязательно вернусь!"
    sl "Хорошо…"
    "Не отрывая от меня взгляда, она поднялась по ступеням и скрылась в доме."
    th "Ффух… Половина дела сделана."
    dreamgirl "Точно? А мне кажется, что…" 
    th "Половина! Сделана!" 
    dreamgirl "Ладно, как скажешь. А что со второй половиной? Бежим к Виоле?" 
    th "Не знаю. Может…" 
    dreamgirl "Поискать это самое {b}оно{/b}, с жёлтыми глазами и острыми ушами?" 
    th "Тоже заметил, да?" 
    dreamgirl "Я всё замечаю! А вот что ты наконец-то стал обращать внимание на детали… Возможно, ты не безнадёжен. "

    # Бежим искать Юлю
    jump alt_day6_uvao_seek_uv

    
label alt_day6_uvao_seek_uv: # ЛБ: TODO вынести в отдельный файл uvao-D6-seek-uv.rpy, позаимствовав оттуда готовый код
    #аллея вечер
    "Всё население лагеря собралось возле сцены, так что некому было меня остановить. И калитку, к счастью, так никто и не запер."
    "Без проблем я покинул пределы лагеря и зашагал по тропе к развалинам старого лагеря."
    th "Надеюсь, она там. И надеюсь, пока я тут бегаю, со Славей ничего не случится. "
    #тропинка вечер
    #шаги и раскачивания
    "Быстрым шагом, раз-два, не обращая внимания на красоты вокруг, левой-правой, не срываясь на бег, но и не позволяя себе расслабиться."
    "Цель ясна, дорога уже известна, заблудиться негде, вперёд, вперёд, не отвлекаемся!"
    # пауза, раскачивание и тяжёлое дыхание 
    # старый корпус вечер
    "Когда знакомые руины выпрыгнули из-за деревьев, я облегчённо перевёл дух."
    th "Довольно быстро добрался! В тот раз вроде бы было дольше."
    me "Юля?"
    "Позвал я негромко. Ответа не было, в кустах никто не зашуршал."
    me "Юля!"
    "Опять никого."
    dreamgirl "Надо было прихватить чего-нибудь пожрать. На призывное чавканье она точно выйдет!" 
    me "Юля! Ты где? Выходи!"
    me "Ну Юля!!!" 
    "Ответа по-прежнему не было. Где же её носит?"
    th "Придётся лезть под землю. Может, она в том бункере? Дрыхнет с удобствами на койке, например." 
    #внутри 
    "Люк нашёлся на своём месте, да и что могло с ним случиться? Поднатужившись, я откинул крышку и стал спускаться в подземелье. "
    dreamgirl "Свиток городского портала взял?"
    "Не та вселенная. Пешком придётся возвращаться."
    if alt_uvao_D5_sh_mines
        dreamgirl "Между прочим, можно было прямо из лагеря в шахту спуститься." 
        th "И заблудиться там без света? Нет, спасибо." 
        dreamgirl "Как видишь, всё равно пришлось под землю лезть. "
    else:
        dreamgirl "Разве что кошка тебя коротким путём довезёт"
    #тоннель
    "Идти по бетонному тоннелю было уже привычно."
    "Я не переставал ломать себе голову - зачем кому-то потребовалось строить здесь такое сооружение? А потом бросать его без присмотра."
    "На бомбоубежище не очень похоже, слишком мало места внутри…"
    dreamgirl "Может, там где-то есть ещё одна потайная дверь. За шкафами, например."
    th "Может быть. А за дверью - ядерный реактор и город-убежище, не просто так же там знак радиации намалёван." 

    # дверь в бункер
    "Вот и дверь, с тем самым знаком радиационной опасности. Заперто."
    "Я подобрал с пола кусок арматуры и {i}тихонечко{/i} постучался."
    me "Юля! Ты там? Открой! Мне нужно с тобой поговорить!"
    "В ответ - тишина. Только эхо гуляет по коридорам."
    dreamgirl "Зайдём? Хотя вряд ли она там спит, такой грохот и мёртвого бы поднял." 
    "Для входа по-прежнему были нужны двое. Без зажатой кнопки колесо лишь прокручивалось вхолостую, а чтоб дотянуться до кнопки, приходилось выпустить из рук колесо. И зафиксировать кнопку было нечем."
    "В раздражении я пнул дверь. Естественно, никакого эффекта это не возымело, кроме отбитой ноги."
    th "Придётся идти обратно. Может, получится влезть в шахты через люк под Гендой." 
    dreamgirl "И фонарь не забудь." 

    "Для очистки совести я постучал железякой ещё. Разумеется, никто не ответил. Можно было бы ещё расхреначить коробочку с кнопкой и попытаться замкнуть провода напрямую…"
    th "Или окончательно всё доломать, так, что дверь придётся открывать только динамитом. Ситуация пока не настолько критична." 
    #опять тоннели 
    "Нормальные герои всегда идут в обход."
    "Обратно по уже надоевшему туннелю, по осыпающейся ржавчиной лестнице, через личный тайный люк директора старого лагеря…"
    "Интересно, а в нынешнем лагере тоже есть такой тайный ход? Подвал под Гендой не дотягивает."
    #снаружи корпуса, ночь
    "Пока я шарился по подземельям, снаружи уже стемнело. Надо поспешить!"
    # тропа ночью
    "Спешить по ночному лесу выходило не очень. Всё какие-то ветки, корни, тропу еле видно!"
    th "Всё, больше из дома без рюкзака со снаряжением не выйду. Фонарь, нож, спички, верёвки, и всё такое. Если уж приходится лазить чёрт-те где, то хоть нормально подготовившись!" 
    dreamgirl "Вообще-то завтра уже отъезд. Поздновато ты решил Рэмбой заделаться." 
    dreamgirl "Хотя с твоим везением - стопудово ещё во что-нибудь встрянешь… Так что здравая мысль. Будь готов, пионер!"

    #аллеи ночью
    "В лагере вовсю громыхала музыка. Точно, дискотека же! Пионеры, да и вожатые тоже, отрывались на полную, за всю прошедшую смену."
    th "Блин. И как мне в таких условиях пролезть в подземелья, у всех на виду?! Там же весь лагерь собрался!"
    dreamgirl "Можно обрубить им кабель, и тогда не будет ни света, ни музыки. Топор только достать." 
    th "И меня тоже не будет, если я начну кабель топором рубить. Ещё идеи есть?"
    dreamgirl" Зато уйдёшь ярко, красиво!"

    #площадь с иллюминацией и силуэты пионеров (сделать из теней из Катавы) 
    "Среди толпы то тут, то там мелькали знакомые лица."
    "Вон Мику, прижав один наушник к уху, крутит ручки на пульте, одновременно что-то объясняя Ольге Дмитриевне."
    "Вон Ульяна подпрыгивает и размахивает руками, компенсируя неумение  - огромным желанием."
    "Вон Шурик с крайне сосредоточенным лицом отбивает на каменной плите подобие чечетки."
    "А вон - с ума сойти! - Электроник напряжённо танцует с Алисой. И рядом Виола, взявшая в оборот Саныча."

    th "Все веселятся. И никому нет дела до отсутствующей Слави. А она, наверное, сидит одна и смотрит в окно, слушает доносящуюся снаружи музыку, и ждёт меня."

    "Это было настолько неправильно, что напоминало дурной сон. Я должен всё как-то исправить!"
    "Должен пробраться в шахты и найти Юлю, и… По крайней мере, выяснить, её ли лап это дело, а там уже разберёмся."
    "Главное - подождать, пока народ станет расходиться, улучить момент и пробраться под решётку, не попавшись на глаза никому. Особенно - Ольге. А это значит - нечего торчать на одном месте!"

    #Карту лагеря открываем. 

    # где-то в районе домика Слави - сцена ревности Жени и Эла. 
    "На аллее послышались чьи-то шаги и голоса."
    el "Женя! Ну подожди!"
    mz "Отстань!"
    el "Ну постой!"
    mz "Отвяжись, сказала тебе!"
    "Жужелица явно спешила домой, а Сыроега безуспешно вился вокруг неё,забегая то справа, то слева."
    "Я предусмотрительно скрылся в листве."
    "В конце концов ему удалось поймать библиотекаршу за руку, и та остановилась."
    mz "Что ты пристал? Чего тебе надо вообще?! Иди, иди, там тебя ждут! Радуйся!"
    el "Да ты всё не так поняла…"
    mz "Всё я поняла! Всё видела! Давай-давай, топай к своей Двачевской!"
    # озверевший Эл
    el "Да не моя она!!!" with vpunch
    "Заорал Серёга."
    # испуганная Женя 
    el "Меня к ней вообще Виола отправила! Пригласить на танец! Всего-то!"
    mz "А ты и рад…"
    "Пробурчала она, но уже без прошлого задора."
    el "Если ты хотела - могла бы просто! согласиться! Я тебя сколько раз приглашал!"
    el "Ведёшь себя как… как… собака на сене!"
    # опять злая Женя 
    mz "Ка-а-ак ты меня назвал?!"
    el "Ой, да иди ты!!!"
    "Махнув рукой, Сергей повернулся и зашагал прочь. Жужелица осталась, кипеть и обтекать."

    th "Пойду-ка я отсюда." 
    #/обратно на карту 

    # пристань - пробегающая туда-сюда Лена. Ищет Семёна, поэтому прячемся где-то. 
    "Пристань. Почему бы и нет, какая разница, где время убивать?"
    th "Лодка мне, конечно же, без надобности, но можно хоть посидеть, отдохнуть."
    "Я забрался на понтон и присел на край. Лениво плещущая вода, звёздное небо. Воплощённое спокойствие. И даже музыка звучит здесь вполголоса."

    #шаги
    "Кто-то пробежал по аллее. Сначала туда, потом обратно. Остановился."
    un "Эй…"
    th "Лена? Что ей-то от меня надо?!" 
    un "Здесь есть… Кто-нибудь?"
    "Я замер, стараясь слиться с тенями. Не знаю, кто или что ей нужно, но выяснять не хочу. На ещё один чёртов квест у меня нет ни времени, ни сил!"

    "Лена вздохнула."
    un "Показалось… Опять."
    "Ушла. Для надёжности я выждал ещё несколько минут."
    th "Пора менять точку. Перебазироваться." 
    #/обратно 

    # стадион - Алиса там, курит. Без гитары, но в платье. 
    "Стадион? Почему бы и нет."
    "Вряд ли кто-нибудь предпочтёт бегать кросс вместо дискотеки. Или махать ракеткой. Или, не знаю, прыгать в скакалку? Короче, тут должно быть пусто."
    #грустная Алиса 
    "Должно быть. Но не было."
    "На ограде зрительских мест сидела Алиса. В том самом платье, в котором была на танцах."
    th "Она-то что здесь делает?!" 
    "Я резко дал задний ход, пока не заметили, и уже привычно укрылся в кустах."
    "Алиса подняла руку, и в её пальцах затеплился красный огонёк."
    th "Вот оно что. Пришла здоровью вредить. Туда, где ему обычно пользу наносят." 

    #Ульяна ехидная
    us "О, Алис! А ты чего здесь, дымишь? А где твой ка-{w=0.1}ва-{w=0.1}лер?" 
    # Алиса мрачная
    dv "Скажешь тоже, кавалер… Сбежал."
    us "Ты что, опять ему фонарь поставила?"
    dv "Надо было!"
    "Ульяна всплеснула руками и сокрушённо вздохнула."
    us "Ох, что ж от тебя женихи так и разбегаются? Ты бы поприветливее была, авось и нашёлся бы кто-нибудь… не особо наблюдательный, аха-ха-ха!"
    #Алиса в ярости
    dv "Так! Щас я кому-то…!"
    "Уже явно наученная горьким опытом, мелкая отбежала подальше."
    us "Эй, эй, маленьких бить нельзя!"
    dv "Можно!!! Когда сами нарываются!!!"
    "И Двачевская кинулась вершить справедливость. А Ульяна, соответственно, спасаться."

    #имитацию беготни спрайтов

    "Они сделали несколько кругов между сидений и слегка выдохлись."
    us "Не бей меня, я больше не буду!{w} Извини."
    #Алиса мрачная
    dv "Врёшь ты всё… Ладно уж."
    "Уже без опаски Ульяна села рядом со старшей подругой."

    us "Ну не грусти. Пойдём лучше Сыроежке отомстим?"
    us "Водой обольём, или в окно что-нибудь закинем?"
    us "Пойдём! Пойдём-пойдём!"
    "И мелкая потащила слабо упирающуюся Алису прочь."
    th "Бедный Сыроега. Не завидую я ему." 
    #/обратно 

# клубы - лезем внутрь, ищем фонарик. 
    "Обитателей клуба сейчас здесь точно не должно быть. Редкий случай!"
    "Я присел на крыльцо, под обрывком расписания."
    "Интересно, кстати, тут же должно быть много всяких кружков? Вот, например, шахматы…"
    "И внутри на стенах чертежи, которые к кибернетике никаким боком не относятся. Неужели наши гении всех выжили? Или я просто в неудачную смену попал?"
    th "Попал бы в обычную, сидел бы сейчас, учил бы дебюты и эндшпили. Планер бы клеил. Или ракету. На угольно-селитряном топливе…" 
    "Я зачем-то встал и подёргал дверь. Которая зачем-то открылась."
    dremagirl "Как удачно. Добро пожаловать, дорогой друг Семён!" 
    dreamgirl "Ну и ты тоже заходи."

    #внутри, темно
    "Судя по всему, наших кибернетиков добровольно-принудительно отправили развлекаться, и они не успели ни прибраться, ни запереть дверь. Или надеялись быстренько разделаться и вернуться обратно. "
    th "А это значит, что в любой момент могут вернуться хозяева. А я тут." 
    if alt_day2_club_join_cyb
        dreamgirl "Так ты же тоже этот самый, член. Имеешь полное право тут находиться." 
    else:
        dreamgirl"Скажешь, что приглядывал за порядком, и уже успел отогнать Ульяну. Дважды." 
    th "Нет уж, что-то не хочется мне с ними общаться. Найду фонарь - и свалю отсюда." 

    "Легче сказать, чем сделать. Обшаривать шкафы, забитые всяким хламом, да ещё в темноте…"
    th "Да тут сам чёрт ногу сломит!"
    # Миниигру в стиле "найди предмет", с хламом из Fallout Shelter 

    th "Вот он!"
    "И в этот момент на крыльце послышались чьи-то шаги. В панике я заметался по мастерской и шмыгнул в удачно попавшуюся на глаза подсобку."
    dreamgirl "И что теперь? Что случилось с планом сделать вид, что ты здесь по праву?" 
    th "Он обломался." 
    dreamgirl "И каков же теперь наш план?" 
    th "Ждать. И импровизировать." 
    "В мастерскую вошёл Шурик, включил свет, удивлённо глянул по сторонам и пожал плечами. Убрал связку ключей в карман и привычно направился к верстаку, на котором высилось нечто, накрытое тканью."
    th "Вот же приспичило ему… Леонардо Недовинченный!"
    "Шурик аккуратно свернул промасленную простыню. Покров скрывал под собой что-то, напоминающее человеческий торс."
    "Женский, если быть точным. Рядом лежали, по-видимому, конечности. Руки, ноги, голова."
    th "Нет, не Леонардо, а этот… Как его… "
    "Изобретатель меж тем установил торс вертикально, подобрал голову и принялся устанавливать её на место."
    th "Смотри, уши!" 
    dreamgirl "И вправду." 
    dreamgirl "Похоже, наш гений не просто так в подземелья полез. Интересный поворот…" 
    th "Думаешь, он там Юлю искал?"
    dreamgirl "Искал или нет - не знаю, но определённо нашёл." 

    sh "Ну чего же тебе ещё надо?!"
    "Я не сразу понял, что он обращается не ко мне, а к своему творению."
    sh "Почему же ты никак не работаешь… Кукла ты бездушная! Я на тебя столько сил положил! А ты всё та же кукла."
    "Он что-то нажал, и в глазах засветились лампочки. Уши дернулись вверх-вниз, голова медленно повернулась туда-сюда."
    rob "Бип. Сбой периферийных устройств."
    "Металлическим женским голосом произнёс робот."
    sh "Кто ты?"
    rob "Робот РКД модель один. Здравствуйте."
    sh "Кто ты?"
    rob "Робот РКД модель один!"
    "Второй раз ответ прозвучал более раздражённо."
    sh "Кто ты?"
    rob "Сколько можно спрашивать одно и то же?!"
    "Ничего себе. Он и вправду может даже робота задолбать!" 
    sh "Кто ты?"
    rob "Робот РКД модель один. Здравствуйте."
    "Вздохнув, Шурик снова отключил своё творение."
    sh "Случайности надо добавить. Может, тогда… Хоть похоже будет."

    "Он включил компьютер и стал подключать к роботу внушительный пучок проводов. Сейчас он с головой уйдёт в компьютер, и можно будет прокрасться наружу."
    sh "В любом случае получится лишь имитация жизни…"
    sh "Rак бы так заставить её обидеться самостоятельно…"
    sh "Базис настроения? Заинтересованность, раздражённость, ещё сколько-то осей… И для каждой - своя функция влияния… Сложно! Но это и хорошо…"

    "Под его бормотание я стал прокрадываться к выходу."

    sh "Эх! Вот был бы у меня квантовый генератор!…"
    th "Ничего себе, до чего техника тут дошла!" 
    dreamgirl "Ты, если собираешься с ним обсудить новейшие достижения электронной мегалоплазмы - то вылезай из-под стола. А если нет - то давай уже свалим отсюда!" 
    "Верно."
    "Я добрался до двери, постарался бесшумно её открыть. Почти получилось."
    #скрип двери 
    sh "Кто здесь?!"
    #улица
    "Но я уже был на свободе."

    #/обратно 

#остановка - там автобус фырчит под парами. Преодолеваем соблазн сесть и уехать к херам 

    th "Ворота? Почему бы и нет. Думаю, вряд ли кто-то захочет торчать тут, когда там, на площади, гремит музыка и все веселятся." 
    "Ворота были не заперты. Да и кому запирать-то - привратница сейчас сидит дома, ожидая, когда я решу её проблему."
    th "Да и от кого… Тут в округе километров на сто - ни единого посёлка! А для пионеров, желающих погулять по ночам, всегда есть дыры в заборе."
    th "Так что всё это запирание ворот - просто традиция. Протрубили отбой - закрыть ворота."
    th "Солнышко скроется - муравейник закроется. Мой дом - моя крепость, а ночь темна и полна ужасов…"

    "Продолжая упражняться в цитировании, я вышел за железные врата с вырезанной на них звездой. Вышел - и застыл."
#стоянка с автобусом
    scene bg ext_bus_night
    dreamgirl "Карета подана, мсье." 
    "Экипаж венгерского производства тихонько фырчал, добавляя к запахам ночи аромат мазутного дыма и металла. Дверь была заботливо приоткрыта, и из-за теней было трудно разглядеть, есть ли кто-то на водительском месте."
    "Откуда-то я знал, что стоит мне войти и занять место в салоне - автобус тронется и покатит прочь, сам, не требуя ни денег, ни билета, возвращая меня обратно."
    "Никаких тайн, никаких прыжков из зимы в лето. Обычная рядовая жизнь."
    dreamgirl "Как удобно. Поныл хорошенько о том, что тебе здесь не нравится - пожалуйста, ваш транспорт. Катитесь!" 
    th "Я ныл?" 
    dreamgirl "Ну не я же." 
    dreamgirl "Я бы, наоборот, остался. Такой веселухи там, у тебя, никогда не будет!" 
    dreamgirl "Но решать тебе." 

    "Вернуться обратно. Соблазн из тех, что выпадают не каждому. Как витязь на распутье. Направо пойдёшь - богату быть, налево - коня потерять. Прямо - головы не сносить."
    th "А как же Славя?"
    dreamgirl "Как-нибудь. Будет ждать, пока терпение не выйдет, до утра уж точно. А дальше - кто знает. Может, к Виоле придёт, и та что-то придумает. Может, её к ней приведут." 
    dreamgirl "Или будет притворяться дальше. Поедет в город, там как-нибудь разберётся. Научится быть тем, кем её видят - активисткой-спортсменкой-комсомолкой. Мало ли людей всю жизнь маску носят?"
    dreamgirl "В любом случае, твоей вины здесь нет. Можешь смело уматывать."

    "И верно. Я здесь не при чём. Я тоже жертва событий."
    "Разве я виноват, что именно меня закинуло сюда? Что здесь водится эта чертовщина, пространственная аномалия в образе девочки-кошки? "

    "Может, и не виноват. Вот только сейчас я уже впутался во всё это - глубже некуда." 
    "Если я хотел свалить обратно - надо было с самого начала ни во что не встревать, всех избегать… Да хотя бы попробовать утащить Славю с собой!" 
    "А теперь уже поздно." 

    "Я обессиленно махнул рукой, развернулся и вернулся обратно в лагерь. В голове раздался звон надтреснутого гонга и громовой голос."
    dreamgirl "ТЫ{w} СДЕЛАЛ{w} СВОЙ{w} ВЫБОР!!!" with hpunch
    th "А можно без вот этих спецэффектов?"
    dreamgirl "Можно, но надо же как-то развлекаться."

#/обратно 

# столовая - там сидит Юля и нагло что-то жрёт! Выход на дальнейший сюжет 
    scene bg ext_dining_hall_away_night
    "Возле столовой вкусно пахло свежей выпечкой, и пустой живот немедленно напомнил о себе."
#урчание
    th "А я, между прочим, пропустил и ужин, и полдник с этой беготнёй!"
    "Без особой надежды я решил проверить - вдруг там кто-нибудь есть? Кто-то, кто смог бы спасти меня и раздобыть что-нибудь пожевать."
    th "В первый день меня спасла Славя. А сейчас…" 
    dreamgirl "Ааа, так вот из-за чего ты так рьяно принялся решать её проблему!"
    dreamgirl "Правду говорят - путь к сердцу мужчины лежит через желудок." 
    "Я пожал плечами."
    th "Возможно. Если тебе так важно найти какой-нибудь шкурный интерес."
    scene bg ext_dining_hall_near_night
    "Окна были темны, дверь - закрыта, и лишь запах витает в воздухе. И никого, кто бы сжалился надо мной."
    th "Секундочку!" 

#Юля (цг?)
    show uv normal far
    "На скамейке за крыльцом восседала… Юля! С горкой свежих плюшек в подоле платья!"
    th "Нет, ну вы видели?! Сидит, понимаете ли, и жуёт!!! А я бегаю, ищу её, голову ломаю, как в шахты пробраться!" 

    "Кипя от возмущения, я подкрался к ней и запустил руку в её запасы, стараясь прихватить как можно больше!"
    show uv rage
    uv "Эй! Это моё!!!"
    "Я отскочил и впился зубами в одну из двух добытых плюшек."
    me "Феферь фоё!"
    th "Уммм, как же вкусно!"
    show uv sad
    "Она раздражённо фыркнула и вернулась к своему занятию."
    th "И чего возмущается, у неё там целая куча ещё осталась."

    "Я быстро разделался с добытым, заморил червячка, и решил перейти к тому, ради чего я тут, собственно, бегаю."
    me "Юль."
    show uv normal
    uv "Мм?"
    #убираем музыку для эффекта
    me "Что ты сделала со Славей?"
    th "Вот так прямо, быка за рога." 
    dreamgirl "И вправду, чего тянуть кота за хвост? Ба-дум-тсс!"
    show uv surprise
    uv "С кем?"
    me "Со Славей! Она теперь совсем не в себе!"
    "Юля шокированно вытаращилась на меня."
    show uv shocked 
    uv "А в ком?"
    me "Я в том смысле, что она совсем на себя не похожа. Ведёт себя странно, и вообще думает, что это я - творец всего!"
    show uv laugh
    "Она залилась смехом, словно я выдал необыкновенно удачную шутку."
    uv "Аха-хахаха! Как она здорово догадалась! Сама! Ахахахаха!"
    dreamgirl "Дожили. Кошка осваивает сарказм." 
    me "Юля, надо это всё исправить!"
    uv "Зачем? Она сама хотела."
    me "Что хотела?"
    uv "Быть правильной. Она меня поймала - и захотела."
    th "Захотела? То есть, поймала и высказала желание? А горящие глаза и острые когти - это к чему было?!"
    dreamgirl "Пентаграмма, наверное, была непрочной. Вот и вырвалась." 
    me "Юля. Как бы то ни было - это само по себе неправильно. Надо вернуть обратно."
    show uv dontlike
    uv "Не хочу! Она на меня напала и поймала. Я же не мышь!"
    uv "Не мышь?"
    me "Не мышь, не мышь, успокойся. Только…"
    uv "Значит, на меня нельзя нападать! Вот!"
    show uv normal
    "Она посчитала спор оконченным и вернулась к своему занятию. К поеданию плюшек и любованию пейзажем. "
    th "И как мне, спрашивается, её уговаривать? Какие аргументы предъявить?" 
    dreamgirl "Подкуп уже пробовали? Пообещай ей что-нибудь." 
    th "Например?" 
    dreamgirl "Припасы. Рыбы наловить, например, у тебя же есть леска с крючками." 
    dreamgirl "Или ночь любви. Зачем-то же она на тебя в бункере лезла?"
    "Я вздохнул. И чего я ожидал, дельного совета? Ха! "
    me "Юля! Ну хватит дурить!"
    th "Только ухом повела. Да сколько можно уже?"
    th "Одна бредит, другая глубокомысленные сентенции выдаёт! Задолбали!!!"

    "Я сдёрнул её за руку со скамейки и потащил через площадь."
    uv "Эй! Ты куда?"
    me "Туда!"
    uv "Зачем?"
    me "Надо!!!"
    th "Я тоже, блин, умею выдавать односложные, верные и нихрена не проясняющие ответы!" 
    scene bg ext_square_night_flash 
    "Дискотека уже завершилась. Наверное, поэтому никто нас не заметил, никто не заинтересовался, куда это я несусь, волоча за собой хвостатую легенду лагеря."
    "Оно и хорошо, не уверен, что смог бы ответить на неизбежные вопросы."
    dreamgirl "Слабоумие и отвага - твой девиз на сегодня."
    dreamgirl "Ты вообще понимаешь, чем рисковал?!" 
    dreamgirl "Эта твоя киса превратила нашего гения в берсерка, а активистку - в шизофреничку с навязчивой идеей!" 
    dreamgirl "А если Виоле верить, то атомная бомба по сравнению с ней - детская хлопушка!"
    th "Что, стрёмно? Виола говорила, что для меня она безопасна."
    dreamgirl "Наверное безопасна. А достоверно ничего не известно!"
    "Сказать по правде, я даже не успел об этом задуматься. Просто разозлился и стал действовать, как взбрело в голову."
    "А теперь уже остаётся только делать вид, что так и было задумано."

    #аллеи
    scene bg ext_houses_night
    "Вот и дом."
    "Я ещё раз попытался втолковать Юле, что от неё требуется."
    me "Юля. Ты должна сделать Славю нормальной. Как было."
    show uv surprise
    uv "Зачем?"
    me "Потому что так неправильно."
    uv "Но ведь она сама…"
    me "Не знаю, что она там сама, но это была ошибка! И её надо исправить."
    show uv dontlike
    uv "Но она ведь напала! Я не люблю, когда нападают!"
    th "Да чтоб тебя. Снова-здорово!" 
    me "Юля. Нападать - это плохо…"
    uv "Да! Особенно на меня!"
    me "… Но то, что ты с ней сделала - это ещё хуже!"
    show uv sad
    uv "Да?"
    me "Да! Поэтому давай всё исправим. Ты вернёшь Славе… ну, в общем, сделаешь, как было. А она перед тобой извинится."
    uv "Извинится?"
    me "Прощения попросит."
    uv "Это когда вот так?"
    show uv normal
    "Она протянула мне свободную руку и выставила мизинец. Наверное, подглядела у кого-то."
    uv "А зачем?"
    me "Извинится, говорю же."
    uv "Зачем? Зачем извиняться?"
    "Всё время забываю, что человеческие взаимоотношения для неё - тёмный лес. Даже хуже, потому как тёмный лес для неё - дом родной…" 
    me "Это значит, что кто-то поступил неправильно и сожалеет об этом."
    "Она озадаченно почесала затылок, но промолчала. Надеюсь, поняла."
    scene bg ext_house_of_sl_night
    "Я поднялся на крыльцо и занёс руку, чтобы постучать."
    me "Юля, а ты спрячься пока. Я тебя позову."
    "Лёгкий шорох за спиной - и вот я опять один."
#стук
    mz "Кого там принесло?!"
    "Поприветствовал меня раздраженный голос. Я почистил горло."
    me "Это Семён! Я к Славе!"
    sl "Это ко мне! Семён! Я иду! Сейчас! Подожди!"
    "Внутри, судя по звукам, началась какая-то суета, шум, грохот, потом раздались быстрые шаги и дверь распахнулась настежь."
    #scene дом с открытой дверью. Или с прозрачной, а под ним темный фон, в котором показываем Женю
    show sl smile pioneer
    "На пороге появилась Славя, переводящая дыхание. Изнутри послышалось:"
    mz "Эй, вы! Я, может, тут переодеваюсь!!!"
    dreamgirl "Как удачно мы с тобой зашли." 
    "Славя возмущенную соседку полностью проигнорировала, всё её внимание было приковано только ко мне."
    sl "Семён… Я так ждала… Даже вещи собрала. Вот!"
    "Она продемонстрировала мне плотно набитую сумку."
    sl "Я готова! Идём?"
    "В дверном проёме появилась голова Жени."
    show mz bukal pioneer far #behind bg
    mz "Вы куда это собрались? Начальство вас по головке не погладит за такое!"
    "Славя даже не обернулась. Я попытался как-то объяснить ситуацию."
    me "Женя, это не то, что ты подумала…"
    mz "Ага, это вы собираетесь ночью пойти цветов для гербария поискать."
    me "Да не…"
    "Библиотекарша возмущённо фыркнула."
    mz "Да мне-то какое дело! Что хотите - то и делайте!"
    hide mz with dspr
    "Она захлопнула дверь, и изнутри приглушённо донеслось:"
    mz "Придурки влюблённые, совсем с ума посходили! Чтоб вас всех…"
    "Кажется, объяснить не получилось. Да и черт с ним, не за этим пришёл! Пусть думает, что хочет."

    me "Славя, давай отойдём."
    th "Мало ли, как общение с Юлей пойдёт. Случайные свидетели нам точно не нужны." 
    sl "Хорошо! Куда угодно!"
    "Она радовалась, словно ребёнок, которому купили билеты в Диснейленд. Словно впереди - великолепное приключение, с исполнением самых заветных желаний."
    th "Прости, придётся тебя разочаровать."
    scene bg ext_path2_night 
    "Когда мы достаточно углубились в заросли, я негромко позвал:"
    me "Юля! Можешь выходить!"
    show sl surprise pioneer close 
    "Славяна удивлённо огляделась."
    sl "Юля? Какая Юля?! Здесь никого нет!"
    #затемненная Юля позади Слави
    show uv normal behind sl at cleft
    "Я приложил палец к губам и указал взглядом."
    me "Сзади тебя."
    "Недоверчиво глянув на меня, она всё же обернулась"
    sl "АЙ!!!"
    #эффект отпрыгивающей испуганной Слави
    show sl scared pioneer at right
    "и отпрыгнула на пару метров, чуть не сбив меня с ног."

    sl "Это…{w} Это…{w} господипомилуйспасиисохрани…"
    "Славя пятилась и шептала, пока не уперлась спиной в меня, и я на всякий случай подхватил её."
    show sl scared pioneer close at cright
    dreamgirl "Правильно, лови момент!"
    th "Идиот." 
    "Тем не менее я постарался разместить руки так, чтобы не допускать двусмысленостей. Но Славя так тряслась, что вряд ли что-то заметила бы."
    "А Юля наступала, грозно нахмурившись и воздев кулак с отогнутым мизинцем."
    #спрайт Юли нарисовать. Или цг в стиле  "Чужой и Рипли" 
    show uv dontlike close at left
    uv "Мирись!!!"
    "Славя в панике переводила взгляд с неё на меня и обратно - на маячащий перед лицом кулачок, но попыток вырваться и убежать, к счастью, не делала."
    uv "Мирись же! Давай!"

    me "Славя… Делай, как она говорит. Дай руку."
    "Негромко подсказал я ей на ухо."
    th "Только не надо спорить, пожалуйста!" 
    "Подсказка пришлась к месту. Славя неуверенно подняла руку, зацепилась мизинцем за Юлин…"
    uv "Вот! Я не мышь! На меня нападать нельзя!"
    uv "Поняла?! Не будешь?!"
    sl "Н-нет…"
    "Растерянно пролепетала девушка. Юля удовлетворённо кивнула и потрясла сцепленными кулаками."
    uv "Мирись, мирись, и больше не дерись, и не нападай, и не лови, и за хвост не дёргай!"
    "Кажется, Юля решила перечислить все возможные прегрешения, которые могли бы быть совершены."
    th "Или это Славя успела всё это совершить, в ту ночь с грозой? Впрочем, неважно, главное, чтоб в итоге всё сработало!" 
    "На протяжении всего перечисления Славя лишь слабо кивала, в такт движений рукой."
    uv "А если будешь драться, нападать, ловить и дёргать, я буду…"
    "Она замешкалась и повернулась ко мне."
    uv "Семён! А это как называется? Что я буду?"
    me "Кусаться?"
    show uv smile close
    uv "Не-е! Кусаться - это не так! И я не ем людей, поэтому кусаться не буду!"
    uv "А вот это - как? Когда вот так?"
    show uv dontlike close
    "Она нахмурилась и уставилась на меня. Понятия не имею, что она от меня хочет…"
    me "Не знаю… Но Славя, наверное, поняла, да?"
    "Я незаметно пихнул её в бок. Давайте уже в конце концов всё закончим, пожалуйста, и без лишних объяснений!"
    sl "Д-да…"
    uv "…То я буду - вот так! Вот!"
    "Юля в последний раз энергично встряхнула кулаком, разрывая сцепленные пальцы, и внезапно тюкнула Славю в лоб."
    uv "Бум!!!"
    hide sl with moveoutbottom
    "От этого лёгкого прикосновения Славя закатила глаза и начала оседать. Я едва успел её подхватить."
    me "Юля! Что ты сделала?!"
    show uv surprise close 
    uv "Как было. Когда она ещё не нападала."
    uv "Ты ведь просил."
    me "Да, но… С ней всё в порядке?"
    show uv normal
    "Юля пожала плечами."
    uv "Она как была. Просто спит."
    me "Спит? А когда проснётся?"
    th "И проснётся ли вообще…"
    th "Не-не-не, всё должно быть хорошо. Почему? Потому что мне очень хочется!" 
    uv "Проснётся…"
    "Юля задумалась, смешно наклонив голову, будто прислушиваясь к чему-то."
    uv "Сейчас!"
    "И исчезла."
    hde uv with dspr
    # цг с беспамятной Славей?
    "И, словно по команде, уютно устроившаяся в моих руках девушка приоткрыла глаза. Обвела взглядом нависающие над нами ветви, сфокусировалась на мне…"
    show sl surprise pioneer close
    "И удивлённо спросила:"
    sl "Ой! Где это я?{w} И ты… Кто ты?"
    "Прозвучало это относительно нормально. Правда, вот эта последняя часть…"
    me "Славя, ты как себя чувствуешь?"
    "Она пожала плечами."
    sl "Нормально… Вроде бы…"
    show sl normal pioneer 
    "Она встала, опираясь на меня."
    sl "Спасибо. А что случилось? И кто ты?"
    me "Ты что, меня не помнишь?"
    th "Вот ведь! Бегаешь, ищешь, выясняешь, разбивается в лепёшку, спасаешь, а тебе в благодарность - ты кто? Обидно, знаете ли!"
    me "Семён я. Совсем не помнишь?"
    "Славя виновато покачала головой."
    sl "Н-нет… Кажется, нет. Ты новенький? Недавно приехал?"
    me "В каком-то смысле. И скоро уже уезжаю."
    sl "Куда?"
    me "Как куда, вместе со всеми. Конец смены же."
    show sl scared pioneer
    sl "Как конец?! Сейчас же… Ещё неделя! Или…"
    dreamgirl "Просил сделать как было - вот тебе как было. И тебя она не помнит, потому что ты ещё не приехал." 
    dreamgirl "У тебя появилась возможность второй раз произвести первое впечатление." 
    "Ладно, могло быть и хуже."
    me "Знаешь, Славя, давай-ка дойдём до медпункта."
    show sl surprise pioneer
    sl "Думаешь, надо? Я, вроде бы, в порядке."
    me "Просто на всякий случай."
    sl "Ладно… Но что произошло?"
    me "Это будет сложно объяснить. Если вкратце… Ты повстречала кое-кого."
    me "И он… она, то есть… воздействовала на тебя. Можно сказать, загипнотизировала. Или заколдовала. Что-то в этом роде." 
    me "А сейчас всё вернулось обратно. И вот поэтому у тебя выпала целая неделя. Знаю, звучит фантастически…"
    sl "Да уж…"
    #аллеи
    scene bg ext_houses_night
    "Не знаю, поверила она или наоборот, посчитала меня психом. Да это, в общем-то, было и неважно."
    "Главное, никаких больше навязчивых идей про творца мира и прочих теорий заговоров. "
    th "Дойдём до Виолы, и дальше пусть она думает, что делать." 
    dreamgirl "Точно, думать - не твоя стихия." 
    "Путь до оплота здравомыслия мы проделали в молчании. Славя, кажется, всё собиралась что-то у меня спросить, но никак не решалась. Оно и к лучшему."

    #площадь 
    scene bg ext_square_night_party
    show sl surprise pioneer 
    sl "Семён… А ты ведь… Не просто так?"
    th " Всё-таки решилась."
    me "Ты о чём?"
    sl "Ну вот там, ты ведь не случайно рядом оказался? Я просто пытаюсь вспомнить, и мне кажется, что ты…"
    sl "Почему-то у меня такое чувство, что ты для меня очень важен. И я не понимаю, почему."
    th "Только не снова!" 
    sl "Мы ведь не…"
    "Она неопределенно повертела пальцами в воздухе."
    sl "…Парочка?"
    me "Ну что ты напридумывала!" 
    me "Нет, ничего такого. Честно, я просто случайно оказался рядом."
    dreamgirl "Упускаешь такую возможность! Пожмякать эти, как их…"
    th "Слушай, ну даже не смешно уже." 
    dreamgirl "Лавры, вот! Пожать лавры, за спасение девицы в беде." 
    show sl smile pioneer
    "Славя смущённо улыбнулась."
    sl "Да? Ну хорошо."
    sl "Было бы неловко, окажись мы и вправду парочкой."
    sl "Пришлось бы… соответствовать ожиданиям. Я, наверное, к этому ещё не готова."
    me "Нет, ничего такого! Мы просто друзья. Приятели даже, скорее."
    show sl sad pioneer
    sl "Поня-ятно…"
    "С каким-то разочарованием протянула она."
    dreamgirl "Ты - неисправимый неудачник." 

    #медпункт с горящими окнами. 
    scene bg ext_aidpost_night#_windows
    "В окнах горел свет, значит, не придётся ещё и доктора разыскивать по всему лагерю."
    #Тук-тук 
    cs "Войдите!"
    "Произнёс чрезвычайно чувственный голос."
    th "Тьфу ты. По-моему, она просто издевается!" 
    "Но выбора у нас не было."
    #внутри 
    scene bg int_aidpost_night
    me "Здрасьте…"
    show mt normal pioneer far at left
    show cs normal at cright
    "Внутри, кроме ожидаемой Виолы, была ещё и Ольга. Сейчас меня, наверное, будут воспитывать за пропуск концерта и дискотеки."
    "Отрядное мероприятие, коллектив, примерный пионер, бла-бла-бла…"
    show cs smile
    "Виола радостно осклабилась."
    cs "А вот и наши симулянты пожаловали!"
    "Я возмутился."
    me "Почему это сразу симулянты?"
    cs "Ну как же. Сказались больными, сбежали с концерта…"
    mt "Пришлось последний номер снимать!"
    # Славя краснеет 
    cs "…А до медпункта так и не дошли. Какой вывод? Симулянты и нарушители распорядка!"
    th "Что-то наша доктор Виола сегодня чересчур весёлая, даже для неё. Они тут тоже, что ли, расслаблялись?" 
    dreamgirl "А Ольге, значит, ещё не налили, раз она рычит?" 
    cs "Ну и как погуляли, успешно? С чем пожаловали?"
    me "Да, вполне. Могло бы быть намного хуже, но, к счастью, всё обошлось. Хотя ваша консультация бы не помешала."
    cs "Умеешь ты заинтриговать, пионер."
    hide mt with dspr
    cs "Ну что ж, проходите, присаживайтесь, рассказывайте тёте доктору, что вас беспокоит."
    show sl tender pioneer far at cleft
    "Славя, которая на протяжении нашей пикировки смущённо помалкивала, присела на кушетку. Я остался стоять - в конце концов, не меня же осматривать будут!"
    show cs normal
    "Виола вопросительно подняла бровь."
    cs "Итак?…"
    me "Ну, в общем…"
    th "Как бы так сформулировать, чтоб и объяснить, и лишнего не сболтнуть?" 
    me "Славя случайно попала под воздействие одной нашей знакомой…"

    show mt angry pioneer far at right
    mt "Семён! Тебя же предупреждали!"
    me "Ещё неделю назад! Я тут не при чём!"
    show mt surpirse pioneer far
    me "А сейчас она сделала всё, как было. Правда, с одним побочным эффектом."
    cs "Только одним?"
    me "Кажется. В общем, память о последней недели просто выпала. Полностью."
    cs "Вот как… Славя, всё так?"
    sl "Да, кажется."
    cs "И как ты себя чувствуешь?"
    show sl sad pioneer far
    "Славя неопределенно пожала плечами"
    sl "Вроде бы нормально. Устала только очень, и голова побаливает."
    sl "Спать хочется…"
    cs "Спать - это прекрасно. Давай-ка ты никуда больше не пойдёшь, а ляжешь прямо здесь, в изоляторе."
    cs "А я тебе выдам кое-что, чтоб спалось лучше."
    sl "Ладно… Наверное, вы лучше знаете."
    hide cs
    hide sl with dspr
    "Виола встала и поманила Славю за собой, в закрытую часть."
    "Меня не позвали, и я сел на ту же кушетку. Ноги от многочасовой беготни гудели, да и вообще мне тоже не помешает поспать."
    show mt angry pioner at center
    "Ольга долго сверлила меня хмурым взглядом, потом всё-таки заговорила."
    mt "Не хочешь чего-нибудь добавить к своему рассказу?"
    me "Например…?"
    mt "Например, почему ты сразу не привёл Славю к Виоле? Или хотя бы не рассказал мне? Что за самодеятельность?!"
    me "Вообще-то я пытался. Забыли?"
    me "И вы мне сказали, чтоб я не выдумывал."
    show mt surprise pioneer
    mt "Да? Действительно…"
    show mt angry pioneer
    mt "Значит, надо было доходчивей объяснять!"
    th "Это я ещё и виноват, выходит." 
    me "Хорошо, Ольга Дмитриевна. В следующий раз я обязательно объясню доходчиво, так, чтоб даже вы поняли."
    "Ольга на секунду смешалась, но тут же снова перешла в нападение."
    mt "И потом, ты ничего не рассказал о своей роли в этой истории."
    me "Потому что не было никакой роли."
    mt "Хочешь сказать, ты просто так, бесцельно шлялся где-то весь этот день?"
    me "Примерно так."
    show mt normal pioneer
    mt "Темнишь, темнишь, Семён. Всё само собой случилось, а ты вообще не при чём."
    mt "Учти, тебе ещё отчёт писать! И в нём должно быть изложено всё, в подробностях! Так что темни, не темни, а правда вылезет."
    me "А можно не сегодня? Вырубаюсь уже…"
    show mt laugh pioneer
    mt "Ладно, ладно, уговорил. Только не забудь ничего!"
    "Я кивнул."
    me "Кстати, пока не забыл. Там, в рощице, славины вещи…"
    show mt surprise pioneer
    mt "Какие ещё вещи?"
    me "Не знаю, сумка с чем-то, одежда всякая, наверное. Надо бы подобрать, чтоб не потерялись."
    show mt laugh pioneer
    mt "Вот! И будет мне ещё рассказывать, что он тут не при чём! А из-за него пионерки свои вещи по лесам разбрасывают!"

    show cs normal far at cright
    cs "Почему бы и не поразбрасывать, ради нашего пионера-то? Повод вполне уважительный."
    "Раздалось от дверей."
    show mt normal pioneer
    mt "Как там Славяна? Что с ней?"
    cs "Ничего серьёзного на первый взгляд, всего лишь переутомление.{w} Дала ей успокоительного, завтра будет спать почти до самого отъезда."
    cs "Так что тебе, Оля, завтра предстоит организовывать отъезд самостоятельно, спихнуть не на кого."
    mt "Почему это не на кого? У меня, кажется, есть кандидат. Ответственный, надёжный, готовый помочь."
    "Она уставилась на меня, не оставляя никаких сомнений, кто именно этот кандидат. Я лишь обречённо застонал."
    show mt smile pioneer
    mt "Да не расстраивайся ты так, ты вполне справишься!"
    me "А сейчас-то я вам больше не нужен? Могу идти, или вы дальше будете издеваться?"
    show cs smile
    cs "Только если ты не хочешь сам немного полечиться…"
    me "Нет, спасибо."
    cs "Тогда можешь быть свободен."
    show mt normal pioneer
    mt "Только, пожалуйста, очень тебя прошу, чтоб больше без происшествий!"
    th "Как будто я их специально устраиваю." 
    "Я кивнул и поспешил удалиться, пока меня ещё в чём-нибудь не обвинили."


    #дом
    scene bg ext_house_of_mt_night_without_light
    "Дом встретил меня тёмными окнами, даже лампа над дверью не горела."
    th "Сейчас как зайду, как упаду на подушку, и кааааак засну! Аж до самого обеда!"

    "Предвкушая долгожданный отдых, я нашарил в кармане ключ, и только тогда заметил на крыльце… Тело."
    #цг с дрыхнущей на крыльце Леной в стиле "ирландской йоги" 

    th "Да сколько уже можно?! С ума посходили!" 
    "Беззвучно возопил я. Лена, уютно свернувшаяся на крыльце, никак не отреагировала."
    dreamgirl" И что теперь делать будем? Обратно в медпункт, или попробуем разбудить?" 
    th "Ничего." 
    dreamgirl "Серьёзно?" 
    th "Ни-че-го!" 
    th "Ночь тёплая, максимум, что ей грозит - комары покусают. А если вернётся Ольга - вот пусть она и выясняет, что происходит и почему ей не спится у себя!"
    th "А мне теперь запрещено встревать в происшествия!{w} Поэтому я буду СПАТЬ! "

    scene bg int_house_of_mt_night
    "На цыпочках, аккуратно придерживая личинку замка, чтобы не дай бог не стукнуло, я отпер дверь, проскользнул внутрь и так же тщательно заперся."
    th "Хватит с меня подвигов на сегодня. Всех подряд спасать - спасало отвалится!"
    "В темноте покидал одежду куда придётся и упал мордой в подушку, как и обещал себе. Уммм, кровать, четвероногая любовь моя…"

