# ЮВАО концовки - нейтрал и нейтрал-бэд 
# TODO: скрипт! И мне не нравится кошкоэнд, больно уж трешовый.
init:
    $ alt_uvao_replay_prologue=0
    
label alt_uvao_ending_neutral_bad:

    $ alt_uvao_replay_prologue=1
    # В пролог в зависимости от флага делаем ветвление.
    # для 0 - полностью авторский текст с Шизой
    # для 1 - вместо Шизы кусок текста, и после звонящего мобильника ставим return
    # для 2 - нейтрал-ветка продолжается дальше - см ниже
    
    # кусок текста вместо утренних препирательств с Шизой: {
    Конечно же ничего не произошло. Да и не могло произойти. Со мной никогда ничего не происходит. И уж тем более я не смог бы повлиять ни на какие внешние факторы своего жалкого существования. Я ничтожество.
    В сущности, если я исчезну, то никто не обратит на это внимания. Никто не зайдёт проверить, всё ли у меня в порядке. Никто не будет меня искать, если я перестану отвечать на немногочисленные телефонные звонки.
    # }
    call alt_day0_hikka_prologue # вход в дрищепролог, сразу после дисклеймера про злую волю автора.
    
    # возвращаемся после звонка мобильного
    Кому я там ещё понадобился ? А с другой стороны – не всё ли равно ? Пусть себе звонит, пока не надоест. Я уселся в кресло и закурил сигарету, наблюдая как телефон на столе вибрирует, мигает и всячески подаёт сигналы о том, что Семён Персунов ещё не окончательно потерял связь с внешним миром. Ничего, мы это исправим.
    Моя проблема в том, что я сам себя загнал в рамки, за которыми начинаешь панически бояться любого общения. Социофобия в чистом виде. Кажется я скоро откажусь и от общения в интернете. Всё равно, в последнее время я просто сидел перед экраном и не делал ничего. Вообще. Просто по привычке.
    Телефон потрезвонил ещё немного и замолк.
    Грязно-серый день плавно сменялся тёмно-синим морозным вечером. А я всё также сидел в кресле и размышлял. Обстановка располагала. Такие вечера всегда задевают что-то в памяти, вытаскивая казалось бы уже похороненные воспоминания.
    Единственное, что ещё не стало серым, и выглядит так же ярко, как и в детстве, когда не было ни вопросов, ни дилемм.
    Между тем за окном уже окончательно стемнело.
    Итак, кажется у меня образовался свободный вечер. Но занять его абсолютно нечем. Да и вообще, в последнее время для меня потеряло смысл само понятие времени суток. Как собственно и дней недели. Наверное я и за календарём скоро перестану следить.
    Темно, светло, темно, светло. Не имеет значения. В любое время суток моё существование остаётся жалким и ничтожным.
    Кажется мне нужно придумать себе какое-нибудь хобби. Желательно, чтобы можно было из дома не выходить.
    Но выходить всё-таки иногда придётся. Чтобы удовлетворять мои минимальные насущные потребности. Такие например как покурить. А прошлая сигарета была последней.
    «Но если есть в кармане пачка сигарет, значит всё не так уж плохо на сегодняшний день» А если пачки сигарет нет ? Значит соответственно всё плохо. Да, бард знал, о чём писал.
    Со вздохом я поднялся. Пустая смятая пачка полетела в мусорку. Ну пойдём прогуляемся до магазина. Благо под домом есть круглосуточный.
    Облачившись в старое пальто, оставшееся ещё с институтских времён, я выбрался на улицу. Шапку одевать не стал. Не люблю я их, да и до магазина идти совсем ничего и замёрзнуть я не успею.
    За день снегопад притих, остался лишь только холодный декабрьский ветер. Не люблю холод. Да и жару собственно тоже. И вообще, в мире настолько мало вещей, которые попадали бы в категорию «мне нравится», что их можно пересчитать по пальцам одной руки.
    Дверь магазина открылась передо мной, пропуская внутрь.
    - Здрасьте.
    - Да. Как обычно. Блок.
    - Всё шутите. Восемнадцать есть. С прошлого раза вроде не помолодел.
    - Спасибо. До свидания.
    Бессмысленный обмен любезностями закончен. Эх, где мои восемнадцать лет. Наверное там же где и последующие за ними десять.
    Подходя к подъезду, я заметил какой-то пищащий комочек. Маленький рыжий котёнок, едва заметный в этой промозглой декабрьской мгле. Весь дрожа и нахохлившись от холода, он сидел и тихонько мяукал.
    Это было не мяуканье матёрых дворовых котов - громкое, требовательное, вызывающее. «Помогите. Я погибаю. Мне голодно и холодно» - вот что слышалось в этом жалобном плаче маленького пушистого существа. Он просто тихонько мяукал, а я вдруг почувствовал острый приступ жалости.
    В сущности, у нас с ним есть что-то общее. Мы оба не можем понять смысл своего существования – вроде мы есть, но мы никому не нужны. Что-то здесь не сходится.
    Я достаточно тепло относился к животным. В том числе и к дворовым. Я даже иногда подкармливал кошек, живущих по соседству.
    Кошки всегда представлялись мне интеллигентными существами с хорошими манерами. Вообще кошка очень интересный зверь. Она не будет притворяться, в отличии от человека. Если вы ей нравитесь, она покажет это сразу. Если же нет, то вам тоже будет это сообщено в самой недвусмысленной манере.
    У меня никогда не было домашнего животного. Я был для этого слишком безответственным – о себе никогда не мог толком позаботиться, не то, чтобы ещё о ком-то.
    Может быть стоит попробовать сейчас ? Я ведь как раз подумывал о каком-нибудь хобби, способном скрасить моё бесцельное существование.
    Я присел на корточки рядом с котёнком. Весь дрожа, он с тоской и надеждой взглянул на меня.
    -Ну что, брат, пойдём домой ?
    Я поднял котёнка на руки и сунул за пазуху пальто.
    - Видишь ли, в чём дело, брат.
    Продолжил я, обращаясь к темноте у себя за пазухой. Оттуда сверкнули зелёными огоньками два глаза.
    -У нас с тобой похоже много общего. Ты и я одиночки. А одиночкам надо держаться вместе.
    - Ладно, пошли греться, мыться и есть. У меня для тебя даже где-то было вкусное молоко.
    #####################
    # timeskip
    #######################
    По лестничной площадке поднималась девушка. Судя по саквояжу с красным крестом, это была врач. Было заметно, что она слегка нервничает. Девушка только недавно закончила медицинский институт и это был её первый самостоятельный обход.
    Возле двери одной из квартир она остановилась и, достав какие-то бумаги, пробежала их глазами.
    История болезни пациента: Персунов Семён Семёнович. 34 года. Есть склонность к алкоголизму и депрессиям. Утверждает, что является котом в человеческом обличье, а сообщил ему об этом его домашний кот, а заодно научил кошачьему языку. Практически всё время пациент проводит в компании кошек, живёт с ними, в том числе и сексуальной жизнью. Влюблён в тигрицу из зоопарка, которую надеется однажды освободить. Шестилетнее лечение не дало результатов. Для общества не опасен. Изоляция не требуется, но рекомендовано оставить под регулярным наблюдением участкового врача.
    Девушка задумалась и вздрогнула, когда открылась дверь соседней квартиры.
    - Скажите, а Персунов Семён здесь живёт ?
    Спросила она вышедшую пожилую женщину. Та любопытством взглянула на девушку.
    - Здесь, милая, здесь.
    - А ты кто же ему будешь ?
    - Я ваш новый участковый врач. За ним ведь постоянное наблюдение нужно, вот меня и отправили.
    - Скажите, он не опасен ?
    - Что ты, милая. Он тихий, спокойный. Слова от него никогда плохого не услышишь. Не то, что этот Ерохин с шестого этажа.
    И она погрозила кулаком куда-то наверх.
    - А что кошек у него много, да и что же с того ?
    Продолжила она, спускаясь по лестнице.
    - У меня вот тоже две. Что же, меня тоже теперь в психушку.. ?
    Девушка, постояв ещё немного, наконец решилась позвонить в дверь. Раз, другой, третий. И когда она уже собиралась уходить, замок щёлкнул.
    Дверь открыл высокий худощавый мужчина с усталым и слегка безумным взглядом. Внизу в ряд вслед за ним в дверь высунулось несколько кошачьих голов. Некоторое время он разглядывал девушку, явно обратив внимание на необычный цвет её глаз. Внешность девушки действительно была необычной – один глаз красный, другой синий.
    С: - Да, что вы хотели ?
    Спокойно спросил он.
    В: - Здравствуйте, Семён. Меня зовут Виолетта и я ваш новый участковый врач..
    С: -А, знакомиться пришли.
    Перебил мужчина.
    С: -Сколько вас тут уже было таких. Когда вы меня уже в покое оставите.
    С: -Ну заходите тогда, чего на пороге стоять.
    Помедлив, врач зашла в квартиру и сразу обратила внимание на большое количество кошек и котов самых разнообразных возрастов и расцветок. Притом, что удивительно, в квартире совершенно не было никакого запаха, обычно присущего кошачьим.
    С: -Юля, брысь отсюда. Уступи место гостье.
    Семён согнал с кресла дремавшую там рыжую кошку.
    С: Присаживайтесь… Виола.
    Сам он устроился на диване напротив. Кошка по имени Юля тут же запрыгнула ему на руки и пристально разглядывала девушку зелёными глазищами.
    Виола достала блокнот с ручкой и приготовилась делать записи.
    В: -Вы назвали кошку Юлей ?
    Семён улыбнулся какой-то странной улыбкой.
    С: -Да, мне так захотелось. Сам не знаю, почему. С неё, собственно, и началось моё увлечение кошками. Она у меня первая.
    С: -Как-то шёл из магазина, увидел возле подъезда бездомного котёнка, взял его домой. Потом второго, третьего.. Люблю я их.
    С каким-то нажимом в голосе произнёс он. Во взгляде Семёна было что-то странное и это настораживало врача.
    В : «Не забывай, что у пациента психическое расстройство»
    Напомнила себе Виола.
    В: -Ну давайте пообщаемся.
    Мужчина кивнул, поглаживая кошку.
    Врач сверилась с историей болезни.
    В: –Скажите, а ваши отношения с кошками..не выходят за рамки дозволенного ? А то тут у меня записано..
    Явно смущённо спросила она.
    Семён усмехнулся.
    С: -Ну что вы… Виола. Какие могут быть отношения с кошками. Кошки это кошки, а люди это люди. Не знаю, откуда это взялось.
    Он немного подумал.
    С: -Хотя конечно многие кошки очень даже привлекательные особы..
    Врач вздрогнула от его изменившегося голоса.
    В: -Скажите, а ваши навязчивые идеи.. Про зоопарк.
    С: -Нет, нет, что вы.
    Снова перебил мужчина.
    С:- Это всё в прошлом. Я отказался от мысли подвергать опасности жизни других людей из за своей сиюминутной прихоти.
    Кивнув, Виола сделала пометку в блокноте.
    В: -А что насчёт кошачьего языка ?
    Мужчина явно оживился.
    С: О, с этим у меня полный порядок. Мы с кошками отлично понимаем друг друга.
    С: -Меня, собственно Юля научила.
    Чуть смущённо и шепотом признался он.
    Глаза его нездорово блестели.
    С: -Только вы ей не рассказывайте. Она не любит, когда я про это рассказываю.
    Виола улыбнулась, хотя было заметно, что ей явно неуютно под пристальным взглядом двух пар глаз – кошки Юли и Семёна.
    В: -Ну и наверное последний вопрос. Здесь ситуация какая-то совсем необычная.
    Снова странная улыбка.
    С: -Наверное про моё человеческое воплощение кота ?
    Врач кивнула.
    С: -Ну скажем так, да – я кот. Я живу сам по себе. Я не подчиняюсь человеческим законам. Зато я могу подчинять других кошек своей воле. Они слушаются меня. Хотите посмотреть?
    И он, поднявшись с кресла, скомандовал.
    С- Ко мне, мои верные подданные !
    И тут, со всех уголков квартиры, в комнату стали сходиться кошки. Кошки приходили, садились в ряд и смотрели на гостью. Их было так много, что Виола испугалась.
    В: -Вы знаете, я наверное пойду.
    С: -Куда же вы ? Вы ведь ещё не видели самого интересного.
    С ухмылкой продолжил Семён.
    В: -Нет, нет, вы знаете, меня пациенты другие ждут.. И вообще у меня дела !
    Она опрометью бросилась к дверям.
    С: -Заходите ещё… Виола.
    Вслед ей раздавался дьявольский смех Семёна.
    ------------------------------------------------------------------------------------------------------------------------------
    Доктор Виола вышла из подъезда и глубоко вдохнула морозный воздух.
    «Да, с такими пациентами мне сталкиваться ещё не приходилось. Жаль, но скорее всего, этот больной безнадёжен»
    «Но не бойся ничего. Я буду присматривать за тобой… Семён»
    Она улыбнулась своим мыслям и растворилась в вечерней декабрьской мгле.
    Ачивка «Рекомендовано усыпление»    
    
label alt_uvao_ending_neutral:

    $ alt_uvao_replay_prologue=2
    # для 2 - нейтрал-ветка. Вместо реплик Шизы - смутные воспоминания о Совенке
    # и return после падения в реку
    # кусок текста вместо утреннего диалога с Шизой:
    "Я закрыл глаза и перед глазами вдруг очень явственно встала картинка массивных железных ворот с надписью «Совёнок» и два изваяния по разные стороны от ворот - пионер и пионерка, застывшие в гипсе. Это ещё что такое? Пионерлагерь? Откуда у меня такое воспоминание? Я никогда в жизни не был в пионерлагерях. И уж, тем более, в пионерлагере «Совёнок»." 
    
    # вместо реплики после телефонного разговора:
    "Домики-бочки, дорожки из бетонных плит и, насколько хватает глаз, всюду зелень. Пионерские лагеря.. Припоминаю нечто подобное. В конце концов, я из поколения последних октябрят, и о таких вещах как пионерлагеря, всё-таки знаю. А почему не был..? Наверное я уже тогда был социофобом."
    "Ладно, это всё лирика."
    
    #кусок с Шизой, копающейся в памяти пропускаем
    
    # кусок текста вместо гонева Шизы про копейщков:
    "И снова какое-то забытое воспоминание. Мне семнадцать лет. Я в толпе пионеров стою на площади на линейке. Перед нами выступает девушка. Совсем молодая, ненамного старше меня и других ребят. Её лицо кажется мне смутно знакомым. Как, впрочем, и лица некоторых ребят рядом."
    "И всё-таки – откуда эти воспоминания ?"
    "Автобус тронулся. Стекло дрожало от работающего двигателя, но меня такие вещи редко заботили - прижав голову к стеклу, я устроился поудобнее и бездумно изучал жизнь бетонного муравейника."
    "По ту сторону стекла остался морозный город и люди, которых я сначала боготворил, потом ненавидел. Теперь они стали мне безразличны. Бесконечный поток серых клонов с одного конвейера, с утра до ночи, люди, машины, люди, машины."
    "Хотя с некоторыми людьми я всё же поддерживал контакты. И среди них даже были девушки. Вот например девушка с фиолетовыми волосами, Лена, кажется. Необычный цвет. Хотя мне нравится. Она была ненавязчивой и очень стеснительной."
    "При встрече со мной она всегда молчала, видимо по причине своей застенчивости. Ну и хорошо. Не люблю, когда навязываются. Наверное поэтому мне было легко находиться с ней рядом."
    "В отличие от другой девушки, рыжеволосой. Как же её там звали..? Я напряг память. Алиса ! Точно, Алиса. О, эта была просто оторвой. Я всегда, при встрече с ней, опасался какой-нибудь подколки, могущей задеть мою честь, а то и здоровье."
    "Ну и остальные девушки – русоволосая Славя, болтушка Мику с длиннющими ультрамариновыми хвостами волос, огненно-красная девочка-огонёк Ульянка…"
    "ЧТО !!! Откуда у меня все эти воспоминания ?! ОТКУДА ?!"
    "Я что, схожу с ума ? Откуда эти несуществующие воспоминания ? Я никогда не был ни в каком лагере. У меня никогда не было таких знакомых девушек."
    "Надо успокоиться. Дышать ровно и глубоко. Вдох-выдох, вдох-выдох."
    
    call alt_day0_hikka_prologue # вход в дрищепролог, сразу после дисклеймера про злую волю автора.  

    # возврат после упавшего в реку автобуса.
    "И в тот самый момент, когда чёрные языки воды впервые лизнули подошвы моих ботинок - я, наконец, всё вспомнил!"
    "Лагерь ! Лагерь «Совёнок» ! Я ведь был там целую неделю. Все эти девочки, я их всех знаю. И знаю очень хорошо. И вожатую, выступавшую на площади, тоже знаю. Ольга Дмитриевна. Как я мог забыть. Мне ведь это не приснилось. Я на самом деле был там. Таких снов не бывает."
    "Так, быстро надо что-то решать. Я видимо сделал что-то не так в прошлый раз, проснулся у себя дома и меня снова закинуло в эту пространственно-временную петлю, в эту смертельную точку невозврата. Но видимо, мне дали шанс сё исправить, раз я всё вспомнил."
    "Как там было в прошлый раз ? Воспоминание, которое меня вытащило из тонущего автобуса. Надо повторить. А вода всё ближе. Видимо, моё индивидуальное восприятие времени, обусловленное приближающейся смертью, изменилось, потому что всё происходило как в замедленной съёмке."
    "Ворота, лагерь, Юля… Юля ! Она меня вытащила. Спасла от неминуемой гибели. И сейчас спасёт."
    "Из ничего соткалась картинка с воротами, ведущими, в пионерский лагерь и на переднем плане грустная Юля."
    "Я смотрел на Юлю и что было сил фиксировал её в сознании."
    "По ногам хлестнуло льдом, а в наушниках играл чёртов «пастух», и я был частично там - в прошлом, в памяти, но всё ещё на сиденье автобуса."
    "С: «Юля ! Помоги мне !»"
    "Юля продолжала грустно смотреть на меня и молчала."
    "С : «Юля ! Это же я, Семён ! Забери меня с собой. Мне так хочется в лето !»"
    "Ю: «Я не могу. Ты упустил свой шанс»"
    "С: «Нет-нет ! Я всё исправлю ! Я всё осознал и понял !»"
    "Ю: «На самом деле ты не хочешь возвращаться»"
    "Похоже это конец."
    "Я сам творец своих мыслей и желаний. Я выдумал себе идеальный мир. И даже в нём я умудрился всё испортить. Единственное, что было действительно идеально – это образ девушки передо мной."
    "Она иногда снилась мне. Иногда. Всю мою жизнь."
    "Звала с собой."
    "Но причины возвращаться из пелены сна всегда находились. Всегда. До сегодняшнего дня."
    "Видимо, я и вправду безнадёжен."
    "Девушка, что снилась мне всю мою жизнь, печально улыбнулась на прощанье, и горькая слезинка замёрзла на идеальной щеке."
    "Сначала перестала иметь значение боль."
    "Потом пропали саднящие ощущения в ссаженных щеках и бульканье в лёгких."
    "Мороз перестал иметь значение."
    "И… Темнота накрыла меня с головой ледяным тяжёлым одеялом."
    return