label alt_day0_start:
    play sound sfx_wind_gust
    scene intro_dr with dissolve
    pause(1)
    menu:
        "Так всё и начиналось.":
            $ plthr = u"Дрищ"
            play sound role_drisch fadein 3
            $ renpy.pause(4, hard=True)
            with fade2
        "Но я не уверен точно.":
            jump alt_day0_prologue
    $ make_names_unknown()
    $ routetag = 'prologue'
    $ prolog_time()
    scene black with fade
    show credits timeskip6 with dissolve2:
        pos (200,540)
label alt_day0_hikka_prologue: # дополнительный вход в Дрище-пролог
    $ renpy.pause(4, hard=True)
    scene anim prolog_2
    with dissolve2
    window hide
    play music tilltheend fadein 3
    "Я снова кричал во сне."
    "Кричал, кричал — и проснулся от собственного крика, не от страха, не от звука, а от ощущения, мало похожего на человеческие переживания."
    "Я был богом умирания - там, по ту сторону невероятно голубых грёз, желаний и веры в светлое - пускай не «завтра» - пускай, «через годик»."
    "И как любой бог, я был всесилен - я мог кинуться под колёса громыхающей неподалёку электрички, наглотаться цианидов, выдавить себе между глаз девять миллиметров…"
    "Rinse and repeat."
    "Между той и этой стороной разница не очень большая."
    "Но её оказалось достаточно для того, чтобы пустить по бесконечной петле существование одного ничем не примечательного молодого человека."
    "О котором и пойдёт здесь рассказ."
    window hide
    scene anim 3 _prologue with fade
    window show
    "Глаза снова отказывались ловить фокус после пробуждения, и пришлось несколько минут сидеть, мотая головой."
    th "Мне двадцать восемь."
    "Напомнил себе я."
    th "Это Земля, Санкт-Петербург образца конца две тысячи четырнадцатого года."
    th "Моё имя - Семён. Персунов. {w}Звучит как анекдот, но прошу винить в этом маму с папой."
    "Лиха беда начало. После прогона базовых систем пришло время диагностики систем посложнее."
    window hide
    scene bg semen_room with dissolve
    window show
    "Поднявшись, я пошатнулся от скрутившей слабости и был вынужден опереться о стенку."
    "Но утро уж вступало в свои права - не прошло и двух минут, а я добрался до ванной."
    play sound sfx_open_water_sink
    play sound_loop sfx_water_sink_stream fadein 1
    "Отражение в зеркале ожгло угрюмым взглядом и отвернулось."
    th "Я - дизайнер-фрилансер. Дальше должны идти пафосные слова о невероятно опасном задании и сверка часов, но нет. Ничего такого."
    "Я играл в эту игру каждое утро - приблизительно в три часа пополудни, воскресая ото сна носом в клавиатуру."
    "Или как белые люди - поднимаясь с кровати, из-под покрывала, которое последний раз стирали во время бенефиса Горби."
    "В последнем случае всё было ещё хуже, там ещё и дышать трудно было."
    "Но температурный шок позволял справиться приблизительно с половиной сопряжённых с пробуждением проблем."
    stop sound_loop
    play sound sfx_close_water_sink
    pause(1)
    "Комната хранила следы былой роскоши - начиная со свисающих унылыми буклями обоев, которые у меня так и не дошли руки подклеить, заканчивая километровыми мотками пыли на четырёх плафонах люстры."
    "Всё равно я её никогда не включаю. Не уверен даже, работают ли лампочки."
    "В целом берлога полностью отвечала ожиданиям того, как должно выглядеть место обитания человека компьютеризированного, одинокого."
    "По правде сказать - половину местного бардака можно было бы вытряхнуть отсюда меньше чем за десять минут. Просто разбросав всё по пакетам из пакета с пакетами."
    "Но это же не наши методы. Протоптанные тропинки между кучами мусора, вещами, огрызками техники и журналами - вот наше всё."
    
    "Зато идеально чистым был компьютерный стол."
    "Сразу видно - кто-то залил пивом клавиатуру. Или это был чай?"
    "Почесав затылок, я был вынужден констатировать, что всё-таки пиво. Хвала рандому за бессмертных «рейзеров»!"
    "На экране замерла заставка телетрансляции - откуда-то, кажется, из Японии, где в очередной раз вытащили на сцену несуществующих человечков и заставили их петь."
    "И было это форменным идиотизмом, чувствовать себя человеком без существования, когда несуществующие человечки собирают стадионы."
    "Не к месту вспомнилось вдруг, что термин «хикикомори» придумали тоже японцы."
    "Кстати, наш «Юбилейный» японцы обещали посетить с концертами в феврале, и ни в чём они не виноваты, японцы-то, хоть и придумали этот чёртов термин."
    "И никто не виноват."
    "Может, даже и я."
    
    "Я вернулся к монитору и, подкурив предпоследнюю, с грустью констатировал, что, похоже, придётся выбраться на улицу — если верить календарю, на дворе было воскресенье, а по воскресеньям ближайшая онлайн-доставка почему-то наотрез отказывалась от вебмани в качестве оплаты."
    "За монитором был пустынный секторок рунета, в котором я обычно обитал - парочка форумов, две или три доски объявлений, сборщик почты да неизменный ютьюб."
    "Социальные сети я презирал как лишнее напоминание о том, кто я есть."
    "За окном была такая же пустынная улица - почему-то в три часа дня, в предновогоднее воскресенье никто не спешил по магазинам."
    play sound_loop sfx_street_traffic_outside fadein 2
    "Только неизменный трафик, борющийся с ледяным ветром с Невы - иногда мне казалось, что это некий конвеер, везущий на себе игрушечные модельки машинок, за рулём которых никого нет."
    "Включая солипсиста, так легко было представить, что во всём мире теперь только так - промозгло, холодно и приглушенно-шумно."
    me "Хотя, я его никогда и не выключал."
    "Поведал я своему отражению в стекле."
    me "Я закрою глаза, и ты исчезнешь. Конец света через три… два…"
    window hide
    show blinking
    pause (3)
    if alt_uvao_replay_prologue == 1 : # ЮВАО, нейтрал-бэд
        "Конечно же ничего не произошло. Да и не могло произойти."
        "Со мной никогда ничего не происходит. И уж тем более я не смог бы повлиять ни на какие внешние факторы своего жалкого существования. Я ничтожество."
        "В сущности, если я исчезну, то никто не обратит на это внимания. Никто не зайдёт проверить, всё ли у меня в порядке. Никто не будет меня искать, если я перестану отвечать на немногочисленные телефонные звонки."
    elif alt_uvao_replay_prologue == 2: # ЮВАО, нейтрал
        "Я закрыл глаза и перед глазами вдруг очень явственно встала картинка массивных железных ворот с надписью «Совёнок» и два изваяния по разные стороны от ворот - пионер и пионерка, застывшие в гипсе."
        "Это ещё что такое? Пионерлагерь? Откуда у меня такое воспоминание? Я никогда в жизни не был в пионерлагерях. И уж, тем более, в пионерлагере \"Совёнок\"." 
    else: # Обычный пролог.
        dreamgirl "С мягким знаком."
        me "А это обязательное условие?"
        dreamgirl "Ну… А почему ты не паникуешь? Почему не орёшь «кто здесь» или хотя бы не констатируешь с умным видом «делириум тременс»?"
        me "А это поможет?"
        dreamgirl "Нет, но мне будет приятно."
        me "Знаешь, что ещё приятно?"
        dreamgirl "Знаю, милый."
        dreamgirl "Только не предлагай мне это, у меня ни рук, ни… Скажи, а почему ты дома сидишь? Вечер-то какой! Айда гулять!"
        me "У меня утро."
        "Я прислонился лбом к холодному стеклу. Всегда хотелось иметь альтер-эго, эдакое раздвоение личности, с которым можно будет поболтать."
        "Но с безжалостной честностью посмотрев на себя со стороны, понимал - придушу через полчаса общения. "
        dreamgirl "Можешь попробовать меня придушить, милый."
        "Хихикнул голос в голове."
        me "А если я головой стукнусь как следует?"
        dreamgirl "Тоже вариант! Тебе, понятно, не повредит, зато кровообращение стимулируешь."
        dreamgirl "Дальний угол хорош! Там ещё гвоздь такой уместный, можно ещё глазом на него. Так что на счёт «три»…"
        me "Да иди ты!"
        dreamgirl "Как будто тебе есть что терять."
        "Презрительно фыркнул голос."
        dreamgirl "Прямо беда с тобой таким - со всех сторон цивилизованная амёба с нулевой пассионарностью."
        me "Это как?"
        dreamgirl "Если к тебе дьявол припрётся покупать душу - ему будет нечего предложить взамен. Ты же не хочешь ничего!"
        me "Да нет! Я, вот, в феврале хочу апгрейд сделать…"
        dreamgirl "Ага, и вечером сыру купить. Тьфу. Страстишки!"
        "Презрительно фыркнул голос."
        dreamgirl "Нужно что-то такое, от чего дух захватывает и слёзы на глаза наворачиваются! Заветное!"
        dreamgirl "У тебя есть заветная мечта?"
        me "Как бы мне от тебя избавиться? Вот моя заветная мечта."
        dreamgirl "Сходи, прогуляйся."
        me "Что, поможет?"
        dreamgirl "Нет. Но хотя бы голову проветришь, пустую, звонкую. Иди!"
        me "Откуда ты взялся…взялась…взялось? Тебя не должно быть, я все симптомы душевных болезней наперечёт знаю."
        dreamgirl "А ниоткуда. Я, конечно, польщён…польщена…польщено тем, что ты так старательно навязываешь мне некую личностность. {w}Но давай не будем. И прекрати уже со мной вслух разговаривать, совсем уже долбанулся, сам с собой в квартире вслух разговаривает."
        dreamgirl "Что только люди подумают…"
        th "Прочь из моей головы. Тебя нет."
        "Мгновенно перешёл на внутренний диалог я."
        dreamgirl "Правда? А мне показалось, что это {i}тебя{/i} нет. Я как в том романе Адамса - за каким-то хреном произнесённое слово, причём, судя по всему, матерное, которое очень многим не понравилсь. Волеизъявление."
        dreamgirl "А вот тебя - нет. Ты лёг спать шесть лет назад после автокатастрофы и до сих пор не проснулся, так и спишь носом в клавиатуру."
        dreamgirl "Хотя вру - спишь ты с восемнадцати лет, когда впервые купил себе этот чёртов ПК. Ты, кстати, в курсе, что через пять месяцев будет круглая дата вашего трогательного сожительства? Как отмечать будете? Ты подаришь ему кольцо? Срок уже приличный, пора решаться."
        th "Вон, я сказал."
        dreamgirl "Обойдёшься. Твоя иллюзия существования поддерживается только потому, что мне этого хочется. {w}Если я закрою глаза, всё, что у тебя останется - это пыль на ладонях, взлетающая облачком, когда бог дважды хлопнет, выключая свет, который, вроде бы и «да будет», а по факту никому нафиг не сдался."
        dreamgirl "На самом деле достаточно просто признать это. {w}Понимаешь? Перестать пыжиться своим никому не нужным «я», избавиться от очередной иллюзии - деда Мороза нет, зубной феи нет, правды тоже нет."
        dreamgirl "Последний логический шаг, Сём. Признай, что и тебя - тоже нет."
        "Я подавил желание вскочить и, подвывая от ужаса, побежать куда-то - слишком уж точно били бессвязные реплики моей новообретённой шизофрении."
        "Между тем за окном уже окончательно стемнело."
        $ set_mode_nvl()
    
    scene bg semen_room_window 
    play sound_loop sfx_street_traffic_outside fadein 2
    play music ringtone
    $ renpy.pause(3)
    window show
    if alt_uvao_replay_prologue == 1 : # ЮВАО, возвращаемся на нейтрал-бэд.
        "И как будто, в ответ на мои мысли, на столе зажужжал мобильный, привлекая моё внимание."
        return
    else:
        "Мобильный на столе зажужжал, привлекая моё внимание."
    
    "Спасаясь от почти ощутимого треска реальности по швам, я вцепился в трубку."
    stop music fadeout 2
    "- Да."
    "- Проснулся."
    "- Нет."
    "- Не занят."
    "- Приехать? А зачем?"
    "- Да, конечно."
    nvl clear
    "Я снова кидаю взгляд на заснеженные многоэтажки."
    "- Буду через час."
    window hide
    $ renpy.pause(4)
    stop sound_loop fadeout 3
    play ambience ambience_cold_wind_loop fadein 3
    $ set_mode_adv()
    "Почему бы и нет? По большому счёту я бы провёл воскресенье, в очередной раз обновляя страницу какой-нибудь доски или форумчика, споря с какими-нибудь анонимными пользователями на темы, которые забудутся быстрее, чем закроется вкладка."
    if alt_uvao_replay_prologue == 2 : #ЮВАО нейтрал
        "Домики-бочки, дорожки из бетонных плит и, насколько хватает глаз, всюду зелень. Пионерские лагеря… Припоминаю нечто подобное."
        "В конце концов, я из поколения последних октябрят, и о таких вещах как пионерлагеря, всё-таки знаю. А почему не был…? Наверное я уже тогда был социофобом."
        "Ладно, это всё лирика."
    else:
        dreamgirl "Новые впечатления, как-никак. Подождут твои анонимусы, никуда не денутся."
    "Затычки с Мэнсоном в уши, пальто на рыбьем меху на плечи - и навстречу декабрьскому вечеру."
    window hide
    scene anim intro_1 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_2 
    with fade
    play sound sfx_intro_bus_stop_steps
    $ renpy.pause(3, hard=True)
    scene anim intro_3 
    with fade
    
    $ volume(0.3, 'music')
    play music prologue_1 
    $ renpy.pause(3, hard=True)
    scene anim intro_4 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_5 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_6 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_8 
    play sound sfx_intro_bus_stop_sigh
    with fade
    $ renpy.pause(3, hard=True)
    window show
    if alt_uvao_replay_prologue == 2 : #ЮВАО нейтрал
        pass
    else:
        "Мало-помалу удалось привести голову в порядок, раскидать по дальним тёмным полочкам всё, что наговорила посетительница моей черепной коробки."
        "Разумеется, иллюзию существования пришлось убрать в самый дальний чулан - по соседству с мечтами юности, планами молодости, грёзами детства."
        "Теперь само воспоминание о визите…"
        dreamgirl "Не расслабляйся. Твоя остановка, а тебе ещё полчаса жалеть себя, пока автобус подойдёт."
        th "Слушай, я же наушниками заткнул уши."
        "Я переключился на мелодию потяжелее, но это не сильно помогло."
        th "От тебя что, совсем спасения нет?"
        dreamgirl "Почему же. Есть. Начни жить. Пойми одно, милый, я - это твоя жажда общения, иллюзия истосковавшегося по бытию сознания. Сделай вдох поглубже, стань самодостаточным."
        th "А нельзя без этого?"
        "С тоской спросил я."
        dreamgirl "Можно. Есть один экспресс-метод…"
        th "Какой?"
        "Внутренний голос промолчал, вместо ответа вытаскивая на поверхность непонятные, ненужные воспоминания."
        dreamgirl "У тебя тут интереснее, чем у родителей на балконе!"
    window hide
    $ renpy.pause(3)
    scene anim prolog_2 
    with fade
    $ renpy.pause(1)
    $ set_mode_nvl()
    window show
    play music lonesome_shepherd
    "Моё первое двенадцатое апреля - то самое, которое я запомнил."
    "Меня куда-то ведёт отец, держа за руку, из динамиков вещает Левитан, а с экрана машет рукой какая-то улыбающаяся женщина с орденами."
    "И не верится в то, что это космонавт - они же небожители. Они обитают там, где кончается воздух и начинается Вселенная. Как эта маленькая женщина может быть тем серебристым чудом, что показывали всем нам в фильмах?"
    "А в детской голове срабатывает механизм, и я вдруг отчётливо понимаю, что если эта маленькая женщина смогла - то и я смогу. Надо только…"
    "Что именно «только» я так и не узнал, после того, как меня завернули на медицинской комиссии - наследственность, прости Господи."
    "С мечтой пришлось попрощаться."
    nvl clear
    "Или вот ещё - жестяные рупоры репродукторов прибиты за держащие скобы наживую, на стволы сосен, и вниз от моего места идёт склон, по которому я всегда перемещался только бегом."
    "Наступая между корней сосен, между камнями - приветом от ледника, что гостил здесь сорок тысяч лет назад - я лечу вниз по склону. Мне немного грустно от того, что все мальчики нашли здесь себе кого-то, кто хотя бы не отказывается танцевать с ними."
    "Но здесь и сейчас меня переполняет счастье, которое возможно только в детстве!"
    "А из динамиков льётся бравурный марш из «Индианы Джонс», и до гран-при нашего оркестра конкретно с этим маршем немногим менее полугода - слепящие софиты в глаза, а я стою, расставив ноги и держу трубу перед собой, выдавая фортиссимо, так как микрофоны во все времена презирал - что мне, дыхалки не хватит, сыграть так, чтобы меня услышали в зале?!"
    "В мире существует всего две вещи, позволяющие услышать глас божий - это орган, причём, непременно церковный..."
    "И симфонический оркестр."
    "А я служу концентратором этому голосу."
    nvl clear
    "Под абсом стучит жёсткими краями наст, и равновесие держится уже на автомате, и выбившиеся из-под шапки кудряшки выглядят возмутительно безалаберно, и хочется их поправить. Девичий смех. Улыбка."
    "Слёзы."
    "«Ты можешь переезжать ко мне, если захочешь»."
    "Малая Охта, южные горы, тебе не стоило сидеть на доске, притворяясь, что просто отдохнуть присела."
    "Я же равнодушный, я всегда мимо прохожу - что меня дёрнуло, спрашивается?"
    "Пустая квартира. Пустые надежды."
    show uvao_d1 at left with dspr
    "Она была слишком похожа на ту, что снилась мне."
    "Снилась всю мою жизнь."
    "Похоже, я ошибался."
    nvl clear
    scene anim prolog_1
    "Я сам выбрал эту петлю - я не люблю людей. Не поддерживаю контакты, не пью на корпоративах и не трахаюсь там же, не выбираюсь на чатовки и вечера встречи выпускников."
    "Если мы с вами учились в одном классе или школе - то я не стану орать при встрече «здорово, браток»."
    "Нет, я вздрогну и перейду на другую улицу. Вы прошлое. Вы меня раздражаете."
    nvl clear
    "По ту сторону невидимой границы осталось обеспечивающее существование эго, оставляя меня одного, обнажённого, против простого вопроса - а действительно ли я так нужен?"
    "Нет, не так. Вопрос звучит по-другому."
    "Не «кто я» или «где я». А «зачем я»?"
    "Хоть кто-нибудь почешется, если меня однажды не станет?"
    nvl clear
    window hide
    play sound sfx_intro_bus_engine_start
    $ renpy.pause(3)
    play sound_loop sfx_intro_bus_engine_loop fadein 3
    $ set_mode_adv()
    scene anim intro_9 
    with fade2
    window show
    "Не сойти с ума. Не сойти с ума."
    "В голове это крутилось как надоедливая песенка всё то время, что я устраивался в салоне подошедшего автобуса марки «ЛиАЗ» — старинного, таких на маршруте, пожалуй что и не встретишь. "
    window hide
    $ renpy.pause(2)
    scene anim intro_10 
    with fade
    play sound sfx_intro_bus_door_open
    $ renpy.pause(3, hard=True)
    scene anim intro_11 
    with fade
    $ renpy.pause(1, hard=True)
    stop sound_loop fadeout 4
    scene anim intro_13 
    with fade2
    $ renpy.pause(3, hard=True)
    scene bg intro_xx 
    with fade
    stop ambience fadeout 2
    play sound_loop sfx_bus_interior_moving fadein 4
    window show
    th "Я — Персунов Семён, двадцать восемь лет, фрилансер."
    if alt_uvao_replay_prologue == 2 : #ЮВАО нейтрал
        "И снова какое-то забытое воспоминание. Мне семнадцать лет. Я в толпе пионеров стою на площади на линейке. Перед нами выступает девушка. Совсем молодая, ненамного старше меня и других ребят. Её лицо кажется мне смутно знакомым. Как, впрочем, и лица некоторых ребят рядом."
        "И всё-таки – откуда эти воспоминания?"
        "Автобус тронулся. Стекло дрожало от работающего двигателя, но меня такие вещи редко заботили - прижав голову к стеклу, я устроился поудобнее и бездумно изучал жизнь бетонного муравейника."
        "По ту сторону стекла остался морозный город и люди, которых я сначала боготворил, потом ненавидел. Теперь они стали мне безразличны. Бесконечный поток серых клонов с одного конвейера, с утра до ночи, люди, машины, люди, машины."
        "Хотя с некоторыми людьми я всё же поддерживал контакты. И среди них даже были девушки. Вот например девушка с фиолетовыми волосами, Лена, кажется. Необычный цвет. Хотя мне нравится. Она была ненавязчивой и очень стеснительной."
        "При встрече со мной она всегда молчала, видимо по причине своей застенчивости. Ну и хорошо. Не люблю, когда навязываются. Наверное поэтому мне было легко находиться с ней рядом."
        "В отличие от другой девушки, рыжеволосой. Как же её там звали..? Я напряг память. Алиса! Точно, Алиса. О, эта была просто оторвой. Я всегда, при встрече с ней, опасался какой-нибудь подколки, могущей задеть мою честь, а то и здоровье."
        "Ну и остальные девушки – русоволосая Славя, болтушка Мику с длиннющими ультрамариновыми хвостами волос, огненно-красная девочка-огонёк Ульянка…"
        "ЧТО?!! Откуда я это помню?! ОТКУДА?!"
        "Я что, схожу с ума? Откуда эти несуществующие воспоминания? Я никогда не был ни в каком лагере. У меня никогда не было таких знакомых девушек."
        "Надо успокоиться. Дышать ровно и глубоко. Вдох-выдох, вдох-выдох."
    else:    
        dreamgirl "Повтори это ещё сорок четыре раза. Кстати, ты знаешь, что повторение одного и того же слова пару десятков раз резко обесценивает его смысловую нагрузку?"
        dreamgirl "Вот, например, твоё «фрилансер». Давай-ка произнесём его вслух! Фрилансер, фрилансер, фрилансер… «Фри» означает свободу или отсутствие чего-то."
        dreamgirl "Смотри-смотри - чайлд-фри. Или даже шуга-фри. А может, нуб-фри? Ты же заядлый просиживатель штанов за игрушками, должен знать."
        dreamgirl "А «лансер» - это от английского названия лёгкого пехотного копья. Ты же в курсе, что первые копья представляли собой обтёсанную жердину, всё предназначение которой было сбросить всадника с лошади? Это японцы извращались со своими нагинатами, за каким-то фигом удлинняя рукоятки мечей до совершенно неприличных размеров."
        dreamgirl "Как считаешь, может комплексы виноваты? По поводу размеров."
        th "Заткнись, пожалуйста."
        dreamgirl "Как это? Мы же только начали! Итак, ты у нас свободный носитель лёгкого копья."
        dreamgirl "Звучит! Фрилансер, фрилансер, фрилансер. А может, нет? Может, это не фрилансер, а ланс-фри? Человек, свободный от тягот службы и ношений всяких длинных тяжёлых штук?"
        dreamgirl "Ну, свободный художник же! Ландскнехт. Чёртов наймит, согласный подставлять свои мягкие места под удары за звонкую монету."
        dreamgirl "Тебе тоже в серебрениках платят? Кстати, всегда было любопытно, а тридцать серебряников - это сколько по нынешнему курсу доллара?"
        th "Заткниииись."
    "Чтобы отвлечься, я опять принялся считать количество смертей на квадратный метр."
    "Это всегда помогало расслабиться - вот, на пересечении с Народной опять оторвало вывеску, она как в «Пункте назначения» легко прошьёт и автобус, и мою голову, если вдруг перестанет держать последний болт."
    "А вот парные высотки на свайном первом этаже - такали мы эти сваи, такали, но случись что - и близнецы сложатся на проезжую часть, в труху сминая всех, оказавшихся на линии огня. "
    "А вот и моя любимая - да такая, что дух захватывает - мы въехали на горб Володарского моста, и если вдруг что…"
    "Что именно «вдруг что» я так и не понял - но, судя по тому, как развернулся и кувыркнулся мир за окном, мы только что исполнили па на гололёдице."
    stop sound
    stop sound_loop
    window hide
    scene black with fade
    window show
    "В ушах что-то тонко пищало, вхолостую ревел двигатель, где-то на заднем плане дьявольски хохотом заливалась Шиза. И длилось это бесконечные несколько секунд."
    play sound sfx_shoulder_dive_water
    if alt_uvao_replay_prologue == 2 : #ЮВАО, уходим на нейтрал
        return
    "И в тот самый момент, когда чёрные языки воды   впервые лизнули подошвы моих ботинок - я, наконец, уступил просьбам - и  засомневался в реальности происходящего."
    window hide
    play ambience ambience_camp_center_night fadein 2
    scene bg ext_camp_entrance_night 
    show owl :
        pos (931, 88)
    show uvao_d1 at left
    show prologue_dream 
    with fade3
    window show
    "Из ничего соткалась картинка с какими-то воротами, ведущими, судя по надписи,  в пионерский лагерь - на переднем плане грустная шатеночка, о чём-то меня спрашивающая."
    "И лицо её было знакомое-знакомое..."
    "А вода всё ближе, и так обидно будет не услышать хотя бы  последнее в жизни."
    "Я оборачиваюсь к незнакомке и что было сил фиксирую её в сознании."
    th "Так о чём…"
    stop sound_loop fadeout 3
    show credits timeskip_come with dissolve2:
        pos (747,105)
    $ renpy.pause(3, hard=True)
    scene bg ext_camp_entrance_night
    show uvao_d1 at left
    show prologue_dream
    th "Так это… ты?!"
    dreamgirl "Нет, но… Решайся."
    "По ногам хлестнуло льдом, а в наушниках играл чёртов «пастух», и я был больше там - в прошлом, в памяти, чем реально на сиденье автобуса."
    "А потому ничуть не удивился, когда картинка сменилась - всё верно, мне же так хотелось в лето!"
    "Тихая, тёмная южная ночь у ворот с надписью «пионерлагерь»."
    "Красивая незнакомка."
    "И полное отсутствие стимулов возвращаться - реальный мир только что себя закопал — а я вдруг понял, откуда знаю эти правильные черты лица, эти огромные глаза."
    th "Я же сам их создал! Плоть от плоти, это мои сны - чуть ли не с младенчества."
    "Она иногда снилась мне. {w}Иногда. {w}Всю мою жизнь."
    "Звала с собой."
    "Но причины возвращаться из пелены сна всегда находились. {w}До сегодняшнего дня."
    "Так что…"
    window hide
    $ renpy.pause(2)
    menu:
        "Пойду, милая.":
            $ alt_day0_prologue = True
            "Конечно, пойду."
        "Нет, я останусь здесь":
            "Оставаться в местной реальности было чревато не самой красивой смертью."
            "А значит - welcome to эскапизм."
            "Я выдохнул и протянул ей руку."
    "В голову пришло, что это нелогично было - изо всех сил заставлять меня думать и делать, а в такой ответственный момент подсунуть иллюзию."
    scene black
    stop ambience
    "Темнота накрыла меня с головой ледяным тяжёлым одеялом."
    $ renpy.pause(3, hard=True)
    stop music fadeout 5
    $ renpy.pause(3)
    $ volume(1.0, 'music')
    jump alt_day0_opening
    
label alt_day0_start_herc:
    play sound mpbt fadein 0
    scene intro_herc with dissolve
    pause(1)
    menu:
        "Так всё и начиналось.":
            $ plthr = u"Герк"
            play sound role_herc fadein 3
            $ renpy.pause(4, hard=True)
            with fade2
        "Но я не уверен точно.":
            jump alt_day0_prologue
    $ make_names_unknown()
    $ routetag = 'prologue'
    $ prolog_time()
    $ herc = True
    scene black with fade
    show credits timeskip6 with dissolve2:
        pos (200,540)
    $ renpy.pause(4, hard=True)
    window hide
    scene black
    window show
    play music music_list["pile"] fadein 3
    me "Остынь, чувак!"
    me "Слышишь? {w}Здесь никто не хочет проблем. {w}Ты не хочешь? {w=.4}Вот и я не хочу."
    voice "Да мне похрену, что там хочешь! {w}Слышь, шалава, не слыхала? {w}Бутылку на прилавок, руки на прилавок, и быстро, ля!"
    me "Чувак! Расслабься, прошу! {w}Сейчас тебе Зинка выбьет бутылку. Ведь выбьешь, правда?"
    "Помертвевшая от ужаса Зинаида судорожно кивнула, не сводя расширившихся зрачков с «Макарыча» - ствола нелетального, понятно, на районе пофорсить, да по банкам пострелять."
    "Но если попадёт в голову или шею…"
    "Надо просто выбрать момент и вырубить его максимально быстро и безболезненно."
    "Пять метров… {w}Четыре… {w}Три…"
    "Дистанция прямого рывка."
    "Я ускорился."
    play sound makarych fadein 0
    window hide
    stop music
    scene anim prolog_3 with fade
    window show
    play music music_list["torture"] fadein 3
    "В этот раз всё было не так, как надо."
    "День, падла, не задался с самого утра. Начать можно с яишенки - из двух последних одно оказалось тухлым, но я об этом узнал, когда оно уже оказалось в сковородке."
    "Дальше - хуже, {w}дура-кошка нажралась ватных палочек и заблевала весь ковёр, {w}лифт сломался и пришлось топать вниз семь этажей."
    "Плюс ещё близкий ко мне вестибюль метро закрыли, как результат - я добираюсь до работы на автобусе."
    window hide
    scene anim intro_1 
    with fade
    $ renpy.pause(3, hard=True)
    window show
    "Вечер, воскресенье, 28 декабря 2014 года."
    window hide
    scene anim intro_2 
    with fade
    play sound sfx_intro_bus_stop_steps
    $ renpy.pause(3, hard=True)
    scene anim intro_3 
    with fade
    
    $ volume(0.3, 'music')
    play music prologue_1 
    
    window show
    "Издержки работы охранником. {w}Как глаголил мой батя - если мужчина ничего не умеет, он идёт работать охранником. {w}А если женщина ничего не умеет - она идёт на панель. Суть одна - спать за деньги."
    window hide
    $ renpy.pause(3, hard=True)
    scene anim intro_4 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_5 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_6 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_8 
    play sound sfx_intro_bus_stop_sigh
    with fade
    $ renpy.pause(3, hard=True)
    window show
    "Питерская зима втрое паскуднее оттого, что Нева то и дело норовит вскрыться и окутать стылой промозглой сыростью всё в диаметре километра. {w}И не спасают ни снаряга сноубордиста - каюсь, увлекался по молодости лет - ни дорогие перчатки."
    window hide
    scene anim intro_7 
    with fade
    $ renpy.pause(3, hard=True)

    scene bg bus_stop 
    with fade
    window show
    "Меня подводит пальто на рыбьем меху."
    "Такая ерунда.{w} Штаны и перчатки я себе купил, а на хорошую куртку уже не хватило."
    "А потом стало плевать."
    "Вообще на всё. Когда ты работаешь два через два, и единственный твой собеседник - это донянчивающая третье поколение Зинаида Матвеевна, поневоле начинаешь тупеть."
    window hide

    $ renpy.pause(3)

    scene anim prolog_2 
    with fade
    $ renpy.pause(1)

    "Впрочем, мне с моими тремя классами церковно-приходской школы и тупеть-то некуда."
    "Наезжать на завкафедрой не стоило, ломать нос комвзвода не стоило, даже с тем упырём кавказской национальности, что въехал на моём горбу в рай и обеспечил мне второе условное, можно было договориться полюбовно."
   
    window hide

    scene black 
    with fade3
    $ renpy.pause(2)
    play ambience ambience_cold_wind_loop fadein 3
    window show
    
    "Меня портит моя вспыльчивость. Ну, когда-то она называлась так…"
    window hide
    show blinking  with dissolve
    scene anim intro_2 
    $ renpy.pause(3.5)

    window show
    "Ещё до того, как мне стало плевать на всё." 
    window hide

    $ renpy.pause(3)

    scene stars 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim stars_3 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim stars_1 
    with fade
    $ renpy.pause(3, hard=True)

    stop sound_loop fadeout 4

    window show
    "Небо сегодня какое свежее. Какое равнодушное."
    "Хотя глаз привычно уже отмечает окружение, выбирает возможные линии огня."
    "И открытая площадь оценивается лишь как «а это место неплохо простреливается!»"
    "Тараканы? Закидоны? Ага."
    "Проблема в том лишь, что в этом мире больше не осталось нормальных людей в традиционном смысле этого слова."
    window hide

    $ renpy.pause(3)

    scene anim intro_7
    with fade
    $ renpy.pause(3, hard=True)
    scene bg bus_stop 
    with fade
    $ renpy.pause(3, hard=True)

    window show
    "Я ходил по утрамбованному снежку возле остановки, безуспешно пытаясь согреться."  
    "Почему всё так плохо, господи? {w} Неужели, я так много грешил?"
    window hide
    $ volume(1.0, 'music')
    play music music_list["a_promise_from_distant_days_v2"] fadein 3

    $ renpy.pause(3)

    scene anim prolog_2 
    with fade
    $ renpy.pause(1)

    $ set_mode_nvl()

    window show
    "Родился-учился-женился?{w} Можно сказать и так."
    "Да нет, начало-то у меня было не самое безнадёжное - мы все стартуем с какой-то ступеньки."
    "Школа с медалью, первый в классе, куча грамот и дипломов.{w} Да только подтереться этими дипломами хотели все, кому я их показывал. Ни спортивные, ни музыкальные, ни какие-либо другие мои детские успехи не оказались востребованы."
    "Поэтому они так и остались пассивным багажом в моей памяти."
    nvl clear
    window hide

    $ renpy.pause(3)

    window show
    "И я честно старался учиться. {w} Правда. Я ходил на все лекции, заводил будильник, писал конспекты, учился, списывал и давал списывать.{w} Меня даже в библиотеке в лицо узнавать стали - настолько часто я там бывал. {w} Вообще, забавно, с моими-то габаритами - в папку пошёл, тот тоже плечистый был."
    "Но, как это всегда и бывает, беда пришла невовремя. {w}Хотя ткните мне пальцем в того, у кого это «вовремя» бывает."
    "Мать сбило машиной. Не насмерть, но вплоть до временной утраты дееспособности. А там уж, простите, какая учёба? Забыв о сне и отдыхе, я вкалывал на любой подработке, какую мог найти, только для того, чтобы мы не умерли с голода."
    "А на мою справедливую просьбу о предоставлении академа, на меня посмотрели как на шизанутого и указали на дверь. На носу была сессия, и хвосты крутили всем."
    "Вот тогда-то я и слетел впервые с катушек - наорал на зама завкафедрой, с самим завом чуть не подрался. И, разумеется, со свистом вылетел. С третьего-то курса!"
    "Потом армия. Их тоже не интересовали мифические проблемы моей семьи…"
    "В результате, вернувшись после службы, я узнал, что мать в психушке."
   
    nvl clear
    window hide

    scene anim intro_7
    with fade

    stop music fadeout 4

    play sound_loop sfx_street_traffic_outside fadein 2
   

    $ set_mode_nvl()
    stop music fadeout 5
    window show
    "Тогда я получил свой первый условный срок - я подкараулил офицера, занимающегося социальной стороной вопроса, и отметелил его так, что кулаки потом месяц зарастали. "
    "Разумеется, я не скрывался, и, разумеется, я и не подумал отрицать собственную вину."
    "Потом эта работа менеджером по продажам - первое, куда сунется любой молодой человек, который ничего не умеет."
    "Как оказалось, продавать у меня получалось. {w}Во всяком случае, план я выполнял. {w}И даже перевыполнял, если за это светили ощутимые бонусы."
    "Но сначала бонусы стали меньше, {w}потом исчезли вовсе, {w}а когда замаячившее место начальника отдела отдали родственнику босса, а мне указали на дверь…"
    "Спасибо судье, вошла в положение и не засчитала дело рецидивом. Святая женщина."
    "И вот я здесь."
    "Сычёв. {w} Семён Сычёв."
    nvl clear

    "Определённые плюсы в работе охранником были - много свободного времени, скользящий график, достойная зарплата."
    "Но со всеми своими учёбами и работами я оказался на обочине общества."
    "Нелюдимый и неласковый - в полном соответствии со своей фамилией."
    "Подругой не обзавёлся, о семье не думал - а на горизонте уже маячит тридцак."
    "Не этого я хотел, когда заканчивал школу, ох и не этого."
    nvl clear
    window hide

    play sound sfx_intro_bus_engine_start

    $ renpy.pause(3)

    play sound_loop sfx_intro_bus_engine_loop fadein 3

    $ set_mode_adv()

    scene anim intro_9 
    with fade2

    window show
    "Подъехавший ЛиАЗ меня, мягко говоря, удивил.{w} Я, конечно, могу ошибаться, но, вроде, весь парк поменяли на машинки поновее.{w} Такие жизнерадостные зелёненькие лиазики с площадкой для въезда инвалидов."
    "А это какое-то ископаемое."
    window hide

    $ renpy.pause(2)

    scene anim intro_10 
    with fade

    play sound sfx_intro_bus_door_open

    $ renpy.pause(3, hard=True)
    scene anim intro_11 
    with fade
    $ renpy.pause(1, hard=True)

    stop sound_loop fadeout 4

    scene anim intro_13 
    with fade2
    $ renpy.pause(3, hard=True)

    scene bg intro_xx 
    with fade

    stop ambience fadeout 2
    play sound_loop sfx_bus_interior_moving fadein 4

    window show
    "Я даже вытащил наушник из уха и уточнил:"
    me "Это четыреста десятый? Мне до Автово бы."
    "Кондукторша кивнула."

    $ volume(0.5, 'music')

    play music music_list["lightness_radio_bus"] fadein 7

    "Город жил. Ему было плевать на меня, он просто жил."
    "И если однажды не станет Сычёва Семёна Семёныча, об этом никто никогда не вспомнит."
    show blink  with dissolve
    $ renpy.pause(1.5)
    "Такой вот реквием по мечте."
    "А в салоне играло что-то такое тёплое и доброе, родом из далёкого-далёкого детства."
    "Когда не имели значения громкие имена и пафосный антураж, и народ тянулся просто к звукам хорошей песни."
    "Она навевала какую-то ностальгию, и изнутри отозвалось неожиданным теплом, разбежавшимся мурашками по коже, немного, но всё же согревая."
    hide blink
    window hide

    stop music fadeout 3

    window show
    "Я закрыл глаза."
    show blink  with dissolve
    $ renpy.pause(1.5)
    "И открыл их уже около своей остановки."
    "Мой дорогой магазинчик приветливо помигивал мне неоновой зелёной ёлочкой и вывеской «24 часа». Все вокруг жаждали праздника и всеми силами приближали его."
    "Я зашёл внутрь, кивнул улыбнувшейся Зинке и расслаблено опустился на дежурный стул."
    "Всё как обычно."
    "И до утра поднимался лишь для того, чтобы засмолить «Арома Рич» - хоть и охрана, а толк во вкусных вещах понимаю."
    "Но, как я уже говорил, сегодня всё было не так."
    "Особенно стало не так, когда в помещение магазина, впустив вместе с собой целый клуб морозного воздуха ввалился этот пьяный дуралей и, невзирая на запрет торговли спиртным вечером, стал требовать - правильно что…"
    "И на попытавшуюся урезонить буяна продавщицу среагировал неожиданно - выхватив из кармана «Ижа»."
    stop sound_loop
    stop ambience
    window hide
    play sound makarych fadein 0
    window show
    "В общем, день определённо не задался."
    window hide
    scene bg ext_camp_entrance_night 
    show prologue_dream 
    with fade3

    window show
    $ night_time()
    play ambience ambience_camp_center_night fadein 2
    "Бах-бах, два выстрела в лоб…"
    "Бах-бах, хуже быть не могло…"
    "У других перед смертью перед глазами проносится вся жизнь." 
    "Но я и здесь умудрился облажаться."
    "Какой-то незнакомый лагерь, ночь, тишина."
    "И лишь знакомый с детства голос, которому я всю жизнь отказывал:"
    window hide

    scene black 
    with fade3

    scene bg ext_camp_entrance_night 
    show owl :
        pos (931, 88)
    show uvao_d1 at left
    show prologue_dream 
    with fade3
    show credits timeskip_come with dissolve2:
        pos (747,105)
    $ renpy.pause(3, hard=True)
    scene bg ext_camp_entrance_night
    show uvao_d1 at left
    show prologue_dream
    window show
    "Пойти? А какие варианты?"
    window hide
    $ renpy.pause(2)

    menu:
        "Пойду, милая.":
            $ alt_day0_prologue = True
            me "Конечно, пойду. Мне тут ловить нехрен."
        "Нет, я останусь здесь":
            "К сожалению, в этот раз я не могу отказаться."
            "Ведь отказаться — значит, очнуться на заплёванном, затоптанном, грязном от растаявшего снега и уличного песка полу."
            "Со свинцовым куском во лбу и минимумом шансов на выживание."
            "Смотря на то, как огни проезжающих машин кидают отблеск на дурацкую старомодную люстру у нас на потолке."
            "Хотя в долгосрочной перспективе шансы на выживание один фиг равны нулю."
            "И я снова уступаю обстоятельствам…"
    window hide
    $ renpy.pause(1)
    $ renpy.pause(2, hard=True)
    stop music
    stop sound_loop
    stop ambience
    jump alt_day0_opening
    
label alt_day0_start_loki:
    play sound sfx_punch_medium
    scene intro_loki with dissolve
    pause(1)
    menu:
        "Так всё и начиналось.":
            $ plthr = u"Локи"
            play sound role_loki fadein 3
            $ renpy.pause(4, hard=True)
            with dissolve2
        "Но я не уверен точно…":
            jump alt_day0_prologue
    $ make_names_unknown()
    $ routetag = 'prologue'
    scene black with fade
    show credits timeskip6 with dissolve2:
        pos (200,540)
    $ renpy.pause(4, hard=True)
    scene black
    $ prolog_time()
    $ loki = True
    window show
    play music music_list["orchid"] fadein 3
    voice "Прости. Прощай."
    "Впереди ничего и никогда светлого не будет."
    "Надо просто держать это в голове и никогда не забывать."
    "Другим всё равно, что тебе плохо, больно и мучительно не-веряще."
    "Хуже крушения надежд может быть только крушение веры."
    "В то самое светлое завтра."
    "Хруст фаланг под опускающейся ногой, закованной в лакированный штиблет."
    "Крик не из груди - из души."
    th "Поделом. Поделом!"
    "Это слишком глупо началось, чтобы у него были хоть какие-то права на счастливый эпилог."
    "Началось всё с двух минут опоздания."
    window hide
    scene op_back with dissolve
    window show
    "Две тысячи какой-то, я, студент - гордый тем, что полностью создал себя - опоздал."
    "За год подработки в кафе с живой музыкой я повидал всего, но незыблемым оставалось одно - как штык в 9-37 я стоял на остановке и поджидал свой ПАЗик."
    "А здесь задержался."
    "Я помню эти лица - девочку метр с кепкой, работающую в ночную смену местного интернет-кафе, Тэш, кажется. {w}На второй остановке обычно заходила Юля - мы раньше работали вместе и до сих пор здороваемся кивками."
    "Привычное и распланированное до секунд бытие."
    "Моё место мизантропское - на отшибе."
    "И я всегда занимал его, так как не переносил чужих прикосновений."
    "А здесь опоздал. {w}И за две минуты что-то сдвинулось в пластах мироздания."
    "Моё место оказалось занято каким-то упырём с довольной харей, пришлось садиться рядом с Тэш."
    "Время до моей остановки надо было чем-то убить - и от нечего делать, я заглянул за плечо «компьютерной» девочке, где она увлечённо трещала с кем-то по аське."
    "Один номер почему-то запомнился.{w} Наверное потому, что был достаточно красивым, пятизначным…"
    "И мало удивительного было в том, что вернувшись домой, я машинально забил номер в поиск, мы разговорились… Подружились… Спешили вечерами в сеть."
    "Мне пришлось изворачиваться, чтобы объяснить, откуда я знаю этот номер."
    "Но ради такого собеседника я был готов на многие жертвы."
    "Так что ничего удивительного в том, что однажды я просто признался себе, что мой лучший друг - это анонимный собеседник в асечном окошке."
    window hide
    stop music
    scene anim prolog_3 with fade
    window show
    play music music_list["torture"] fadein 3
    "Я всегда считал, что каждый получает только ту реальность, какую заслуживает."
    "Реальность наркомана состоит из шприца, почти невидимых вен и раствора на ложке над зажигалкой."
    "Реальность художника - из алкоголя, таких же художников и горящей на кончиках пальцев идеи."
    "А моя реальность…"
    "Что ж, я не был безгрешен, и мне пришлось устроить ряд подлогов ради того, чтобы оказаться на первом курсе консерватории."
    "Дальше мои жульничества только прогрессировали - отличные оценки (списанные), концерты (где я выступал второй скрипкой). А когда в деканате прознали про моё состояние и выписали стипендию…"
    "Я не гордился этим, но к своей мечте, связать жизнь с музыкой, шёл бульдозером."
    "Просто потому, что с первой мечтой в моей жизни, стать космонавтом, меня развернули - что-то в моём сумрачном детстве пошло не так, и теперь я даже на подвиг Алексея Маресьева претендовать не смог бы."
    window hide
    scene anim intro_1 
    with fade
    $ renpy.pause(3, hard=True)
    window show
    "В общем, моя реальность состояла из нотных тетрадей, бесконечных репетиций, сольфеджио и попыток считать мелодию «с листа»."
    "И…"
    window hide
    with fade2
    window show
    "Я заканчивал второй курс, когда столкнулся с ней на нашей духовой кафедре."
    "И мы как намагниченные, тянулись и тянулись друг к другу."
    "Хотя я изо всех сил строил из себя ответственного юношу, не разменивающегося на мелочи."
    "Несмотря даже на то, что нас представили друг другу общие знакомые спустя неделю."
    "А ещё через неделю я признался своему единственному другу - тому таинственному анониму из сети в том, что, кажется, схожу с ума."
    "И полтора часа восторженных эпитетов, расписываний того «какая она!» спустя, мне задали вопрос: и что, нашему общению теперь конец?"
    "Конечно же нет! Я даже не собираюсь…"
    "Чего я не собирался - я не договорил."
    play sound sfx_door_bell
    "По ту сторону двери стояла она."
    window hide
    scene anim intro_2 
    with fade
    play sound sfx_intro_bus_stop_steps
    $ renpy.pause(3, hard=True)
    scene anim intro_3 
    with fade
    
    play music prologue_1 
    
    window show
    "Почему она пришла? Непонятно."
    "Но она пришла."
    window hide
    $ renpy.pause(3, hard=True)
    scene anim intro_4 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_5 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_6 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim intro_8 
    play sound sfx_intro_bus_stop_sigh
    with fade
    $ renpy.pause(3, hard=True)
    window show
    "Интеллигентный, перспективный мальчик с хитринкой в глазах, всю жизнь свою мечтающий пинать мяч, а не качать лёгкие."
    "Но слишком правильный и разумный для того, чтобы уступить простому детскому желанию."
    "И выросший в эмоциональной барокамере."
    "И что, что мог знать я о том, во что могут вылиться какие-то там {i}настоящие{/i} отношения?"
    "Правильно, только то, что сумели воспитать во мне Гершвин, Григ, Бетховен."
    "Вечерами и мне мечталось о том, что я однажды встречу свою Джульетту Гвиччарди."
    "По-своему, по-обывательски, я был наивен и верил в то, что человеку свойственна тяга к чистому и светлому. {w}Семнадцать лет, чего вы хотели… Перспективный мальчик."
    window hide
    scene anim intro_7 
    with fade
    $ renpy.pause(3, hard=True)

    scene bg bus_stop 
    with fade
    window show
    "А ведь мы даже не поцеловались."
    "Держались за руки, ходили вместе, медленно двигаясь к тому, когда кому-нибудь из нас хватит решимости перевести её и меня в «нас»."
    "Оказалось, решимости хватило кому-то другому."
    window hide
    with fade2
    window show
    "Он забрал её у меня - её улыбку, тепло ладони, жадное внимание в зелёных глазах."
    "И будто в ознаменование того, что беда не приходит одна, замолчал и мой таинственный асечный визави."
    "Он очень долго молчал и до этого, но я тогда был занят - я был влюблён."
    window hide

    $ renpy.pause(3)

    scene anim prolog_2 
    with fade
    $ renpy.pause(1)
    "Почему-то даже в голову не пришло мстить или бороться…"
    "Просто улетели в мусорку и сгорели несколько тетрадей со стихами, серенадами, и сюита «Ей» звалась теперь «Без Лица»."
    "Просто из телефона, записной книжки и почтового ящика безжалостно были выкорчёваны номера и контакты."
    "Я замкнулся в себе и полностью сосредоточился на учёбе."
    "Учёба, работа, учёба, работа — музыка — не дающая успокоения, но хотя бы не бесящая."
    "Наверное, меня, как любого другого представителя знака Близнецов, действительно необходимо очень сильно обидеть, чтобы мы начали выкладываться в творческом плане."
    "Но я начал срывать овации - бывший бесталанный, вечная вторая партия, тот, на кого духовик уже давно рукой махнул, я будто бы обрёл второе дыхание… Да-да, то самое, на которое ни одному из нас уже не претендовать."
    "Гран-при на фестивале духовых инструментов, первое место среди трубачей в смотр-конкурсе «Звуки СНГ», приглашение на стажировку в Берлин с перспективой трудоустройства…"
    "Я рос как музыкант, загибаясь как романтик и ребёнок."
    "Сейчас я понимал, что вообще мало удивительного в том, что глаза у любого по-настоящему талантливого музыканта больные."
    "До конца учебного года оставалось немногим меньше месяца, до поездки в Германию - полутора, когда давным-давно мёртво молчащий контакт разродился «приветом»."
    window hide
    scene black 
    with fade3
    $ renpy.pause(2)
    play ambience ambience_cold_wind_loop fadein 3
    window show
    "И я забыл обо всём."
    "Это была первая за полгода ночь, когда я засиделся у монитора до рассвета."
    "Мы, захлёбываясь, говорили обо всём на свете."
    "Мой мудрый визави - человек, которого мне так не хватало эти полгода бесконечной вьюги."
    "А когда наутро я рассказал о женском коварстве и том, что отдал бы многое, только бы просто заглянуть в глаза ему, пожать лапу и проставить по паре чего-нибудь вкусного…"
    voice "А ты выгляни на лестничную площадку."
    window hide
    show blinking  with dissolve
    scene anim intro_2 
    $ renpy.pause(3.5)

    window show
    "Она просидела всю ночь на подоконнике, болтая с телефона со мной по аське."
    "Она. Разделившая простое «Мы» на «Ты» и «Я»."
    "Как она оказалась ещё и моим лучшим другом? Тем, чьи мысли я всегда слышал, произносимыми голосом Брэндона Кинера, с лукавой улыбкой, и мудрым умением выслушать."
    window hide
    stop sound_loop fadeout 4

    window show
    "Как она посмела…"
    "Она захлопнула дверь за собой."
    play sound sfx_face_slap
    "Схватилась за щеку, которую обожгло пощечиной."
    me "Выпьешь чаю, и я не хочу тебя видеть. Никогда."
    "Ответила."
    "Я не знаю, сколько мы били друг друга, сколько орали, но…"
    window hide

    $ renpy.pause(3)

    scene anim prolog_5 
    with fade
    $ renpy.pause(3, hard=True)
    scene anim prolog_5 
    with fade
    $ renpy.pause(3, hard=True)

    window show
    "Я не пошёл учиться. Ни в этот день, ни в следующий."
    "Только вот в паре всегда есть тот, кто любит, а есть тот, кто позволяет любить себя."
    "Вечером надо было идти на работу."
    "А на работу я не дошёл."
    "Меня встретили в подъезде. Не помню, сколько их было - трое? Четверо?"
    window hide
    $ volume(1.0, 'music')
    play music music_list["a_promise_from_distant_days_v2"] fadein 3

    $ renpy.pause(3)

    scene anim prolog_2 
    with fade
    $ renpy.pause(1)
    with flash
    play sound sfx_lena_hits_alisa
    pause(1)
    $ set_mode_nvl()

    window show
    "После первого контакта прямым в лицо сознание уплыло, и я не считал количества сыплющихся на меня ударов."
    "Многочисленные ушибы, перелом трёх пальцев правой руки, и самое страшное - отбитые лёгкие."
    "Я открыл глаза в больнице."
    "И чуть не закрыл их навсегда, когда огласили диагноз."
    "Семён Персунов, подающий надежды музыкант, стал узником Замка Тишины."
    "Какой там Берлин, какая стажировка - представители Берлинского Филармонического готовы были помочь чем угодно, но они не были способны на чудо."
    "Обычно здесь ставят точку и загружают последнее сохранение - потому что обрезаны абсолютно все ниточки, ведущие со дна."
    nvl clear
    window hide
    $ renpy.pause(3)
    window show
    "«Перспективный мальчик» ещё полгода ходил по стеночке, восстанавливаясь. {w}Из них три месяца - под присмотром специалистов после нескольких неудачных попыток суицида."
    "Я растерял свои мечты, растерял шансы и возможности. {w}Просто однажды подумав не головой, а…"
    "И стоит ли удивляться, что самая красивая, самая мудрая и хорошая махнула хвостом, лишь узнав о том, во что я превратился?"
    "Как будто не было никогда ни нас, ни нашей трогательной дружбы."
    "«Прости. Прощай.»"
    "И…"
    "Да что «И» - мы больше не учились вместе, а в свободное от учёбы время, её досуг обеспечивал тот самый третий, оказавшийся не лишним."
    
    nvl clear
    window hide
    scene anim prolog_5
    with fade
    stop music fadeout 4
    play music beth fadein 3
    play sound_loop sfx_street_traffic_outside fadein 2
    "Во мне что-то сломалось. Куда-то делся внутренний яростный огонь, что мог бы сделать меня карающей дланью, толкнуть на преступление, на месть."
    "Я стал тенью себя прежнего, но не сдался. Лишив меня дела всей жизни, ублюдок таким образом дал мне новое."
    "Шло время. Я сдал оставшийся год экстерном и ушёл в дом детского и юношеского творчества руководителем духового кружка, где полностью посвятил себя преподаванию музыки."
    "Я не знаю, откуда они узнали, но одним зимним вечером ко мне в аудиторию заглянул отец одного из моих учеников. Он не стал ходить круг да около и сразу предложил помощь."
    "Таким образом было положено начало."
    "Ещё пять лет, пока один из моих бывших одноклассников не получил всё-таки заместителя в районной СЭС."
    "Замы, помощники, полпреды, секретари - не сильные мира сего, а те, кто носит им бумаги на подпись. И пишет эти бумаги."
    "Как сказал классик, миром правят лейтенанты и капитаны."
    "А месть во все времена подавали холодной."
    "Я был тенью, трикстером, плетущим сеть на человека. Как когда-то сплёл её ас Локи - кличка прилипла сама собой; разве что моя Сигюн оказалась куда не так верна и променяла блюдо с ядом на медовые посулы хлыща, не любившего её ни секунды."
    "Ещё годик - моя жертва каким-то чутьём засёкла сужающих круги акул, и вёла все дела идеально честно, частенько даже в убыток себе."
    "Но вода точит камень - у меня появился шанс."
    nvl clear
    "Дело было в последней декаде июля, на валовых заказах штат перестал справляться, привлекли специалистов на аутсорсе, «забыли» заключить договоры - и в дверь этой фирмочки постучалась выездная налоговая проверка."
    "За ней пожарники, санитары, кадастровая служба - в нашей сумрачной столице практически невозможно существовать на территории города и быть безгрешным."
    "Кто ищет, тот найдёт. И косяки посыпались чередом - от неправильно проложенной проводки до крыс в подвале."
    "Работа предприятия этого хлыща была парализована."
    "Закон кармы в действии."
    "Решение о банкротстве суд выдал меньше чем через полгода тяжб."
    "Не могу сказать, что мне стало легче от этого - даже если бы его прилюдно распяли, это не вернуло бы меня к музыке."
    "Я всё ещё остался тем молодым угрюмым руководителем кружка самодеятельности, шарахающимся от коллектива и знакомств."
    "Чёртовым одиночкой, не испытавшем даже мрачного ликования когда всё закончилось."
    "Разве что снова вернулись мысли о наиболее логичном завершении этой истории без хорошего конца — я колебался между пистолетом и петлёй."
    "Если чему и научился за эти восемь лет - так это тому, что иногда даже две минуты могут круто повернуть судьбу человека."
    "Поэтому научился ценить время, и по педантичности и пунктуальности сумел бы заткнуть за пояс любого японца."
    nvl clear
    window hide

    play sound sfx_intro_bus_engine_start

    $ renpy.pause(3)

    play sound_loop sfx_intro_bus_engine_loop fadein 3

    $ set_mode_adv()

    scene anim intro_9 
    with fade2

    window show
    "И потому я тютелька в тютельку стою на остановке автобуса."
    "«Четыреста десятый, наш автобус отправляется в ад»."
    "Научив пунктуальности, жизнь не научила меня ничему другому. И ума точно не добавила."
    "Именно поэтому я машу ладонью водителю ЛиАЗа - старенького, красного, сейчас таких и не встретишь почти - всё заменили евро-новоделы."
    
    window hide

    $ renpy.pause(2)

    scene anim intro_10 
    with fade

    play sound sfx_intro_bus_door_open

    $ renpy.pause(3, hard=True)
    scene anim intro_11 
    with fade
    $ renpy.pause(1, hard=True)

    stop sound_loop fadeout 4

    scene anim intro_13 
    with fade2
    $ renpy.pause(3, hard=True)

    scene bg intro_xx 
    with fade

    stop ambience fadeout 2
    play sound_loop sfx_bus_interior_moving fadein 4

    window show
    "Мы разложили всё по полочкам, мы расставили все точки над «ё»."
    "Зачем она позвонила? Я удалил её номер, но добавить в чёрные списки не поднялась рука."
    "Она плакала, просила приехать, хотела о чём-то поговорить."
    "Я дурак, что позволил случиться тому, что случилось, я дурак, что сейчас еду куда-то."
    "Она позвала… И я побежал. Виляя хвостом, вывалив язык набок, счастливым щенком - ведь она позвала."
    th "Где же она, обещанная ненависть к человеку, который тебя уничтожил?"
    "Почему этому человеку хватает совести просить меня о помощи, а мне не хватает духу прогнать его вон?"
    "Как всё сложно."
    "А ведь всё началось с опоздания на две минуты."
    "Удивительно, правда?"
    "Удивительно."
    window hide
    window show
    "Я закрыл глаза."
    show blink 
    $ renpy.pause(1.5)
    scene winterpark with dissolve
    $ renpy.pause(1.5)
    window show
    "Ничему не научила меня ни моя затяжная депрессия, ни попытки уйти из жизни."
    "Но в Новый Год же всякое может случиться? Может быть, она сделает мне подарок и пропадёт, наконец, из моей жизни - в этот раз навсегда?"
    "Почему-то она назначила встречу в ЦПКиО."
    "Где-то рядом с катком, сказала, что будет ждать меня у самой коробки."
    "Мой подарок на Новый Год. Подарок победителю в игре, где победитель теряет всё."
    "Чего-то такого и я ждал - Локи ведь тоже не очень хорошо кончил."
    "Поэтому когда на меня, растянувшись цепью, пошла уже знакомая четвёрка, я даже не испугался."
    th "Вот и всё."
    "Сказал я себе."
    "Две зажигалки, удобно лёгшие в кулаки, прозрачная питерская ночь и любовь всей моей жизни."
    th "Вот и всё."
    "Я пошёл им навстречу, побежал навстречу злому сверканию глаз, застывшим оскалам, тупоносым ботинкам, которыми так удобно ломать рёбра..."
    "Локи, Асгард приговорил тебя к смерти."
    window hide
    scene winterpark
    show spill_red
    show prologue_dream 
    with fade3
    window show
    play ambience ambience_camp_center_night fadein 2
    "С катка доносились звуки очередного попсового мотивчика, а я лежал в глубоком снегу и смотрел на фонарь, чей свет резал ледяной воздух толстыми ломтями."
    "Было жутко холодно, но пошевелиться я не мог."
    "Похоже, они попали куда-то, где ещё не всё зажило."
    "Поэтому ощущению тепла не удивился уже - слышал, что такое происходит с замерзающими."
    stop music fadeout 3
    "А под захлопнувшимся веком обнаружилась странная картинка:"
    scene bg ext_camp_entrance_night 
    show prologue_dream 
    "Застывшие во мгновение полёта гипсовые пионеры, стоящие по разные стороны от полу-открытых фигурных ворот с колышками сверху."
    "Была ночь, стояла полная тишина, нарушаемая лишь пением цикад."
    "И лишь знакомый с детства голос, зовущий в страну, откуда нет возврата:"
    window hide
    scene black 
    with fade3
    scene bg ext_camp_entrance_night 
    show owl :
        pos (931, 88)
    show uvao_d1 at left
    show prologue_dream
    with fade3
    show credits timeskip_come with dissolve2:
        pos (747,105)
    $ renpy.pause(3, hard=True)
    scene bg ext_camp_entrance_night
    show uvao_d1 at left
    show prologue_dream
    window show
    th "Ты как всегда вовремя…"
    th "Впрочем… Что я теряю?"
    window hide
    $ renpy.pause(2)

    menu:
        "Пойду, милая.":
            $ alt_day0_prologue = True
            me "Надеюсь, там не будет больше ни её, ни его, ни этой сраной четвёрки."
        "Нет, я останусь здесь":
            play music herc_death fadein 3
            "Холода больше не было."
            window hide
            scene winterpark
            show uvao_d1 at left
            show spill_red
            show prologue_dream 
            window show
            "Девушка, что снилась мне всю мою жизнь, печально улыбнулась на прощанье, и горькая слезинка замёрзла на идеальной щеке."
            "Новогоднее, выпивающее жизнь, ледяное настроение приняло меня в свои объятья."
            "Сердце постучалось в завтра."
            "Тук-тук."
            window hide
            scene black with fade
            window show
            "Но ему никто не ответил."
            window hide
            return
    stop ambience
    "Сначала перестала иметь значение боль."
    "Потом пропали саднящие ощущения в ссаженных щеках и бульканье в лёгких."
    "Мороз перестал иметь значение."
    "И…"
    window hide
    $ renpy.pause(1)
    $ renpy.pause(2, hard=True)
    
label alt_day0_opening:
    play music music_list["opening"] fadein 5

    scene black 

    $ renpy.pause(3, hard=True)

    scene op_back 
    with dissolve2

    $ renpy.pause(2, hard=True)

    show op_sl 
    with dissolve2

    $ renpy.pause(2, hard=True)

    show op_un 
    with dissolve2

    $ renpy.pause(2, hard=True)

    show op_us 
    with dissolve2

    $ renpy.pause(2, hard=True)

    show op_dv 
    with dissolve2

    $ renpy.pause(2, hard=True)

    show op_mi 
    with dissolve2

    $ renpy.pause(2, hard=True)

    show op_uv 
    with dissolve2

    $ renpy.pause(2, hard=True)

    show logo_day :
        pos (400,150)
    with dissolve2
    show acm_logo with zoomin:
        pos (1200,350)
    with vpunch 

    $ renpy.pause(2, hard=True)

    scene black 
    with dissolve2

    stop music fadeout 5

    $ renpy.pause(5, hard=True)

    jump alt_day1_start