# Д6-левая ветка. Танцы после медпункта или карьера для тру- и фальш-гуд-ГГ
#
# Набросок
#
label alt_day6_uvao_left_dance:
    "Хотя от медпункта до площади было буквально рукой подать, дорога заняла у меня несколько минут - чем дальше я продвигался по полуосвещённой дорожке, тем неувереннее становились мои шаги."
# Меняем музыку. "lightness" уже было. Надо бы что-то раритетное эстрадное, необязательно, чтобы под это можно было танцевать :) 
    "\"Пастуха\" сменила какая-то другая мелодия, незнакомая мне, но хорошо известная местной публике, судя по одобрительным возгласам."
    "Я остановился в тени кустов, не решаясь выйти на открытое пространство."
    "В голове вертелось множество причин повернуть назад и, как назло, ни одной - сделать последний шаг вперёд."
    # "Там сейчас были люди, которые знали, зачем собрались вместе."
    "Я представил себе, как выхожу на площадь и... {w}Переминаюсь с ноги на ногу возле скамеек в компании таких же лузеров, с которыми не захотела танцевать ни одна девочка?"
    dreamgirl "А ты не слишком перегибаешь палку?"
    "Шепнул голос в голове."
    dreamgirl "Как-то ты очень уж плотно вжился в роль семнадцатилетнего недоросля."
    dreamgirl "Да здесь одни сопляки собрались, пацаньё, большинство из них даже не целовалось ни разу, а ты-то чего ты трясёшься? {w}Кое-какой опыт у тебя, хвала рандому, есть - и в танцах, и не только! {w=1.0}{b}Ты мужик вообще, или где?!{/b}"
    "Я глубоко вдохнул и, как в прорубь бросился, шагнул вперёд."
    #сцена - украшенная гирляндами вечерняя площадь
    "Ослеплённый брызнувшим прямо в глаза светом прожектора, я запнулся{w=1.0}... и немедленно был схвачен за руку!"
    show sl happy dress
    sl "Семён! Я тебя везде ищу, куда же ты пропал!"
    show sl normal dress
    sl "То есть... Я хочу сказать, все давно здесь собрались, а тебя всё нет и нет..."
    show sl shy dress close
    "Славя внезапно смутилась и опустила было взгляд, но быстро справилась с собой и сказала, глядя мне в глаза:"
    sl "Я подумала... может быть, ты бы согласился потанцевать со мной? Хотя бы немного?"
    me "Аэ-э-э."
    "Я судорожно кивнул, пытаясь совладать с прилипшим к гортани языком."
    me "Ко...коне...конечно, да.{w=1.5} Ну конечно же, с радостью!"
    show sl smile dress close
# Меняем музыку на медленно-танцевальную. Романтик!
#Вероятно, дальше текст следует пустить италиком - заодно с переходом на настоящее время.
#Возможно, текст пустить на весь экран. Или есть какой-то подходящий ЦГ с нехентайной призывно-манящей Славей?
    "Левая рука уже сжимает горячую ладошку, правая сама тянется было на талию партнёрши, но я спохватываюсь, здесь же так не принято."
    "Первые несколько тактов мы неловко топчемся на месте, стараясь не наступать друг другу на ноги, и смущённо отводя глаза, но вот Славя снова ловит мой взгляд, и следующие шаги даются неожиданно легко."
    # "Я наконец могу как следует разглядеть наряд Слави."
# ЛБ: пристально отсмотреть сцену дискотеки в Д3. Мог ли ГГ там танцевать Славю? Насколько плотно могли общаться, насколько подробно успел рассмотреть сарафан. Можно ли воспользоваться ключами от 7ДЛ-куна, или безнадёга? Если повезёт, и можно быть уверенным в отсутствии повтора, то здесь приводим немного эротических наблюдений про сарафан, как сидит, нестеснённая (предположительно) бюстиком грудь. Кстати, где-нибудь толкнуть про золотистые(?) волосы.
    "Звучат финальные аккорды, и я с сожалением делаю шаг назад, но Славя лишь чуть плотнее сжимает свои пальцы на моих... и я остаюсь."
    "Кажется, на площади полно народу, наверняка должны быть и знакомые лица, но всё вокруг словно бы не в фокусе, кроме фигурки напротив."
    "Девушка что-то говорит, я отвечаю и, наверное, даже впопад, но ненужные слова забываются раньше, чем сорвались с наших губ."
    "Мне всё ещё немного неловко от того, что наши глаза снова и снова встречаются, но девушку это, похоже, нисколько не смущает. Через минуту мы уже кружимся в танце, не разрывая призрачную нить взгляда."
    "Поэтому когда Славя вдруг отпускает мою руку и, разом сокращая дистанцию между нами до нуля, полуобнимает меня за плечо, я нисколько не удивляюсь, лишь завершаю освободившейся рукой начатое несколько минут назад движение."
    "Наверное, сказывается длительное отсутствие практики - рука ложится чуть ниже, чем следовало бы, но пока я соображаю, как бы поделикатнее поднять её до уровня талии, следует ещё одно быстрое пожатие пальцев, чуть лукавый взгляд небесно-голубых глаз, и моя рука остаётся на прежнем месте." # ЛБ: уточнить оттенок глаз.
    "С такого расстояния я чувствую тепло её дыхания у себя на горле и лёгкий запах _чего-то_, исходящий от волос." #ЛБ: уточнить про дыхание и прочие приятные запахи от волос и тела. Наверняка упоминается что-то характерное.
    "Мягкие, упругие соприкосновения разгорячённых тел - теперь я уже совершенно точно знаю, что кроме моей рубашки и её тонкого сарафана нас больше ничто не разделяет."
    "Ещё несколько танцев вместе - два, а может быть и все десять? Я не замечаю сменяющихся мелодий, мир вокруг застит горячая пелена, в голове восторженно-пусто. {w}Всё, что имеет сейчас значение - это искорки в глазах девушки напротив, её манящие губы на расстоянии вдоха от моих и близкий-близкий жар её тела."
    "\"Я устала.\" - шепчет Славя. \"Давай отдохнём?\""
    "Я неохотно отпускаю её и покорно веду к свободной скамейке, но она тянет меня мимо, куда-то в сумрак ночного лагеря."
# Конец выделения италиком (если было), конец на весь экран или ЦГ (если было). Переходим на привычный стиль повествования в прошедшем времени.
    # сцена - несколько пятен разного размера и цвета (как от наложения сильного flare на источник света) на чёрном (тёмном) фоне. На крайняк - наложить Noir густой-прегустой на ночную дорожку у домиков.
    "Крепко держа за руку, Славя решительно тянула меня куда-то в темноту - после яркого освещения на площади в глазах мельтешили какие-то разноцветные пятна и я едва понимал, куда мы бежим."
#
#
#############
# Вариант соскока №1, до скуки невинный
#############
    # сцена - ночная дорожка у домиков. Та, что с шишками. Можно парочку кустов-масок накинуть в переднем слое.
    "Кажется, мы оказались в итоге на дорожке между какими-то домиками, но прежде чем зрение успело окончательно адаптироваться, Славя остановилась так резко, что я едва не сбил её с ног."
    show sl surprise dress at left
    show ba smile uniform at right
    ba "Тааак! Пионеры! {w}И что же это вы здесь делаете? Дискотека вооон там!"
    "В голосе физрука звучала неприкрытая издёвка и я почувствовал, как сами собой сжимаются кулаки."
    "Не задумываясь ни о шансах, ни о последствиях, я шагнул было вперёд, как Славя вдруг ахнула в голос. {w}Обернувшись и увидев её лицо, я так замер на месте."
    show sl scared dress at left
    sl "Как же я...{w=2.0} Ведь если ты в самом деле..."
    show sl cry dress at left
    show ba em1 uniform #с подозрительным прищуром
    "Она вдруг судорожно всхлипнула и прошептала:"
    "...то всегда сможешь..."
    show sl cry dress at left # ЛБ: Надеюсь, Ленофаг сделает "истерику"
    "Тут Славя прижала к лицу ладони и зарыдала."
    me "Славя!"
    "Я бросился было к ней, но она вырвалась и отчаянно замотала головой, зарыдав ещё громче."
    "Сквозь слёзы она пыталась ещё что-то сказать, но разобрать уже вовсе ничего было нельзя."
    "Совершенно сбитый с толку, я перевёл взгляд на физрука. Тот стоял, приоткрыв рот и выпучив глаза, и явно понимал в происходящем ничуть не больше моего."
    "Славя тем временем не только не собиралась успокаиваться, но начинала уже подвывать в голос. Это меня немного отрезвило."
    me "Борис Сан...э-э-э... Александрович. {w=0.8}Борис Александрович!" #ЛБ: уточнить, всегда ли ГГ знает, как зовут БА. Если с бегунком не заходил, техноквест не выполнял (и именуют ли БА в техноквесте БА, кстати?)...
    show ba normal uniform
    ba "А?"
    "похоже, физрук успел забыть о моём присутствии и уставился на меня с недоумением."
    me "Борис Александрович, её бы в медпункт, может? Виоле показать, она сейчас там как раз. {w}Мне-то её не дотащить, наверное."
    "Физрук несколько секунд растерянно переводил взгляд с заливающейся слезами девочки на меня и обратно, потом кивнул."
    ba "Ага, да. Правильно."
    "Он вдруг погрозил мне внушительным кулаком."
    show ba em1 uniform
    ba "Смотри у меня, если что!"
    "После этого он сгрёб рыдающую Славю в охапку и, что-то успокоительно ей бурча, потащил прочь."
    hide ba
    hide sl
################
# Конец варианта соскока №1
################
