# Д6-левая ветка, поиски Лены во время концерта и сопровождение до карьера в левой ветке.
# План-набросок
#
label alt_day6_uvao_left_UN_search:
    # сцена не задаётся, переходит из предыдущего фрагмента
# пока что задаём сцену на время отладки
    play ambience ambience_camp_entrance_day fadein 3
    scene bg ext_stage_big_day:
        xalign .48 yalign .48 zoom 0.75
    show bush_frame at truecenter
    with fade 
# /пока что задаём сцену на время отладки
    #
    # концовка предыдущего фрагмента:
    # "Поняв, что от Юли я сейчас больше ничего уже не добьюсь, я решил не терять времени и поговорить наконец с самой Леной."
    # dreamgirl "Давно пора! А то строишь из себя какого-то великого сыщика, умора одна."
    # .............
    # th "Короче говоря, для начала я иду в библиотеку."
    # .............
    # "Обернувшись к Юле, я осторожно спросил у обращённой ко мне части её тела:"
    # me "Ну... я пойду тогда?"
    # "Юля не соизволила ответить на мой вопрос, лишь нетерпеливо дёрнув хвостом."
    # "Я счёл это за знак окончания аудиенции и скромно удалился."
    #
# сцена - библиотека снаружи днём.
    "К моему удивлению, библиотека оказалась заперта. Похоже, даже жужелица пережидала концерт где-то в другом месте."
    "Пнув пару раз запертую дверь, я решил заглянуть к Лене в домик - вдруг она там сидит себе спокойненько, книжку читает."
    th "Кажется, их с Мику домик самый дальний в том же ряду, что и мой. {w} Или нет? Впрочем, неважно. Большинство пионеров сейчас на концерте, так что даже если и ошибусь - вряд ли кто-то будет претензии предъявлять."
# сцена - дорожка между домиками днём.
    "Впрочем, проверить свою наблюдательность мне так и не удалось."
    "Стоило мне выйти на дорожку, в разных концах которой разместились наши с Леной домики, как я увидел её саму буквально в десяти метрах рядом - даже со спины девочку нетрудно было узнать по забавной причёске и причудливому цвету волос."
    "Я уже собирался её окликнуть, но так и замер с открытым ртом - не доходя нескольких шагов до нашего с вожатой домика, Лена вдруг уверенно свернула с дорожки и через мгновение исчезла в пышных кустах сирени."
    th "Странно, куда это она направляется?"
    dreamgirl "Не иначе, сейчас обойдёт домик вожатой с другой стороны, высадит окно и стырит твои рваные джинсы."
    th "Перестань чепуху молоть!"
# сцена - домик ОД снаружи днём.    
    "Мысленно отмахнувшись от неуёмного болтуна в собственной голове, я выждал немного и повторил манёвр Лены."
# сцена - ближняя тропинка в лесу.
    "Меж кустов обнаружилось начало довольно утоптанной тропинки, ведущей куда-то за домики."
    "Я остановился. С одной стороны, идея отложить ненадолго неприятный разговор, а вместо этого попытаться что-то узнать про Лену, выглядела довольно соблазнительной."
    th "Но вот если она меня заметит - тогда прости-прощай возможное доверие с её стороны. Вряд ли она станет откровенничать со мной после этого."
    "Поколебавшись ещё немного, я всё-таки последовал за девочкой, стараясь держаться на почтительном расстоянии, благо белая рубашка с алым язычком галстука на спине делали её идельным объектом для слежки."
    dreamgirl "Между прочим, твоя белая рубашка с галстуком на груди будут заметны ничуть не меньше, если она обернётся."
    "Чертыхнувшись, я поспешно стянул с себя галстук и сунул в карман - хоть какая-то маскировка."
    "Впрочем, довольно быстро я понял, что эти меры предосторожности были излишни. Девочка уверенно шла вперёд, не оглядываясь - похоже, ей и в голову не приходило, что кто-то может за ней следить."
    "Через пару минут тропинка вывела нас к ограде лагеря. Тратиться на кирпич здесь не стали, ограничившись металлической сеткой."
    "Как и следовало ожидать, тропинка вела сюда не просто так - Лена уверенно подошла к одной из секций забора, и через несколько секунд её силуэт замаячил уже по ту сторону ограды."
    "Подобравшись к этому месту я убедился, что сетка здесь была аккуратно разрезана, так что в меру упитанный человек вполне мог пролезть. Торчащие проволочки по краям были заботливо загнуты, чтобы не порвать о них одежду."
    "Похоже, знающие люди этим путём пользовались регулярно, а судя по множеству проволочных заплат на сетке слева и справа, администрация лагеря регулярно заделывала этот нелегальный проход во внешний мир, после чего некие таинственные благодетели не менее регулярно его восстанавливали."
    th "Вот уж, воистину, не зарастёт народная тропа!"
    "Недолго думая, я пролез наружу и пошёл следом за Леной."
    "Некоторое время девочка шла вдоль забора, потом тот уступом ушёл куда-то вправо и тропинка запетляла среди деревьев."
    "Здесь лес рос заметно гуще, так что всё так же целеустремлённо идущая вперёд Лена то и дело исчезала из моего поля зрения. Сокращать дистанцию я опасался, приходилось надеяться, что девочка не свернёт куда-нибудь в сторону."
    "Ещё через несколько минут я почувствовал, что мои опасения начинают сбываться - мелькавшая временами между деревьев фигурка вдруг как сквозь землю провалилась."
    "В надежде, что всего лишь подотстал от неё, я ускорил шаг..."
# сцена - карьер.
    "...и вдруг очутился на открытом пространстве, большую часть которого занимал солидных размеров песчаный карьер."
    "Лес с этой стороны подходил почти вплотную к карьеру. Некоторые особо неудачливые деревья, накренившись, балансировали на самом краю, отчаянно хватаясь обнажёнными корнями, как растопыренными пальцами, за ненадёжный воздух. {w}Чувствовалось, что участь их предопределена - пройдут год или два, дожди ещё немного подмоют непрочную песчаную стену..."
    "Лена была здесь, куда-то пробираясь по-над краем. Прячась за деревом, я наблюдал, как она подошла к группе особняком стощих сосен и замерла перед ними неподвижно."
    jump alt_day6_uvao_left_UN_sandpit    
    
    # ГГ решает искать Лену. Высказывает беспокойные мысли на её счёт. Смотрит сквозь кусты - Лены среди зрителей нет.
    # Chess: "Сёмен на этой ветке тоже относительно опионерился, так что беспокойство за судьбу ближнего рулит, наверно. Ну и случай с Шуриком опять же показал, что Юля не так проста, как кажется."
    # ГГ не решается оповестить старших ("Чем я подтвердить смогу? Дураком буду выглядеть") и принимает решение найти Лену - мало ли что с ней могло случиться. Ещё удумает что!
    # ГГ решает начать поиски Лены с её домика, предварительно из кустов убедившись, что перед сценой её нет. Домик заперт, но вдруг замечает Лену вдалеке на дорожке (где-то возле домика ОД/ГГ), далее следуют кустами на юго-восток до карьера.

