# Убежали из изолятора методом с подаи Юли - сквозь стену


Я открыл глаза...
Что... что это было?! Я обернулся и тупо уставился на кирпичную стену с зарешеченным окном. Не веря глазам, я даже пощупал рукой - ну да, кирпич. 
Кто-то подхватил меня под руку. Юля.
- Видишь! Получилось! А ты никак не хотел.
Она была чрезвычайно довольна собой.
- Эээ... Подожди, Юля. Ты... видела что произошло?
- Ага. Ты вышел.
- Но... как?!
- Захотел и вышел, глупый. Я же тебе объясняла.
- Но все-таки... Ты хочешь сказать, для тебя это обычное дело? Ты часто так... выходишь?
- Выхожу и вхожу. Не часто, только когда очень хочу куда-нибудь попасть.
- И что получается, я теперь тоже так смогу?!
- Ага. Ты уже смог.
От разговора нас отвлек шум шагов. Кто-то идет! Кажется, это за мной...
Прячась в кустах, мы спешно ушли от медпункта подальше, в рощу. 
# Спортплощадка с зумом на лесок
Я тоже так смогу, значит? Ну-ка, проверим. Я опять крепко зажмурился и представил себе... ну, пусть будет музыкальный клуб. Итак, хочу в клуб!
# Пауза
Скоро Юля ткнула меня в плечо.
- Эй? Ты заснул?
Я открыл глаза - как и ожидалось, ничего не произошло.
- Не получается! Хочу в музыкальный клуб попасть, а ничего не происходит.
- А зачем тебе в клуб?
- Да ни зачем, просто попробовать хочу.
- Ну тогда и не надо туда идти, раз незачем! Что там интересного?
Мда. Лектор из нее тот ещё. Одно из двух - либо то, что произошло, случилось вообще без моего участия, либо я как-то не так пытаюсь повторить.
Тем временем ей, похоже, наскучил непонятный разговор, и она потащила меня куда-то дальше, вглубь рощи.
- Эй, погоди, куда это мы?
- Там много интересного! Сегодня столько всего происходит! 
Трудно было не согласиться.
- Да. Это уж точно!
- Я, перед тем, как к тебе придти, интересное смотрела. Там была музыка, одни пели и прыгали, а другие смотрели и громко руками хлопали. 
- А, концерт, что ли?
- Да! Очень понравилось. В этот раз, как ты приехал, все такое интересное!
От возбуждения она прямо подпрыгивала, кончик хвоста придерживался туда-сюда. 
# Лес
Мы дошли до забора и через какую-то дыру вылезли наружу.
- А тут что интересного?
- Мы! Давай играть!
- Играть? А во что?
Несмотря на ошарашенность от побега с помощью внезапной... телепортации, назовем это так, Юлина веселость и непосредственность делали свое дело. На ум приходили мысли об играх исключительно плотского характера.
Вместо ответа Юля засмеялась и убежала куда-то дальше по тропинке. Надо догонять!
Я бросился вперед, обогнул заросли малины… Никого! Где же она?
Бум!  Что-то тяжелое упало мне на плечи, сбив меня с ног и придавив к земле. Тяжелое, теплое и хихикающее.
- Поймала! Ты - мышь! И я тебя съем!
Она и вправду легонько куснула меня в шею. От теплого дыхания по спине пробежался ворох мурашек, вызывая желание выгнуться и замурчать. С кем поведешься...
Я улучил момент и перевернулся на спину. Юля, неожиданно лишившись опоры, повалилась на меня.
- Эй! Ты же мышь! Ты должен бояться и пищать!
Я рассмеялся.
- Хорошо. Пи-пи-пи-пи! 
- Вот. Теперь правильно!
Она прямо лучилась от гордости - такую добычу поймала! А я вдруг вспомнил, как она разбудила меня вчера в бункере, точно так же улегшись мне на грудь... И что произошло потом... И ее теперешнее положение идеально подходит для позы наездницы... если бы не моя одежда... ну а ее платье так вообще ничему не мешает...
Юля вдруг отпрыгнула и уставилась туда, где она только что сидела.
- Ой! Шевелится! Еще одна мышь?
Она так правдоподобно изображала готовность закогтить добычу, что я даже ей поверил. 
- Стоп! Эту мышь не надо ловить!
Юля фыркнула.
- Ну если тебе вчера не понравилось, тогда ладно.
- Да нет, мне понравилось! Просто… я так не привык.
- А как привык?
Сказать по правде - вообще никак не привык. Точнее, привык вообще никак. А вчерашнее -  там все сложилось из-за ее инициативы, да очень своевременного пинка от внутреннего комментатора. Кстати, что-то он помалкивает… 
- Ну не знаю… надо сначала погулять вместе, привыкнуть друг к другу. Сходить куда-нибудь.
- А! Тогда давай дальше гулять! 
Она вскочила и протянула мне руку. А я против воли скользнул взглядом от колен и выше, туда, где лишь тень от коротенького платья мешает рассмотреть в подробностях…
- Эй! Сам же сказал - сначала гулять! Вставай!
Я смущенно потряс головой и послушно поднялся. И мы пошли дальше по тропинке. 
Прогулка получилась довольно милой. Юля развлекалась как могла - гонялась за бабочками, пряталась в зарослях и внезапно нападала оттуда на меня, потом на время успокаивалась и мы просто шли обнявшись. И, конечно, задавала бесконечные вопросы обо всем подряд. Про музыкальные инструменты, которые она видела на концерте, про то, как готовят вкусную еду, про...
- Семён, а откуда дети берутся?
Я запнулся на полуслове. К такому жизнь меня не готовила!
- Эээ... как бы тебе объяснить... когда мужчина и женщина... это самое...
Я лихорадочно перебирал слова в поисках подходящего. Ах да, она ж про Ольгу с физруком рассказывала!
- эээ... спариваются, вот... у женщины может зародиться ребенок, и через некоторое время... девять месяцев, если быть точным... он рождается... наружу...
Юля, которая на протяжении всего рассказа украдкой хихикала в ладошку, не выдержала и расхохоталась в голос.
- Да я не об этом! Хотя очень интересно было послушать. Откуда дети в лагере берутся? Я видела только, как они приезжают на автобусе. А откуда они приезжают?
- Тьфу ты! Из города они приезжают. Они там живут, а в лагерь приезжают отдыхать.
- А как они там живут? Что они там делают?
- Ну как живут, по-разному. Учатся, занимаются делами всякими. Живут.
- А ты тоже в городе жил?
- Ага. Только не в этом, а в своем.
- И ты там тоже учился? И делами разными занимался?
- Ага, сначала учился, потом работал, то там, то сям.
- Это когда ты в свой квадрат смотрел, да? А зачем он?
- Хм, как бы тебе объяснить... он показывает разные штуки. С ним можно узнавать новые вещи. С ним можно разговаривать с другими людьми, которые далеко-далеко, и даже с теми, которых ты совсем не знаешь. В общем, с ним можно много чего делать, все и не перечислить. Ну и работать тоже можно, всякие вещи делать.
- Какие?
Вот и думай теперь, как объяснить кошке, что такое интернет-магазин и веб-сайт.
- А у Виолы тоже квадрат есть. Я в окно видела. Она тоже в нем работает? Или просто штуки смотрит?
- Наверное работает. Если, конечно, там у нее не проведен секретный правительственный интернет...
- Что?
- Нет, ничего, это я так... глупости говорю. 
Кстати, раз уж вспомнили о Виоле...
- А ты знаешь, они мне говорили, что ты опасная, и что надо от тебя держаться подальше.
- Глупые! Мы же гуляем, и ничего плохого не происходит. 
- Вот и я им говорил, а они меня заперли. Не любят они тебя, Юля.
- Ну и пускай, я их тоже не люблю.
- Виола так вообще как твое имя услышала - скривилась вся. Кстати, а почему тебя зовут Юлей?
- Потому что это мое имя. Меня всегда так звали.
- А кто? Ты ведь ни с кем не разговариваешь. Кроме меня.
- Другие... дети. И... Виола.
- Погоди, так ты с ней разговаривала?
- Я не помню... Только вспоминаю, как она мне говорит... 
"Юлия, это ведь очень опасно! Вы уверены?" - произнесла она, копируя голос Виолы.
- Откуда я это помню? Этого ведь не было. Я жила в старом доме, и ее там не было! Глупости какие-то вспоминаются, ну их!
- Ну и черт с ними. Они еще хотели всех отсюда эвакуировать. Увезти, то есть.
- Увозить?! Нет, не надо никого куировать!
Эта перспектива ее явно пугала. Что же я такого сказал?
- Нет, никого увозить не будут, сказали. Все равно смена заканчивается завтра, все и так уедут. 
- А, ну тогда ладно. Когда просто уезжают - это грустно, но так всегда бывает. А если увозят - это плохо...
Она помолчала, уткнувшись носом мне в плечо, потом вдруг заглянула мне прямо в глаза.
- Ты ведь не уедешь? Ты останешься со мной?
Как-то до сего момента я не задумывался о будущем. Да и какое у меня будущее, у меня тут даже прошлого нет! Одно было ясно - возвращаться в лапы лагерного начальства не хотелось. Сначала они меня запирают, чтоб я не встречался с Юлей, а потом, чего доброго, в психушку упекут!
- Останусь, конечно. С тобой.
Я чмокнул ее в с готовностью подставленную макушку. Почему-то мне было очень радостно от этих мыслей - остаться с Юлей в заброшенном лагере, жить в бункере, добывать пропитание... Проживём! А не понравится - в город выберемся, только сами, без всяких пионерских Икарусов. 
- Пойдем обратно? А то уже темнеет... Ты-то, конечно, видишь в темноте, а вот я - нет.


# Кусок можно сделать общим для двух бэдов:
Возвращались мы уже в темноте. Лагерь встретил нас музыкой, доносящейся от площади.
- Музыка! Там снова концерт?
- Нет, это дискотека. Танцуют там.
- Я хочу посмотреть! Пошли скорее!
Она поволокла меня вперед к площади.
- Подожди!... Да постой ты! Там сейчас толпа народу, тебя сразу заметят. Надо придумать, где спрятаться.
- Давай на крыше? На столовой.
- А как мы туда влезем?
- По стене. Я покажу!
По кустам, по задворкам мы зашли к столовой со стороны глухой стены. Кажется, этот тайный дворик испокон веков используется пионерами, чтобы укрыться от назойливой опеки вожатых и, скажем, засмолить сигаретку одну на всех. Или заняться еще чем-нибудь, столь же неодобряемым. 
Юля подвела меня к внутреннему углу дворика.
- Вот! Здесь можно залезть.
- Здесь?! Да тут же отвесная стена! Как я тут залезу?
- Глупый. Смотри, я научу!
Юля как-то уцепилась пальцами за кирпичи в стенах, и упираясь то в одну стену, то в другую, стала ловко взбираться наверх. Вскоре сверху послышался голос
- Понял? Вот так надо. Попробуй!
Ох, сомнительно мне что-то. 
Я не питал иллюзий относительно собственной ловкости и силы. Флаг на первый день: Десяток подтягиваний - это мой предел!
Тем не менее, я постарался повторить этот акробатический этюд. Одно хорошо - я вряд ли поднимусь на заметную высоту, прежде чем рухну вниз. Ну что ж, попробуем! Раз, два, и трииии...
Все оказалось не настолько сложным. Тело будто действовало само! Я легко переносил вес тела то на одну, то на другую сторону,  будто прирожденный паркурщик, и вскоре моему взору открылась терра инкогнита столовской крыши.
- Молодец! Я же говорила, это легко!
Юля сидела на краю, свесив ноги. Цепляясь за что попало, я перевалился через край крыши и распластался на рубероиде.
Дискотека тем временем была в самом разгаре. Сначала череда быстрых треков, потом парочка медляков, потом снова быстрые... Юля сосредоточенно следила за танцующими пионерами, подергивая хвостом в такт музыке.
- Я тоже хочу танцевать!
Внезапно огорошила она меня.
- Что, прямо здесь? Сейчас?
- Да! Давай танцевать!
И тут с площади раздалось -
- А сейчас - белый танец! Дамы приглашают кавалеров!
# Надо сюда "Кошку и дракона". Минусовки нет, так что просто музыку приглушить.
Я рассмеялся - вот ведь совпадение! - и подхватил протянутую руку.
Подчеркнуто шутовской поклон, не менее подчеркнутый книксен с хихиканьем в ответ, рука занимает свое место на талии партнерши - вальсируем! Первые движения получаются скомканными, но плюс танцев на крыше в отсутствии зрителей, и постепенно все налаживается. Юля учится быстро, а с ее ловкостью и гибкостью обычный медляк превращается в что-то напоминающее спортивную латину. Мне же остается только не стоять совсем уж бревном, да особо следить, чтоб не наступить ей на ногу - она все-таки босиком, в отличии от меня.

Музыка стихла, и мы остановились вместе с ней.
- Танцевать - здорово! 
Шепнула Юля мне на ухо, не торопясь разрывать объятия. Я же мог только кивнуть - голова слегка кружилась, то ли от танцев и от близости юной девушки, то ли от всех сегодняшних переживаний. Вздохнув, я шагнул назад...

Непонятно откуда взявшаяся бутылка выскользнула из-под ноги и, подпрыгивая по прошлогодней хвое, перекатилась за край крыши.
Дзынь! Внизу послышались торопливые грузные шаги.
- А ну стоять! Кто там лазит?
Саныч! Мы тут же присели и притаились, едва дыша. Юля смешно прижала уши, пытаясь выглянуть из-за края крыши, мне даже пришлось потянуть ее обратно.
А физрук внизу продолжал топать и грозить всеми мыслимыми карами гипотетическим пионерам. На что он рассчитывает, что у нас совесть проснется и мы вылезем с повинным видом?
- ...утром узнаю кто - простой уборкой не отделаетесь! Я вам... ох... ж... блинчатый кар-р-рась!
Поток ругательств резко оборвался, и медведь, судя по звукам, похромал в сторону скамейки.
- Борис? Что это с тобой?
- Да эти... чтоб их... кто-то стекло разбил, а я пошел посмотреть и напоролся. Новые кеды, блин!
Голос Ольги Дмитриевны стал более обеспокоенным.
- Ой, да тут не о кедах думать надо. Виола! Виола! Иди скорее сюда!
- Что за спешка... комсомольцы? Опять без трудностей не можете?
- Опять ты со своими шуточками! Смотри, как Борис себе ногу рассадил!
- Мда. Давай-ка его в медпункт... Под обе руки - взяли! Гордись, Бориска, когда еще доведется сразу с двумя дамами пообниматься...
Постепенно голоса удалились, и мы вылезли из укрытия, переводя дух.
- Давай дальше танцевать!
немедленно предложила Юля.
- Только давай больше ничего с крыши не сбрасывать.
И мы танцевали до самого закрытия дискотеки. А когда стихла музыка, мы долго сидели на краю крыши и смотрели на звезды. Наверное, полагалось бы целоваться, или даже искать укромное местечко для двоих, но…
- Чувствуешь? Булками пахнет.
Юля втянула носом воздух.
- Давай достанем! И будем кушать.
Она легко спрыгнула с крыши вниз, а я, не раздумывая, последовал за ней. Ого, как это я ловко приземлился! 
Юля уже дергала ту самую створку окна, возле которого я увидел ее в первый раз. Спустя минуту тихий скрип подтвердил - путь свободен, и мы влезли внутрь.
- Булки там!
бескомпромиссно заявила она и направилась в кухню. Я же занялся поиском более подходящих припасов - и через некоторое время на столе высилась горка рыбных и мясных консервов.
- Это железные штуковины с едой? У меня такие тоже есть, только я не умею открыть.
- Ничего, я тебе покажу. Будем питаться нормальной едой, а не одними булками да конфетами.
Эх, мне бы мой рюкзак! Как на зло, никаких сумок не попадалось. Пришлось импровизировать - снять рубашку и с ее помощью увязать банки в узел. Тяжело навьюченый, я вылез через окно. Юля спешно дожевывала очередную плюшку, и в руках у нее был еще десяток.
- Пошли! 
И мы пошли. Впереди топала она, держа хвост трубой, сзади плелся я с тяжеленным узлом на плечах. Всю дорогу я старался не споткнуться на корнях, и даже вид мелькающих впереди белых ягодиц, когда Юля сложила все свои припасы в подол платья, не особенно отвлек меня от созерцания почвы под ногами. 
Наконец мы добрались до старого лагеря, почти наощупь открыли люк, спустились вниз и остановились перед дверью. Кажется, опять нужна моя грубая сила…
Сбросив тюк куда-то на пол, я налег на колесо. Юля уже без лишних вопросов нажала на кнопку, и дверь отворилась. Дом, милый дом… Затащив внутрь припасы, я без сил рухнул на койку. Через некоторое время кто-то угнездился у меня на груди.
- Эй. Ты спишь, что ли?
каким-то недовольным голосом спросила Юля
- Извини... я очень устал.
- Ну ладно. Спи.
Она уткнулась носом мне в бок и мирно засопела. Практически тут же и я провалился в сон.






