# Убежали из изолятора методом с подаи Юли - сквозь стену


Я открыл глаза...
Что... что это было?! Я обернулся и тупо уставился на кирпичную стену с зарешеченным окном. Не веря глазам, я даже пощупал рукой - ну да, кирпич. 
Кто-то подхватил меня под руку. Юля.
- Видишь! Получилось! А ты никак не хотел.
Она была чрезвычайно довольна собой.
- Эээ... Подожди, Юля. Ты... видела что произошло?
- Ага. Ты вышел.
- Но... как?!
- Захотел и вышел, глупый. Я же тебе объясняла.
- Но все-таки... Ты хочешь сказать, для тебя это обычное дело? Ты часто так... выходишь?
- Выхожу и вхожу. Не часто, только когда очень хочу куда-нибудь попасть.
- И что получается, я теперь тоже так смогу?!
- Ага. Ты уже смог.
От разговора нас отвлек шум шагов. Кто-то идет! Кажется, это за мной...
Прячась в кустах, мы спешно ушли от медпункта подальше, в рощу. 
# Спортплощадка с зумом на лесок
Я тоже так смогу, значит? Ну-ка, проверим. Я опять крепко зажмурился и представил себе... ну, пусть будет музыкальный клуб. Итак, хочу в клуб!
# Пауза
Скоро Юля ткнула меня в плечо.
- Эй? Ты заснул?
Я открыл глаза - как и ожидалось, ничего не произошло.
- Не получается! Хочу в музыкальный клуб попасть, а ничего не происходит.
- А зачем тебе в клуб?
- Да ни зачем, просто попробовать хочу.
- Ну тогда и не надо туда идти, раз незачем! Что там интересного?
Мда. Лектор из нее тот ещё. Одно из двух - либо то, что произошло, случилось вообще без моего участия, либо я как-то не так пытаюсь повторить.
Тем временем ей, похоже, наскучил непонятный разговор, и она потащила меня куда-то дальше, вглубь рощи.
- Эй, погоди, куда это мы?
- Там много интересного! Сегодня столько всего происходит! 
Трудно было не согласиться.
- Да. Это уж точно!
- Я, перед тем, как к тебе придти, интересное смотрела. Там была музыка, одни пели и прыгали, а другие смотрели и громко руками хлопали. 
- А, концерт, что ли?
- Да! Очень понравилось. В этот раз, как ты приехал, все такое интересное!
От возбуждения она прямо подпрыгивала, кончик хвоста придерживался туда-сюда. 
# Лес
Мы дошли до забора и через какую-то дыру вылезли наружу.
- А тут что интересного?
- Мы! Давай играть!
- Играть? А во что?
Несмотря на ошарашенность от побега с помощью внезапной... телепортации, назовем это так, Юлина веселость и непосредственность делали свое дело. На ум приходили мысли об играх исключительно плотского характера.
Вместо ответа Юля засмеялась и убежала куда-то дальше по тропинке. Надо догонять!
Я бросился вперед, обогнул заросли малины… Никого! Где же она?
Бум!  Что-то тяжелое упало мне на плечи, сбив меня с ног и придавив к земле. Тяжелое, теплое и хихикающее.
- Поймала! Ты - мышь! И я тебя съем!
Она и вправду легонько куснула меня в шею. От теплого дыхания по спине пробежался ворох мурашек, вызывая желание выгнуться и замурчать. С кем поведешься...
Я улучил момент и перевернулся на спину. Юля, неожиданно лишившись опоры, повалилась на меня.
- Эй! Ты же мышь! Ты должен бояться и пищать!
Я рассмеялся.
- Хорошо. Пи-пи-пи-пи! 
- Вот. Теперь правильно!
Она прямо лучилась от гордости - такую добычу поймала! А я вдруг вспомнил, как она разбудила меня вчера в бункере, точно так же улегшись мне на грудь... И что произошло потом... И ее теперешнее положение идеально подходит для позы наездницы... если бы не моя одежда... ну а ее платье так вообще ничему не мешает...
Юля вдруг отпрыгнула и уставилась туда, где она только что сидела.
- Ой! Шевелится! Еще одна мышь?
Она так правдоподобно изображала готовность закогтить добычу, что я даже ей поверил. 
- Стоп! Эту мышь не надо ловить!
Юля фыркнула.
- Ну если тебе вчера не понравилось, тогда ладно.
- Да нет, мне понравилось! Просто… я так не привык.
- А как привык?
Сказать по правде - вообще никак не привык. Точнее, привык вообще никак. А вчерашнее -  там все сложилось из-за ее инициативы, да очень своевременного пинка от внутреннего комментатора. Кстати, что-то он помалкивает… 
- Ну не знаю… надо сначала погулять вместе, привыкнуть друг к другу. Сходить куда-нибудь.
- А! Тогда давай дальше гулять! 
Она вскочила и протянула мне руку. А я против воли скользнул взглядом от колен и выше, туда, где лишь тень от коротенького платья мешает рассмотреть в подробностях…
- Эй! Сам же сказал - сначала гулять! Вставай!
Я смущенно потряс головой и послушно поднялся. И мы пошли дальше по тропинке. 
Прогулка получилась довольно милой. Юля развлекалась как могла - гонялась за бабочками, пряталась в зарослях и внезапно нападала оттуда на меня, потом на время успокаивалась и мы просто шли обнявшись. И, конечно, задавала бесконечные вопросы обо всем подряд. Про музыкальные инструменты, которые она видела на концерте, про то, как готовят вкусную еду, про...
- Семён, а откуда дети берутся?
Я запнулся на полуслове. К такому жизнь меня не готовила!
- Эээ... как бы тебе объяснить... когда мужчина и женщина... это самое...
Я лихорадочно перебирал слова в поисках подходящего. Ах да, она ж про Ольгу с физруком рассказывала!
- эээ... спариваются, вот... у женщины может зародиться ребенок, и через некоторое время... девять месяцев, если быть точным... он рождается... наружу...
Юля, которая на протяжении всего рассказа украдкой хихикала в ладошку, не выдержала и расхохоталась в голос.
- Да я не об этом! Хотя очень интересно было послушать. Откуда дети в лагере берутся? Я видела только, как они приезжают на автобусе. А откуда они приезжают?
- Тьфу ты! Из города они приезжают. Они там живут, а в лагерь приезжают отдыхать.
- А как они там живут? Что они там делают?
- Ну как живут, по-разному. Учатся, занимаются делами всякими. Живут.
- А ты тоже в городе жил?
- Ага. Только не в этом, а в своем.
- И ты там тоже учился? И делами разными занимался?
- Ага, сначала учился, потом работал, то там, то сям.
- Это когда ты в свой квадрат смотрел, да? А зачем он?
- Хм, как бы тебе объяснить... он показывает разные штуки. С ним можно узнавать новые вещи. С ним можно разговаривать с другими людьми, которые далеко-далеко, и даже с теми, которых ты совсем не знаешь. В общем, с ним можно много чего делать, все и не перечислить. Ну и работать тоже можно, всякие вещи делать.
- Какие?
Вот и думай теперь, как объяснить кошке, что такое интернет-магазин и веб-сайт.
- А у Виолы тоже квадрат есть. Я в окно видела. Она тоже в нем работает? Или просто штуки смотрит?
- Наверное работает. Если, конечно, там у нее не проведен секретный правительственный интернет...
- Что?
- Нет, ничего, это я так... глупости говорю. 
Кстати, раз уж вспомнили о Виоле...
- Юля, а почему Виола думает, что ты - опасна? Они как узнали про то, что я с тобой вчера гулял, так перепугались, собирались уже всех отсюда эвакуировать. Увозить, то есть.
- Увозить?! Нет, не надо никого увозить!
Эта перспектива ее явно пугала. Что же я такого сказал?
- Нет, никого увозить не будут, сказали. Все равно смена заканчивается завтра, все и так уедут. 
- А, ну тогда ладно. Когда просто уезжают - это грустно, но так всегда бывает. А если увозят - это плохо...
- Так все-таки, почему они так тебя боятся?
- Не знаю. Я ни на кого не нападала, я только не люблю когда меня ловят!
- А... Шурик, вчера? Он тоже хотел тебя поймать?
- Да. Он хотел меня палкой ударить! Я его прогнала, и он убежал. А я потом видела, ты и остальные его поймали.
- Понятно... Он там вообще психованный был, тоже на нас с палкой бросался. Еле справились... Юля, а помнишь, ты еще про вожатую рассказывала, в старом лагере? Которая с тобой поговорить хотела?
- Нет, это я с ней поговорить хотела! И специально ее искала... Нет, не так. Это она меня искала, а потом я ее нашла и я ее испугалась... нет... Я запуталась...
Она выглядела совершенно растерянной и испуганной.
- Ну ладно, это неважно. А что потом случилось?
- Потом... потом она испугалась и я убежала. То есть сначала она разные вопросы задавала, не помню какие. А потом уже убежала, а я спряталась. Вот. 
- И всё? Больше ничего?
- Я... не помню. Помню, как мне стало страшно... очень страшно... А потом еще что-то совсем страшное случилось... и больше не помню. Мне очень страшно было. И очень плохо! Зачем ты мне напомнил?! Мне и сейчас страшно стало...
- Прости, я не знал.
Дело ясное, что дело тёмное. Юля так нервничала из-за этих расспросов, что у меня пропала всякая охота их продолжать. Я обнял ее и стал гладить по голове и мягким ушкам. Какая разница, что там произошло с этой вожатой, да еще лет дцать назад? 
- Пойдем обратно? А то уже темнеет... Ты-то, конечно, видишь в темноте, а вот я - нет.

# Кусок можно сделать общим для двух бэдов:
Возвращались мы уже в темноте. Лагерь встретил нас музыкой, доносящейся от площади.
- Музыка! Там снова концерт?
- Нет, это дискотека. Танцуют там.
- Я хочу посмотреть! Пошли скорее!
Она поволокла меня вперед к площади.
- Подожди!... Да постой ты! Там сейчас толпа народу, тебя сразу заметят. Надо придумать, где спрятаться.
- Давай на крыше? На столовой.
- А как мы туда влезем?
- По стене. Я покажу!
По кустам, по задворкам мы зашли к столовой со стороны глухой стены. Кажется, этот тайный дворик испокон веков используется пионерами, чтобы укрыться от назойливой опеки вожатых и, скажем, засмолить сигаретку одну на всех. Или заняться еще чем-нибудь, столь же неодобряемым. 
Юля подвела меня к внутреннему углу дворика.
- Вот! Здесь можно залезть.
- Здесь?! Да тут же отвесная стена! Как я тут залезу?
- Глупый. Смотри, я научу!
Юля как-то уцепилась пальцами за кирпичи в стенах, и упираясь то в одну стену, то в другую, стала ловко взбираться наверх. Вскоре сверху послышался голос
- Понял? Вот так надо. Попробуй!
Ох, сомнительно мне что-то. 
Я не питал иллюзий относительно собственной ловкости и силы. Флаг на первый день: Десяток подтягиваний - это мой предел!
Тем не менее, я постарался повторить этот акробатический этюд. Одно хорошо - я вряд ли поднимусь на заметную высоту, прежде чем рухну вниз. Ну что ж, попробуем! Раз, два, и трииии...
Все оказалось не настолько сложным. Тело будто действовало само! Я легко переносил вес тела то на одну, то на другую сторону,  будто прирожденный паркурщик, и вскоре моему взору открылась терра инкогнита столовской крыши.
- Молодец! Я же говорила, это легко!
Юля сидела на краю, свесив ноги. Цепляясь за что попало, я перевалился через край крыши и распластался на рубероиде.
Дискотека тем временем была в самом разгаре. Сначала череда быстрых треков, потом парочка медляков, потом снова быстрые... Юля сосредоточенно следила за танцующими пионерами, подергивая хвостом в такт музыке.
- Я тоже хочу танцевать!
Внезапно огорошила она меня.
- Что, прямо здесь? Сейчас?
- Да! Давай танцевать!
И тут с площади раздалось -
- А сейчас - белый танец! Дамы приглашают кавалеров!
# Надо сюда "Кошку и дракона". Минусовки нет, так что просто музыку приглушить.
Я рассмеялся - вот ведь совпадение! - и подхватил протянутую руку.
Подчеркнуто шутовской поклон, не менее подчеркнутый книксен с хихиканьем в ответ, рука занимает свое место на талии партнерши - вальсируем! Первые движения получаются скомканными, но плюс танцев на крыше в отсутствии зрителей, и постепенно все налаживается. Юля учится быстро, а с ее ловкостью и гибкостью обычный медляк превращается в что-то напоминающее спортивную латину. Мне же остается только не стоять совсем уж бревном, да особо следить, чтоб не наступить ей на ногу - она все-таки босиком, в отличии от меня.

Музыка стихла, и мы остановились вместе с ней.
- Танцевать - здорово! 
Шепнула Юля мне на ухо, не торопясь разрывать объятия. Я же мог только кивнуть - голова слегка кружилась, то ли от танцев и от близости юной девушки, то ли от всех сегодняшних переживаний. Вздохнув, я шагнул назад...

Непонятно откуда взявшаяся бутылка выскользнула из-под ноги и, подпрыгивая по прошлогодней хвое, перекатилась за край крыши.
Дзынь! Внизу послышались торопливые грузные шаги.
- А ну стоять! Кто там лазит?
Саныч! Черт, заметит же!
- Юля, надо удирать
- Прыгаем! И в ту комнату за железной дверью!
Эээ что?! Куда прыгаем, тут же высоты метров пять!
А хвостатая с места в карьер потащила меня за руку. Край крыши неотвратимо приближался.
- Юля... Юля, погоди! 
Поздно. Она оттолкнулась от ската крыши и мы взмыли в воздух...
Конец общего куска с танцами
В ожидании удара о землю я зажмурился. "Комната за железной дверью... это бункер, наверное..."
Удар действительно последовал, но какой-то... слишком мягкий. Открыв глаза, я увидел перед собой смеющуюся Юлю, а вокруг - стены того самого бункера! Над нами возвышался второй ярус кровати.
- Это что... мы прямо сюда прыгнули?...
- Ага! А он нас там ищет, наверно! А нас там нет! 
Она громко радовалась этому факту, а я вдруг осознал, что практически лежу на ней, уткнувшись лицом в декольте. Я попытался привстать, но в глазах потемнело, и я рухнул на матрац. Сквозь шум в ушах я услышал:
- Да, надо спать. От таких прыжков сильно устаешь.
Кружащаяся темнота сомкнулась надо мной...





