# Д6-левая ветка, поиски Лены во время концерта и сопровождение до карьера в левой ветке.
# План-набросок
#
label alt_day6_uvao_left_UN_search:
    # сцена не задаётся, переходит из предыдущего фрагмента
# пока что задаём сцену на время отладки
    play ambience ambience_camp_entrance_day fadein 3
    scene bg ext_stage_big_day:
        xalign .48 yalign .48 zoom 0.75
    show bush_frame at truecenter
    with fade 
# /пока что задаём сцену на время отладки
    #
    # концовка предыдущего фрагмента:
    # "Поняв, что от Юли я сейчас больше ничего уже не добьюсь, я решил не терять времени и поговорить наконец с самой Леной."
    # dreamgirl "Давно пора! А то строишь из себя какого-то великого сыщика, умора одна."
    # .............
    # th "Короче говоря, для начала я иду в библиотеку."
    # .............
    # "Обернувшись к Юле, я осторожно спросил у обращённой ко мне части её тела:"
    # me "Ну... я пойду тогда?"
    # "Юля не соизволила ответить на мой вопрос, лишь нетерпеливо дёрнув хвостом."
    # "Я счёл это за знак окончания аудиенции и скромно удалился."
    #
    # ГГ решает искать Лену. Высказывает беспокойные мысли на её счёт. Смотрит сквозь кусты - Лены среди зрителей нет.
    # Chess: "Сёмен на этой ветке тоже относительно опионерился, так что беспокойство за судьбу ближнего рулит, наверно. Ну и случай с Шуриком опять же показал, что Юля не так проста, как кажется."
    # ГГ не решается оповестить старших ("Чем я подтвердить смогу? Дураком буду выглядеть") и принимает решение найти Лену - мало ли что с ней могло случиться. Ещё удумает что!
    # ГГ решает начать поиски Лены с её домика, предварительно из кустов убедившись, что перед сценой её нет. Домик заперт, но вдруг замечает Лену вдалеке на дорожке (где-то возле домика ОД/ГГ), далее следуют кустами на юго-восток до карьера.

