label alt_day5_uvao_evening_nightmare:
    window hide
    $ renpy.pause(1)
    scene bg ext_house_of_mt_sunset with dissolve2
    window show
    "Впрочем, особого желания сидеть в прогревшемся за день домике у меня не было."
    "Вместо этого я с удовольствием развалился на стоящем у входа шезлонге и уставился в наливающееся закатным румянцем небо."
     "Ласковый ветерок чуть шевелил над головой ветви уже отцветающей, но всё ещё душистой сирени."
    th "Странно, лето уже явно за середину перевалило, а сирень всё ещё цветёт."
    "Лениво подумал я, бездумно пытаясь дотянуться рукой до ближайшей ветки, не отрывая при этом спины от шезлонга."
    dreamgirl "Тебе-то какая разница? Тоже мне, ботаник-любитель выискался."
    "Разницы особой и в самом деле не было, так что я просто добавил ещё один пункт к длинному списку местных странностей."
    "Впечатлений за день и так набралось предостаточно."
# Перечень впечатлений за день.
    "…"
    "Тем временем в небе разгорался роскошный закатный пожар, яростное буйство красок, такое же недолговечное, как и настоящее пламя."
    "Я лежал, любуясь великолепным зрелищем, и наслаждался покоем. Веки мои становились всё тяжелее…"
    "Но тут моё уединение было бесцеремонно нарушено."
    mt "Скажите пожалуйста! Все люди как люди, один ты опять бездельничаешь и отрываешься от коллектива!"
    "Я аж задохнулся от возмущения:"
    th "Ну да, конечно. Сама-то переработала прошлой ночью на пользу обществу, вот теперь на меня и срываешься."
    "Глядя на меня исподлобья она сварливо осведомилась:"
    mt "Ты почему в дом-то не идёшь спать? Стесняешься после сегодняшнего, что ли?"
    "Пока я растерянно хлопал глазами, вожатая скрылась внутри домика."
    "От обиды мне даже спать расхотелось, поэтому я никуда не пошёл, лишь устроился в шезлонге поудобнее."
    "Моё внимание привлекла ярко блеснувшая на фоне темнеющего востока искорка самолёта. Он летел высоко-высоко, выше облаков, оставляя за собой тонкую ниточку инверсионного следа."
    th "Интересно, а ведь я здесь за эти несколько дней ни одного самолёта не видел."
    "Лениво подумал я. С другой стороны - ну не видел и не видел.{w} Не пролегают здесь регулярные маршруты - ну и ладно. Меньше шума."
    "Солнце уже почти село за горизонт и лагерь тихо погружался в сумерки. Лишь редкие облака над головой по-прежнему были, словно светом красного прожектора, освещены солнцем."
    "Самолёт тем временем всё тянул и тянул в сторону заката, оказавшись уже почти в самом зените. Воздух наполнило становящееся всё громче басовитое урчание, неожиданно громкое для такой большой высоты."
    "Из домика деловито вышла Ольга Дмитриевна."
    mt "Семён, хватит валяться! Марш умываться и спать! Отбой уже скоро."
    "Она задрала голову. Гул двигателей теперь, наверное, было слышно уже и внутри домика."
    mt "Откуда здесь самолёт?!"
    "Судя по её изумлённому тону, почему-то она, в отличие от меня, никак не ожидала увидеть здесь самолёт, пусть и случайный."
    "В этот момент в вышине неба что-то изменилось. Позади самолёта, быстро отставая, затрепетал кажущийся крошечным отсюда язычок пламени."
    "Покосившись на вожатую я заметил, что она так и стоит, неудобно запрокинув голову и напряжённо вглядываясь в небо."
    "Через несколько секунд нечто, отделившеся от самолёта и теперь уже окончательно от него отставшее, начало вдруг расти в размерах.{w} Всё больше, больше…"
    "Наконец я понял, что это большой парашют… нет, даже связка из трёх больших… огромных парашютов, кажущихся багровыми в лучах заката."
    "Не меняя курса, самолёт всё с той же кажущейся неторопливостью отправился догонять совсем уже ушедшее за горизонт солнце."
    "На глазах небо менялось. От прежнего пурпура не осталось и следа, облака подёрнулись пеплом, и вечер готовился по-южному быстро уступить место ночи."
    "Рядом вдруг охнула Ольга.{w} Посмотрев на неё, я разглядел, несмотря на сгустившиеся сумерки, выражение откровенного ужаса на её лице."
    "Встретив мой взгляд, она попыталась что-то сказать, но лишь мучительно всхлипнула."
    me "Ольга… Ольга Дмитриевна, что случилось?! Что с Вами?"
    "Не отвечая, она лишь отчаянно замотала головой.{w} Наконец она с трудом выдавила из себя:"
    mt "Не могу… Не могу поверить…{w=1.0} Здесь же… Как они…"
    "Не договорив, она спрятала лицо в ладонях."
    "Ничего не понимая, я заворочался, пытаясь вылезти из шезлонга. Это движение словно подтолкнуло её."
    "Бросив на меня странный взгляд, Ольга вдруг бросилась бежать, не разбирая дороги, куда-то в сторону столовой."
    "Через несколько треск ломаемых ветвей затих и наступила тишина, разбавляемая лишь быстро слабеющим гудением самолёта."
    th "Куда это ей так приспичило?"
    dreamgirl "Да уж наверное не в столовую.{w} В спортзал она побежала. Может и успеет ещё. Минут пять у неё есть, наверное."
    "Внутренний голос прозвучал как-то очень спокойно и немного устало."
    th "Подожди, ты что-то понимаешь в происходящем? Что-то знаешь?"
    "Ответ Шизы был всё таким же непривычно спокойным:"
    dreamgirl "Ну и бестолковый же ты. Я ведь знаю ровно то же, что и ты, не больше и не меньше."
    dreamgirl "Ну напряги память, постарайся. Ты же совсем недавно от скуки читал статью на рукипедии.{w} Самолёт с характерным очень громким гулом, турбовинтовой… Натовцы ещё его \"медведем\" прозвали…"
    "В глазах потемнело и я упал обратно в шезлонг."
    dreamgirl "Ну вот, теперь и ты всё понял."
    "Обливаясь холодным потом, я забился, пытаясь встать."
    dreamgirl "Да не суетись ты. Даже сумей ты добежать до того бункера под старым корпусом, всё равно тебе это мало помогло бы."
    dreamgirl "Так что не парься. Вожатая-то быстро всё поняла и побежала прощаться.{w} А тебе и бежать не к кому, не соблаговолил обзавестись."
    "Отстранённо-равнодушный голос помог мне справиться с обезумевшим от животного ужаса телом. Заставив себя откинуться в шезлонге, я словно зачарованный уставился на повисшую надо мной Смерть."
    th "Странно, неужели сейчас всё и закончится? Вот так вот просто, без объяснений."
    dreamgirl "Ты знаешь,"
    scene white with flash
    window hide
    stop music fadeout 0
    stop ambience fadeout 0
    stop sound fadeout 0
    stop sound_loop fadeout 0
    $ renpy.pause(7, hard=True)
    with vpunch
    show unblink
    scene bg ext_house_of_mt_night
    play ambience ambience_camp_center_night fadein 1
    window show
    mt "Скажите пожалуйста! Все люди как люди, один ты опять бездельничаешь и отрываешься от коллектива!"
    mt "И вообще бесстыдно дрыхнешь здесь!"
    mt "Кстати, ты почему в дом-то не идёшь спать?"
    "Я лежал, словно парализованный, судорожно пытаясь вдохнуть хоть немного воздуха в сведённые спазмом лёгкие."
    "Не дожидаясь ответа, Ольга Дмитриевна развернулась и ушла в домик."
    "Наконец я смог справиться с дыханием и слегка дрожащей рукой отёр пот со лба."