# План-набросок на поездку в автобусе в Д7 гуд (тру и фальш)

# Сцена - лагерь, площадка перед воротами.

# ОД толкает речь на фоне ЦГ - подсмотреть у Автора.
# ГГ видит Лену (вероятно, в этот день - впервые, или до этого - только издали).
# В зависимости от выходов из Д6 Лена не поднимает глаз/смотрит мельком и сразу опускает глаза/смотрит смущённо, но с надеждой.
# В соответствии с этим ГГ предаётся краткой рефлексии. Боится, что Лена, чего доброго, решит сесть с ним.

# За рассадку пионеров в салоне энергично берётся ОД. Суда по их недовольно-удивлённой реакции - это непривычно, обычно все сами рассаживаются.
# В итоге ГГ оказывается на сиденье в последнем ряду (намёк понял, если вдруг куда денусь по дороге - меньше народу заметит), притиснутый к окну Элом (ну и ладно, этот хоть болтать не будет всю дорогу).

# Автобус отправляется. В окно светит солнце, в салоне жарко, потёртые красные занавески не помогают.
# Возможно, перекидываются парой незначительных фраз с Элом. Обоим неинтересно продолжать разговор.
# Не смотря ни на что, ГГ начинает клонить в сон от духоты (и общей усталости, если перед этим работал всё утро за Славю).
# Сквозь дрёму замечает, что Эл куда-то свалил (ну и ладно, меньше народу - больше...)
# Засыпает.

# Просыпается мордой в оконное стекло, частично - в занавеску. (возможно, здесь пустить в бэк размытый салон "Икаруса")
# Поднимает голову - салон пуст. (бэк - салон в фокусе)
# ГГ паникует, снова суётся в окно и немедленно натыкается на пристальный взгляд Мику по ту сторону стекла.
# ГГ приходит в ужас (Это уже было! Что, опять???), но тут Мику улыбается, отскакивает от окна автобуса и радостно кричит-тараторит "Да вот же он! Я говорила вам, что он опять спит! Он и в прошлый раз всё проспал, когда приехал."

# За грязноватым оконным стеклом ГГ обнаруживает вместо лагерных ворот какое-то здание/забор/что там найдётся для бэка точки прибытия.
# Слышим с улицы гомон.
# Похоже, остальные пионеры попросту успели выгрузиться, а Семёна никто не заметил.
# Над общим нестройным хором прорывается голос Ульянки: "Сейчас! Сейчас я его приведу, пропустите!!!"
# ГГ вдрагивает, представив себе "приведу" в её исполнении и торопится на выход.

# Сцена - точка прибытия.
# Суета, толпятся пионеры, частично перемешались уже со встречающими родителями.
# ОД мечется с какой-то бумагой, пытается родителей отловить и заставить в ней расписаться.
# На общем фоне выделяются Лена и Славя. Обе имеют вид до невозможности смущённый, у Лены лицо явно заплаканное. Увидев выбравшегося из автобуса ГГ, смущаются ещё больше (хотя, казалось бы, куда уж больше).

# Если в Д6 выяснили про наведённость влюблённости Лены, либо пошли через врезку и имели с ней беседу вечером, то она, кажется, порывается подойти к ГГ, но тут к ней подваливает какой-то родственник в милицейской форме.
# Если потребуется, то аналогично нейтрализуется Славя - её отлавливает крупная тётка (посмотреть в Мику-руте), Славя почему-то груснеет
# ГГ отвлекается на Алису. Та незаметно подходит сзади и:
# - Если вышли на тру и послали Алису за Леной, то дружеский (хотя и крепкий) тычок в плечо. Подмигивает: "Знаешь, хотела тебе сказать на прощание - а ты, новичок, не такой уж придурок, каким мне сначала показался.{w} Ну, бывай!". Хитро лыбится и уходит прочь, не оглядываясь.
# - В противном случае - проходя мимо, Алиса крепко задевает плечом. Бросает через плечо "Будь здоров, новичок!"
# В любом случае, ГГ потирает плечо и смотрит в гордую спину Алисы, волокущей здоровую сумку.

# На фоне всеобщего воссоединения родственников (возможно, краткое описание некоторых встречающих, подсмотреть в других рутах) ГГ падает духом и не представляет, что делать дальше. Минута слабости.

"Внезапно я со всей очевидностью понял - я остался {i}здесь{/i}.{w=1.5} Окончательно.{w=1.5} Пути назад больше нет.{w=1.5} Совсем."
th "И что мне теперь делать?"
"Я вдруг вспомнил, как потерялся в каком-то большом магазине, когда мне было года три, наверное."
"Только на минуту отвернулся от мамы, посмотреть на прикленный к стене плакат с красивой тётей в красном платке - и вдруг вокруг оказались одни чужие люди."
"Все куда-то спешили мимо, а мамы не было. Я понял, что пропал, и заревел, разумеется - а что ещё мне оставалось делать?{w} Все вокруг засуетились и страшно зашумели, а потом мама нашлась и подхватила меня на руки."
"Разумеется, с тех пор прошло лет двадцать пять..."
th "Минуточку... или пятнадцать? Надо бы всё-таки с возрастом для себя определиться, чтобы не путаться."
"Так или иначе, времени прошло достаточно, и реветь я не собирался."
th "Но всё-таки, что же мне делать дальше?"

# Возможно, здесь ГГ подспудно ожидает реплики Шизы, но там молчит наглухо, словно радио выключили.

# Рядом возникает ОД.
mt "Уф, наконец-то все! Вечно норовят забрать ребёнка, и сбежать, а у нас же отчётность!"
mt "Ты чего нос-то повесил?{w} Пойдём, будем теперь твои дела улаживать."
"Она тряхнула в воздухе какой-то довольно увесистой папкой на завязочках."
mt "Вот, всего-то неделю ты у нас, а уже сколько бумажек собралось!"
"Я опешил."
me "Это что, всё я? То есть, я хотел сказать, это всё про меня?"
mt "Ну а ты как думал? Всё-таки мы серьёзная контора, отчётность на уровне."
"Ольга внезапно помрачнела и тяжело вздохнула. Кажется, отчётность у них и впрямь была на уровне..."
"Рядом взревел проржавевшим глушителем милицейский \"бобик\". За окном я успел заметить знакомые зелёные глаза и смешной фиолетовый хвостик."
th "Так я и не узнал у Лены, крашеные у неё волосы, или здесь такой цвет и от природы бывает."
"Подумал было я, но тут же мысленно хлопнул себя по лбу:"
me "Ольга Дмитриевна, а по дороге ничего не случилось... Ну такого...{w} Я когда из автобуса вышел, у Лены со Славей какой-то странный вид был..."
"Ольга снова вздохнула."

# ОД излагает, что Лену со Славей отпустило (или только Лену, или только Славю - смотря по обстоятельствам Д6. Про другую девочку говорит смутно).

"Ольга упрямо тряхнула головой и на её лице вновь появилась лёгкая улыбка."
mt "Ладно, Семён, пойдём. Время уже к вечеру, а ещё столько всего надо успеть!"
