#
# Д5 - Возвращение в лагерь через стоянку с палевом.
#
# <---строки ниже удалить при сборке!>
#
# <---строки выше удалить при сборке!>
#
# для справки строка из uvao-D5-mines-sh.rpy
#    "Ольга Дмитриевна зачем-то обернулась и озабоченно обвела взглядом поляну. По-видимому, не найдя ничего подозрительного, она повернулась и скрылась за деревьями, вслед за остальными."

label alt_day5_parking_back:
show uv grin
"Я с облегчением перевёл дыхание и покосился на Юлю. Та стояла донельзя довольная, разве что не подпрыгивая на месте."
th "Ну да, она же говорила, что за нами, людьми, интересно наблюдать. А тут целый спектакль разыграли, как по заказу!"
dreamgirl "Или, скорее, гладиаторский бой. Всё как полагается - мечи, обманные удары…"
# бурчание в животе
"Однако тут желудок изволил напомнить о себе, и мои мысли приобрели совершенно другое направление:"
th "Ё-моё, время-то уже к полднику, а я сегодня даже и не завтракал!"
dreamgirl "Вот они, вредные привычки холостяцкой жизни. Нельзя же так не любить свой организм.{w} И вообще, жениться тебе надо, барин!"
"Похоже, Юля тоже правильно поняла ситуацию."
show uv laugh
uv "А, так ты есть хочешь! Угадала?"
"Я смущённо пожал плечами и честно признался:"
me "Ну да… Со вчерашенего вечера ничего не ел!"
show uv normal
"Это плохо. Есть надо обязательно! Мне вот очень не нравится, когда я голодная."
"Юля сразу посерьёзнела - видимо, в отличие от меня, о питании своего организма она заботилась своевременно."
"Впрочем, почти тут же она снова заулыбалась:"
show uv smile
uv "А давай пойдём, поедим?{w}"
dreamgirl "Конечно-конечно. Чем там у нас кошки питаются? Как насчёт свежепойманной мышки? Вку-у-усная! Или белку предпочитаете?"
"Моё альтер эго как в воду глядело, потому что следующей фразой Юли было:."
uv "Здесь мыши знаешь какие вкусные. Пойдём наловим."
"Юля облизнулась, обнажив острые зубки."
dreamgirl "Соглашайся, соглашайся! Когда у тебя будет ещё шанс попробовать такой чудный деликатес!"
me "Да как бы, понимаешь… Мы-то, люди, мышей обычно не едим…"
"Я замялся, боясь обидеть Юлю отказом, но "
uv "Чудные вы. Вкусно же!"
# show uv surprise
"Кажется, на лице Юли было написано искреннее недоумение: не любить мышей, слыханное ли дело?"
uv "А чем тогда тебя покормить? Орехи будешь? Ягоды есть. И грибы ещё."
"Услышав про более привычную еду я несколько воспрял духом. Ну да, она же говорила, что припасы делает.{w} Хоть что-то из этого должно оказаться съедобным!"
me "Во-во! Ягоды с орехами подойдут."
show uv normal
uv "Ну пошли тогда."
"К некоторому моему удивлению, Юля направилась не к люку в туннель, а к выходу из здания. Заметив мой недоумённый взгляд, она пояснила:"
uv "Пойдём здесь, так ближе!"
# скрип люка
"Я прикрыл на всякий случай крышку люка и поспешил за ней."
# СК снаружи
"Выйдя на поляну, Юля уверенно двинулась по направлению к тропинке, ведущей к лагерю."
th "Надеюсь, она знает, что делает. Не хватало ещё столкнуться со всей этой компанией."
dreamgirl "Правильно, совершенно это незачем! Мало того, что с расспросами привяжутся, так ещё и, как пить дать, заставят Шурика носить!"
# тропинка глухая
"Впрочем, очень скоро Юля уверенно свернула с тропинки и нырнула в кажущиеся отсюда непроходимыми заросли кустарника."
hide uv with easeoutleft
"Стараясь не отставать, я бросился следом"
show uv normal close
extend "… И чуть не сбил Юлю с ног."
"Она стояла на краю какой-то ямы, казавшейся отсюда бездонной - всё внутри скрывал густой мрак."
me "Э-э… Нам сюда что ли?"
"Я опасливо кивнул на оскаленную пасть провала.{w} К сожалению, Юля подтвердила мои опасения:"
uv "Ну да, здесь спустимся."
"Не успел я глазом моргнуть, как она присела на корточки и ловко спрыгнула куда-то вниз, в темноту."
hide uv
"Впрочем, снизу тут же послышался её жизнерадостный голос:"
uv "Прыгай сюда, здесь неглубоко!"
"Мне совсем не улыбалось снова лезть в эти проглятые подземелья с риском сгинуть там навсегда, но есть хотелось сильнее, чем жить."
"Вздохнув, я бросил прощальный взгляд на море живой зелени вокруг и сиганул вниз."
# тоннель с дырой в потолке
"Однако всё оказалось не так уж плохо - пролетев от силы метра два или три, я довольно удачно приземлился на кучу земли вперемешку с камнями."
"На ногах, впрочем, мне удержаться не удалось. Поднявшись и пытаясь отряхнуться, я осмотрелся."
th "Опять туннель… Кажется, это тот самый провал, через который от нас Шурик сбежал.{w} Или другой? Здесь всё такое похожее."
show uv normal
"Юля стояла рядом. В рассеянном свете, пробивавшемся через дыру в потолке, её глаза таинственно поблескивали."
show uv smile
uv "Пойдём!"
"Она уверенно двинулась куда-то в темноту. Мне не оставалось ничего другого, как последовать за ней."
"После яркого дневного света в туннеле мне показалось ещё темнее, чем раньше.{w} Буквально через несколько шагов я перестал что-либо различать вокруг."
"Решив не дожидаться, пока я напорюсь на какую-нибудь железяку, я включил трофейный фонарь."
# туннель (со светом фонарика, если есть)
show uv upset
uv "Не свети в глаза."
"Юля недовольно сощурилась, и я поспешил отвести фонарь в сторону."
uv "Не понимаю, зачем вам эти светящие штуки. Здесь и так всё хорошо видно."
me "Ну, наверное, у людей не такое хорошее зрение."
# темнота
"Тем не менее я выключил фонарь и постоял несколько секунд, слепо тараща глаза."
me "Тогда ты веди меня за руку, пока я к темноте не привыкну, хорошо?"
uv "Хорошо!"
"Впрочем, на этот раз Юле совсем недолго пришлось вести меня за собой - очень скоро она остановилась и, подумав немного, заявила:"
uv "Ладно, включай эту штуку… Фонарь, вот. А то ты так еду не увидишь."
show uv normal
# туннель (со светом фонарика, если есть)
# для кладовки бэк не меняем, поскольку не на что
show uv normal
"Я огляделся. Мы стояли всё в том жет туннеле, но однообразаня непрерывность стен в этом месте нарушалась нешироким проходом явно рукотворного происхождения."
"За ним оказалось какое-то небольшое помещение."
th "Наверное, это какая-то насосная или ещё что-нибудь такое."
"Впрочем, первоначальное назначение этой каморки сейчас угадать было непросто.{w} Всё доступное пространство занимала теперь {i}еда{/i}."
"Связки грибов, свисающие с потолка, ровные кучки орехов и ягод… Да, запасов здесь действительно хватило бы на всю зиму."
"Однако, очень быстро мой энтузиазм насчёт предстоящей кормёжки дал трещину. Похоже, большая часть припасов лежала здесь уже не один год…"
me "И ты здесь все свои запасы хранишь?"
"Поинтересовался я больше для того, чтобы прервать наступившее молчание."
show uv grin
uv "Нет, что ты! У меня ещё несколько таких мест есть. Я там тоже еду запасаю."
"Она вручила мне горсть прошлогодних орехов."
show uv smile
uv "Угощайся!"
"И сама принялась хрумкать ими, выплёвывая скорлупки."
th "Что же, орехи - выбор настоящих укротителей кошкодевочек…"
"Положив фонарик на пол, я обречённо принялся бороться с орехами, пытаясь не сломать зубы. Ссохшиеся за год ядра по твёрдости также мало уступали скорлупе."
show uv shocked
"Вдруг Юля замерла, широко раскрыв глаза."
me "Что, что-то случилось? Ты кого-то почуяла?"
uv "Слу-у-ушай! Раз ты придумал, как ту дверь железную открыть…"
hide uv
"Она бросилась в угол, принявшись что-то там ожесточённо ворошить, и через несколько секунд вернулась назад."
show uv smile
uv "Вот! Я это в столовой взяла. Я точно знаю, что там еда внутри!"
show uv guilty
uv "Вот только достать не могу…{w} "
"Я уставился на консервные банки в её руках."
show uv normal
uv "Смотри, они тоже железные, как дверь! Открой, а?"
"Я аккуратно положил остатки орехов обратно в кучу на полу."
me "Знаешь, нам сказочно повезло! Я как раз крупный специалист в этой области! Разумеется, я их открою!"
show uv laugh
"Тут я обратил наконец внимание, что свет от фонаря совсем пожелтел и на глазах становится всё слабее."
show uv smile
me "Вот только давай отнесём их куда-нибудь, где есть свет - фонарик скоро погаснет совсем, а в темноте их открыть не получится."
me "Пойдём к тому месту, где мы в туннель спустились? Там светло."
"Юля согласно кивнула и мы, сложив банки в мой рюкзак, отправились обратно."
dreamgirl "А потом окажется, что консервы эти времён войны. Какие там первые симптомы ботулизма?"
th "Тьфу на тебя! Не смей портить настроение!"
# тоннель с дырой в потолке
"К моей радости, инсинуации Шизы оказались беспочвенными - у консервов даже не кончился срок годности."
"Я кое-как открыл перочинным ножом сардины в масле для Юли, и вступил в схватку с банкой, таящей в своих недрах, если верить этикетке, тушёную говядину."
"Юля с опаской принюхалась к содержимому банки."
uv "А это точно можно есть? Ты точно уверен?"
"Я пожал плечами и, подцепив ножом кусочек рыбы, отправил его в рот."
me "Нормальные консервы. Если тебе не понравится - я их сам с удовольствие съем."
"Юглядя на меня, Юля наконец тоже решилась."
show uv grin
uv "Умм! Вкусно!"
"Я ожесточённо заработал ножом, и следующие несколько минут мы оба были страшно заняты, уплетая содержимое всех банок подряд."
show uv smile
"Наконец с едой было покончено и я сыто привалился к стене туннеля."
th "Ну вот, поели – теперь можно и поспать…"
# насчёт набухшего синяка сомнительно - уточнить согласованность
dreamgirl "Ты что, сдурел? Тебя уже давно в лагере хватились! Пора ноги делать.{w} И кстати, насчёт ног…"
"Действительно давешний синяк набух и почернел, а нога снова начала ныть. Надо бы к доктору Виоле сходить."
"Со страшной силой дала о себе знать усталость, накопленная за день. Впрочем, Юля выглядела, бодрой как огурец."
me "Юль, а здесь есть какой-нибудь короткий путь в лагерь?"
show uv normal
uv "Да. Пойдём."
# Темнота
"И снова тёмные тоннели и штольни, которые мне уже осточертели за этот день."
"Я уже давно перестал ориентироваться и просто послушно шагал за своей проводницей в полной темноте, не решаясь лишний раз включить севший фонарик."
"После невообразимого количества развилок мы наконец остановились."
uv "Посвети."
# здесь выходим не в подсобку "Лена-дура", а попадаем снова в туннель, к вентшахте под стоянкой. См. схему
# решётка запирается на ключ, найденный в туннелях и он-таки подходит, хотя и с трудом - заржавело всё (не путаем с другим ключом от вентшахты под Гендой)


# Неиспользуемый фрагмент спуска через люк и бункер
#
# "И она направилась обратно к люку."
# смена сцены
# скрип люка
# темнота
# Сборщику: Необходимо будет проверить, что оброненный Шуриком фонарь уже используется ранее.
# "После яркого дневного света в шахте под люком мне показалось так же темно, как и в прошлый раз.{w} Решив не дожидаться, пока глаза привыкнут к темноте, я включил трофейный фонарь."
# туннель (со светом фонарика, если есть)
# show uv upset
# uv "Не свети в глаза."
# "Юля недовольно сощурилась, и я поспешил отвести фонарь в сторону."
# uv "Не понимаю, зачем вам эти светящие штуки. Здесь и так всё хорошо видно."
# me "Ну, видимо, у людей не такое хорошее зрение."
# темнота
# "Тем не менее я выключил фонарь и постоял несколько секунд, слепо тараща глаза."
# me "Тогда ты веди меня за руку, пока я к темноте не привыкну, хорошо?"
# uv "Хорошо!"
# "Впрочем, на этот раз Юле недолго пришлось вести меня за собой - очень быстро я начал различать свет далёкого светильника, да и идти по знакоймой дороге было не в пример проще."
# show uv normal
# "Несколько минут, и мы оказались у знакомой уже двери."
# гермодверь
# "Открыть гермодверь, из-за которой я, словно Железный Дровосек, чуть не отрубил сам себе ногу, теперь не составило никакого труда."
# бункер
# "Не задерживаясь в бункере, мы Задерживаться в бункере необходимости не было и мы просто прошли дальше."
# "Некоторое время мы шли в молчании. Я не знал, о чём спросить кошкодевочку, и она тоже не проявляла желание разговаривать."


"Скрипучий люк был всё на том же месте, темнота внизу тоже. Хотя теперь у меня же есть фонарь, который Шурик так удачно обронил во время нападения."
uv "Не свети в глаза."
"Юля недовольно сощурилась и я поспешил отвести фонарь в сторону."
uv "Не понимаю, зачем вам все эти светящие штуки. Здесь ведь и так всё хорошо видно."
me "Ну видимо у людей не такое хорошее зрение."
"Идти с фонарём оказалось гораздо быстрее и я почти не отставал от Юли, которая шла впереди и сворачивала то вправо, то влево. Открыть гермодверь, из-за которой я, словно Железный Дровосек из сказки Волкова, чуть не отрубил сам себе ногу, теперь не составило никакого труда. Задерживаться в бункере необходимости не было и мы просто прошли дальше."
"Некоторое время мы шли в молчании. Я не знал, о чём спросить кошкодевочку, и она тоже не проявляла желание разговаривать."
dreamgirl "Я знаю! Девочка-девочка, а зачем тебе такие большие у-ш-и?"
th "Всё шутишь…"
dreamgirl "А чё ты ты такой серьёзный?"
"Шиза надулась и умолкла."
me "Юль, а далеко ещё?"
"Наконец спросил я."
uv "Почти пришли."
"Юля свернула куда-то в неприметную пещерку и я последовал за ней. И чуть не стукнулся головой об выступ. Потому что это была не пещера, а просто выемка в стене. Куда же делась Юля? Присмотревшись, я разглядел наконец узкий лаз внизу. И что, мне туда лезть надо?"
uv "Семён, лезь сюда"
"Юля позвала меня, подтверждая мои мысли"
me "Да я же не пролезу, здесь узко."
uv "Что же вы такие неуклюжие-то, люди.. – в который раз уже подивилась кошкодевочка."
me "Ну вот какие есть.. Мне почему-то стало стыдно за людей. И что мы, в самом деле такие неуклюжие."
"Обо всё этом я думал, протискиваясь в дыру. А ну как застряну? И никто ведь не вытащит потом. Потому как никто не знает где я. Но хвала рандому, мне удалось протиснуть свою бренную плоть сквозь камни."
dreamgirl "Ну ты прямо Дэвид Копперфилд! - Восхитилась Шиза."
"Лаз закончился небольшой пещерой. В ней было каким-то образом светло, несмотря на отсутствие видимых источников освещения. Сначала я не понял причины столь непонятного явления. Но присмотревшись, заметил некие флюоресцирующие кристаллы, торчащие из стен. Они излучали мягкий свет и создавали ощущение спокойствия и умиротворения. Вообще в пещере было довольно уютно."
"Связки грибов на потолке, ровные кучки орехов и ягод.. Да, запасов здесь хватит действительно на всю зиму."
me "И здесь ты живёшь? Поинтересовался я."
uv "Угу. Она вручила мне горсть орехов. - Угощайся."
"И сама принялась хрумкать ими, выплёвывая скорлупки. Орехи- выбор настоящих укротителей кошкодевочек.."
"Ладно, поели – теперь можно и поспа.. Нет, никакого сна. А то меня уже давно наверное в лагере хватились. Пора ноги делать. Кстати в прямом смысле. Синяк набух и почернел, а нога снова начала ныть. Надо бы к доктору Виоле сходить."
"К счастью, вылезти оказалось проще, чем залезть. Всё же я не Винни-Пух и съел не так много. Со страшной силой дала о себе знать усталость, накопленная за день. А Юля ничего, бодрая как огурец. Она выпорхнула из лаза вслед за мной."
me "Юль, а здесь есть какой-нибудь короткий путь в лагерь? Поинтересовался я."
uv "Да. Пойдём."
"И снова тёмные тоннели, которые мне уже осточертели за этот день. Я уже давно перестал ориентироваться и просто послушно шагал за своей проводницей. После невообразимого количества развилок, показалась старая деревянная дверь. Наверное шахтерский привал, судя по развешенным лампам и лопатам."
uv "Сюда. Юля махнула рукой на дверь."
"Небольшое усилие и дверь со скрипом отошла в сторону. После затхлых и душных тоннелей, в комнате было как-то прохладно и свежо. Я огляделся. Исписанные приличными и не очень словами стены, мусор, битое стекло. Среди надписей выделялась одна, написанная особенно крупным шрифтом. «ЛЕНКА-ДУРА». Интересно, что за Ленка? Не та ли няша-стесняша из лагеря?"
uv "Дальше есть люк наверх. Только ключ к замку не подходит, я пробовала."
me "Ключ? У тебя есть ключ? – удивился я."
uv "Да, где-то в тоннелях нашла."
dreamgirl "Ключ-с, моя прелесть. Мы нашли его в тёмных тоннелях-с. Мерзские Семены-с хотят отобрать у нас нашу прелесть-с"
"Ну раз ключ не подходит.. Взгляд мой упал на валяющийся кусок непонятной железяки. Может этим?"
"И в самом деле, сбить замок арматурой не составило никакого труда. Люк открылся подозрительно легко и бесшумно, будто кто-то недавно смазал петли. Получается, что этим ходом регулярно пользуются? Да, в этом лагере много странного."
"Юля вылезла вслед за мной и теперь потягивалась в свете вечернего уже солнца. Я что, провёл в шахтах весь день?!"
"Закрыв люк за собой, я огляделся. Интересно, где это я?"
"Какой-то постамент памятника какому-то пионеру, ворота.. Да это же выход из лагеря ! Ничего себе..Интересно, много ли ещё здесь таких люков? Мы отошли к воротам."
me "Ну я пойду?"
uv "Конечно."
me "Эмм.. Спасибо тебе."
"Юля улыбнулась."
uv "Приходи ещё. Было весело."
"Она поднялась на цыпочки и неловко чмокнула меня в щёку, отчего я покраснел как варёный рак."
uv "Принесёшь мне ещё булочек? Я буду ждать."
"Да, сначала булочки, а потом уже Семён.."
me "Обязательно. - Я приду к тебе завтра. Весело ответил я. У меня было чудесное настроение."
"Возникшая вдруг сумасшедшая идея требовала немедленной реализации."
me "Не двигайся. Попросил я Юлю."
uv "Что ты собираешься сделать? Немного настороженно спросила она."
me "Хочу тебя сфотографировать."
uv "Меня.. что?"
me "Сейчас увидишь. Я пытался говорить как можно более успокаивающим тоном, каким обычно разговаривают с детьми и животными.
Я достал смарт и включил режим камеры."
me "Юль, смотри, сейчас отсюда вылетит птичка."
uv "Птичка? Заинтересованно спросила Юля. Какая птичка? Вкусная? И она облизнулась."
me "Да нет, это так обычно говорят, когда фотографируют. Просто смотри на меня и не двигайся."
"Я зафиксировал Юля в видоискателе, нажал на кнопку.. И в этот момент произошло одновременно несколько вещей.
Вспышка смарта, крик неизвестно откуда взявшейся вожатой и взъерошенная Юля, пропавшая через мгновение."
mt "Семён! Ты, с этой!"
me "Вы о чём, Ольга Дмитриевна? Вежливо поинтересовался я."
mt "Не придуряйся! Я всё видела! Ты, с этой кошкой.. ! От возмущения вожатая даже начала задыхаться."
"Теперь уже злиться начал я."
me "Значит когда я вчера вам рассказывал о своём видении, это была чушь и попытка отвильнуть от зарядки, а сегодня выясняется, что вы про неё знаете! - Нехорошо, Ольга Дмитриевна, нехорошо."
mt "Не смей так разговаривать со старшими! – Поговорим об этом позже, а сейчас марш на ужин!"
"И в самом деле, по лагерю разносился сигнал горна, означающий, что пришло время наполнить свой организм необходимым количеством белков, жиров и углеводов."
