# Д6-левая ветка, расспросы Мику о Лене.
# План-набросок
#
# Устанавливает флаг разговора с Мику о Лене alt_uvao_D6_left_MI_talk
#
label alt_day6_uvao_left_ask_MI_about_UN:
    #Приходим сюда сразу из меню "Поговорить с Мику"
    # сцену не выставляем
# выставляем сцену на время отладки
    scene bg ext_dining_hall_near_day with dissolve
    play ambience ambience_camp_center_day fadein 2
# /выставляем сцену на время отладки

    "Решив, что расспросить хорошенько соседку Лены - не такая уж плохая идея, я не стал откладывать дело в долгий ящик."
    "Осторожно заглянув ещё раз в столовую, я убедился, что никого с ультрамариновыми волосами там не наблюдается."
    "В нерешительности я остановился было на крыльце, но потом сообразил, что подготовка к предстоящему концерту вряд ли может обойтись без руководителя художественного кружка."
    "Рассудив, что даже если и не застану там Мику, то наверняка найду кого-нибудь, кто знает, где её искать, я направился к сцене."
    scene bg ext_stage_big_day with fade
    play sound_loop ambience_medium_crowd_outdoors fadein 2
    "Возле сцены было людно и шумно. Пионеры всех возрастов таскали туда-сюда провода и какие-то коробки, мешая нескольким парам, репетирующим на авансцене нечто среднее между полькой и канканом."
    "В глубине сцены отчаянно пытались повесить постоянно падающее синее с жёлтый цветочек полотнище."
    "В вышине надо всем этим бесстрашно возился с софитами худенький мальчишка, ежесекундно угрожая свалиться своим товарищам на голову вместе с раскачивающейся стремянкой."
    "В довершение всего на скамейках перед сценой сразу несколько человек пытались распеваться - и разумеется, каждый тянул что-то своё, недовольно косясь на конкурентов."
    "Впрочем, тоже Мику была здесь. Более того, довольно быстро я обнаружил, что именно оня является центром вснго этого поющего, пляшущего и тащущего вихря."
    "Я не мог удержаться, чтобы не полюбоваться пару минут зрелищем со стороны, но потом вспомнил всё-таки, зачем я здесь, и направился к Мику."
    scene bg ext_stage_near_clear with dissolve
    show mi normal pioneer at cright with dissolve
    mi "Алёша, отстаёшь, отстаёшь всё время! Не спи!"
    "Крикнула Мику одному из танцоров и повернулась ко мне."
    mi "Ой, Семочка, как хорошо, что ты пришёл! Я тебя совсем последнее время не видела, ты где-то всё пропадал. Ты не болел, нет? Я надеюсь, что не болел, это так обидно, когда все гуляют, а ты болеешь!"
    if alt_day2_club_join_musc:
        show mi sad pioneer at cright with dissolve
        mi "Только ты должен был зайти ко мне в кружок, раз записался! Ну хоть один разок! Мы бы тебе тоже номер какой-нибудь хороший приготовили, а теперь уже времени нет, не успеем никак!"
    show mi smile pioneer at cright with dissolve
    mi "Но так хорошо, что ты сейчас пришёл, ребята не справляются, они стараются, но там как раз надо принести..."
    me "Мику, стой!"
    show mi surprise pioneer at cright with dissolve
    "Рявкнул я, пока меня не успели припахать к какому-то Важному Делу. Получилось не слишком вежливо, но зато Мику запнулась посреди своей пулемётной очереди, и я поторопился этим воспользоваться:"
    me "Мику, мне надо с тобой поговорить. Срочно."
    "Девочка с готовностью кивнула и тут же снова открыла было рот, но я немедленно перебил её во второй раз:"
    me "Про Лену."
    "Мику отчего-то замялась и согласилась как-то неуверенно:"
    mi "Ну да, про Лену... Конечно, давай."
    me "Скажи, ты за ней ничего необычного не замечала в последнее время?"
# ЛБ: переписать след. реплику. Пусть тараторит, какая Лена умница, нахваливает её! Одним словом, исподволь рекламирует перед ГГ, что может породить смутные сомнения у него.
    mi "Ну, как сказать... Леночка, она же такая тихая, скромная. Всё больше одна где-нибудь с книжками сидит, или рисует."
    "Мику явно не потребовалось много времени, чтобы вновь выйти на обычный темп."# Я уже собирался вновь перебить её, но она вдруг сама заговорила медленнее."
#
    mi "Хотя, вот ты сейчас меня спросил, даже странно... Последние несколько дней она и впрямь сама не своя стала. Совсем задумчивая стала и какая-то, не знаю как сказать... грустная, наверное, но пару раз я видела, как она сидит, и улыбается так хорошо, так славно! Ты знаешь, будто что-то очень хорошее вспомнила."
    "Тут Мику вдруг смутилась и спросила меня с подозрением:"
    mi "Сеня, а ты почему вдруг меня про Лену спрашиваешь, а?"
    "Я постарался сделать вид, что не понял вопроса:"
    me "Ну ты же её соседка, кого же мне ещё про неё спрашивать?"
    mi "Да нет, я... Васенька, правее, надо, правее! И ближе к краю сцены!"
    "Закричала вдруг Мику возившемуся с софитами пионеру. Тот в очередной раз покачнулся вместе со своей стремянкой, но устоял и усердно принялся что-то там поправлять."
    "Пользуясь тем, что Мику на секунду отвлеклась от мыслей о причинах моих расспросов, я поторопился спросить:"
    me "Скажи, а когда всё это с Леной началось? Ну вот грустить она начала и всё такое?"
    mi "Ну я не знаю, с неделю назад, наверное.{w} Да, точно! До этого всё так ровно было, что даже скучно, а потом накануне того дня, как вы в столовой в карты играли, она совсем поздно пришла спать. Как раз, когда ты приехал."
    mi "Ну что поздно - это ладно, она часто поздно приходит, в библиотеке с Женей сидит, но в тот раз спать не легла, а всю ночь сидела и рисовала до самого утра, ты представляешь? И рисунки показывать не захотела, сразу спрятала, хотя раньше всегда показывала! И потом тоже много рисовала, и прятала!"
    "Девушка вдруг покраснела и, потупив глаза, смущённо призналась:"
    mi "Ты знаешь, Сёма, я вчера посмотрела эти рисунки после обеда, пока вы все в лес за Александром ходили."
    "На фоне всех этих \"Сёмочек\" и \"Васенек\" то, как она произнесла имя \"Александр\", прозвучало неожиданно сухо, но мне сейчас не было дела до того, чем очкарик сумел ей досадить. Мику тем временем принялась оправдываться:"
    mi "Нет-нет, я конечно знаю, так нельзя делать, у всех могут быть свои секреты, а тем более тут искусства касается, я-то понимаю..."
    "Мику запнулась и, стрельнув лукаво глазками, призналась:"
    mi "Если честно, мне очень интересно было. Не удержалась."
    me "Ну, и что там оказалось, на этих рисунках-то?"
    "Не вытерпел я, сам себе поражаясь - торопить девочку пулемёт, это надо же!"
    "Мику пристально на меня посмотрела."
    mi "Ты."
    me "Не понял... Что \"я\"?"
    mi "На рисунках был ты.{w} Почти на всех."
    "Мику больше не улыбалась, глядя на меня непривычно серьёзно. Она даже тараторить перестала, вместо этого говоря медленно, тщательно подбирая слова:"
    mi "Там почти на всех рисунках был ты. Только на некоторых был именно ты, такой как сейчас вот, а на некоторых словно старше, что ли. И, знаешь... отстранённый какой-то, недобрый. Лена ведь очень хорошо рисует, а по этим особенно видно, что с чувством рисовала. Ты там как живой получился." # ЛБ Возможно, Мику, слегка хихикая, упоминает пару рисунков в стиле ню.
    mi "И ещё, ты знаешь... среди этих рисунков была пара особенно странных. На них какой-то большой город, незнакомый, но только... только я думаю, что это где-то не у вас, не в Союзе. Но выглядит очень реально, не похоже на выдумку."
    th "Мои портреты и большой город, но не в СССР? Это-то здесь при чём? Ничего не понимаю."
    dreamgirl "Возьми, да спроси. Может, Мику что-то напутала. Почему-то я сомневаюсь, что Лена бывала за границей. Не те времена."
    me "Мику, скажи, а почему ты решила, что город заграничный?"
    "Мику задумалась на несколько секунд, старательно наморщив лоб, покусывая губу и не обращая больше никакого внимания на происходящую вокруг суету. Я затаил дыхание, надеясь, что никто её не отвлечёт каким-нибудь срочным вопросом."
    mi "Я не уверена, но... На одном рисунке был вид из окна на город. Зимний город. Там вблизи обычные многоэтажные дома, я такие в Москве у вас видела, в жилых районах на окраине. А вот вдали, на горизонте - небоскрёбы. А папа мне говорил, что таких у вас не строят у вас не строят."
    mi "А вот на втором рисунке - какая-то городская улица, или перекрёсток. Там всё другое - и дома не такие, и машин полным-полно, не как у вас, да и сами машины совсем не похожи на ваши, эти... \"Жигули\", да? Я, конечно, не знаток, но всё-таки..."
    mi "И ещё там на улице везде реклама, реклама - на стенах домов, поперёк тротуара... Были даже нарисованы... эти... не знаю, как по-русски... щиты такие большие с рекламой, на столбе..."
    me "Баннеры? Или билборды?"
    "Неуверенно подсказал я. Мику обрадованно кивнула."
    mi "Точно, билборды - только ведь это они так по-английски называются. А ты откуда знаешь?"
    "Не дожидаясь моего ответа, девочка упрямо дёрнула головой, заставив ультрамариновые волосы качнутся упругой волной."
    mi "В общем, я такое в Америке ещё ожидала бы увидеть, ну или в Японии, хотя у нас там тоже не так всё, но никак не здесь. Я, может, и мало где в Союзе была, но всё-таки телевизор смотрю и кино ваши видела многие, и папа мне много рассказывал и разные альбомы с фотографиями показывал..."
    "Здесь Мику почему-то погруснела и подытожила:"
    mi "Словом, я не знаю, где Лена такое могла увидеть. У вас ведь с этим не очень, с поездками за границу, да?"
    "Я молча кивнул. Насколько я знал, в конце восьмидесятых с поездками {i}туда{/i} в стране действительно всё ещё было {i}не очень{/i}."
    
        
# После обеда ГГ вновь терзается _явными_ подозрениями насчёт Юли, но он не уверен до конца.
# Повторно размышляет, что Мику может что-то знать, раз соседка.
# Идёт к сцене - Мику наверняка должна быть там.

# Как и сказано в бабле, разговор происходит в атмосфере суматохи и судорожного бардака.
# На вопрос, не замечала ли за Леной что-то странное в последнюю неделю, Мику начинает тараторить всё подряд, но вдруг выдаёт, что да, стала совсем задумчивая, грустит-плачет, и т.п. Эмоциональные изменения, короче.
# Говорит, что в первую ночь, как ГГ приехал - Лена до утра сидела и рисовала что-то, и потом тоже. Рисунки категорически не показывает - прячет.
# Мику смущённо признаётся, что тайком посмотрела рисунки. Там много ГГ.
# Перестаёт тараторить и, подбирая слова, говорит, что рисунки странные. ГГ - это явно ГГ, но какой-то другой и старше. Особо упоминает один или два рисунка с видами города, но не в Союзе, наверное, а зарубежного. - Почему город зарубежный? Объясняет, что архитектура несовременная (там Питер, но Мику его не видела вживую, поэтому не называет, хотя, возможно, упоминает пару узнаваемых архитектурных ориентиров), но очень много машин, прямо-таки битком, на улицах висят "эти... я не знаю как по-русски... баннеры... ну - такие плакаты с рекламой поперёк улицы" и другая реклама. Возможно, ещё какие-то приметы 2013-2014-го годов. "У вас, в Союзе, не так как-то всё.". Одним словом, ГГ должен смекнуть, что Лена рисует то, чего не видела и видеть не могла, зато ГГ это вполне знакомо.
# Отвлекают окончательно.

# После разговора с Мику замечаем недалеко от сцены препирающихся ОД и Алису.

# Далее строго по баблу ГГ ищет Юлю
    $ alt_uvao_D6_left_MI_talk = True
    stop sound_loop fadeout 1

    jump scenario_uvao_debug # заглушка - выход в меню отладки
    #
    jump alt_day6_uvao_left_ask_UV_about_UN

