label alt_day5_uvao_ev_beach_event:
# Заглянули на пляж, чтоб искупаться
# Видим Славю в раздрае чувств
# Славя на вопросы не отвечает, но внезапно предлагает искупаться вместе

После такого напряженного дня мысль искупаться казалась весьма здравой.
Я неспеша дошел до вотчины Ольги Дмитриевны - слава рандому, сейчас ее тут не было, и некому было устроить мне внеочередную выволочку за... да за что угодно!
Я нашел подходящий пятачок земли и уже начал развязывать осточертевший галстук, как вдруг заметил кого-то в дальнем углу пляжа.
Она сидела, уткнувшись лицом в колени, косы безвольно стелились по земле. Такой Славю я еще не видел. Она что, плачет?
# обрывки фраз - что-нибудь про "последний день" "сплошная выдумка"?
шз: "И ты, как рыцарь на белом коне, должен немедленно утешить печальную деву. Преисполненная благодарности, она падет тебе на широкую грудь и доверит все свои тайные секреты. 
Например, что такое таинственное она хранит на складе."
"А почему бы и нет? Не проходить же мимо. Я от нее ничего, кроме хорошего, не видел, может, смогу помочь чем-то?"
Чувствуя себя донельзя неловко, я направился к ней, старательно шурша ногами по песку - чтобы она не подумала, что я подкрадываюсь.
гг: "Эм… Славя?"
сл: "Семен. Что тебе?"
Она так и не подняла голову, голос ее звучал глухо и неприветливо.
гг: "Да в общем-то ничего… Я просто искупаться собирался…"
сл: "Одному нельзя. Не положено. Надо, чтоб кто-то из вожатых присматривал."
гг: "Вот как… Жаль…"
Я сел рядом. Не зная чем занять руки, я сорвал какую-то травинку и стал обрывать с нее семена. Славя так и сидела спиной ко мне, не шевелясь.
шз: "Кажется, с утешением и падением на грудь возникли проблемы. Может быть, она сценарий не читала?"
гг: "Славя… У тебя все в порядке?"
сл: "Нет. Но это неважно."
Что-то мне подсказывает, что я тут нежеланный гость.
гг: "Ты извини, что я навязываюсь… но… может, я смогу момочь?"
сл: "Вряд ли…"
Да, так и есть. Наверное, сейчас стоит встать и уйти… Да, вот сейчас… Сейчас встану, извинюсь и пойду… 
сл: "…хотя…"
гг: "Да?"
Она подняла голову, провела ладонями по лицу, стирая слезы… 
"Действительно плакала!"
… потом повернулась ко мне, нацепив свое обычное оптимистичное выражение лица.
сл: "Знаешь, это ведь одному нельзя. А нас тут двое, значит можно!"
гг: "Э… что?"
Я, сбитый с толку таким внезапным разворотом на 180, удивленно уставился на нее. 
сл: "Ну ты ведь хотел искупаться? Вот я и говорю, давай вместе искупаемся."
Славя слегка покраснела и затеребила косу, но твердо смотрела на меня, не отводя взгляда.
сл: "А если хочешь…{w} может быть…{w} и не только искупаемся…"
"Ого! Неожиданно…"
шз: "Не то слово! Похоже, ты незаметно для себя мутировал в альфа-самца. Других объяснений ее поведению я не вижу."
гг: "Э… извини, я… я… ядолженидтиуменядела…"
Пробормотав какие-то невнятные извинения, я поднялся и, не оборачиваясь, покинул пляж. Почему-то мне показалось, что Славя тихонько вздохнула с облегчением.
шз: "Опять сливаешься?"
"Уж больно это все подозрительно. Она мне нравится, не спорю, но такой резкий переход… Что-то странное тут происходит."
шз: "Не верю, что я это говорю, но тут я с тобой соглашусь. Славя совсем на себя не похожа сегодня."
"Не, что-то многовато тайн на сегодня. Утро вечера мудренее."
