label alt_day5_uvao_ev_beach_event:
# Заглянули на пляж, чтоб искупаться
# Видим Славю в раздрае чувств
# Славя на вопросы не отвечает, но внезапно предлагает искупаться вместе

После такого напряженного дня мысль искупаться казалась весьма здравой.
Я неспеша дошел до вотчины Ольги Дмитриевны - слава рандому, сейчас ее тут не было, и некому было устроить мне внеочередную выволочку за... да за что угодно!
Я нашел подходящий пятачок земли и уже начал развязывать осточертевший галстук, как вдруг заметил кого-то в дальнем углу пляжа.
Она сидела, уткнувшись лицом в колени, косы безвольно стелились по земле. Такой Славю я еще не видел. Она что, плачет?
# обрывки фраз - что-нибудь про "последний день" "сплошная выдумка"?
шз: "И ты, как рыцарь на белом коне, должен немедленно утешить печальную деву. Преисполненная благодарности, она падет тебе на широкую грудь и доверит все свои тайные секреты. 
Например, что такое таинственное она хранит на складе."
"А почему бы и нет? Не проходить же мимо. Я от нее ничего, кроме хорошего, не видел, может, смогу помочь чем-то?"
Чувствуя себя донельзя неловко, я направился к ней, старательно шурша ногами по песку - чтобы она не подумала, что я подкрадываюсь.
гг: "Эм… Славя?"
сл: "Семен. Что тебе?"
Она так и не подняла голову, голос ее звучал глухо и неприветливо.
гг: "Да в общем-то ничего… Я просто искупаться собирался…"
сл: "Одному нельзя. Не положено. Надо, чтоб кто-то из вожатых присматривал."
гг: "Вот как… Жаль…"
Я сел рядом. Не зная чем занять руки, я сорвал какую-то травинку и стал обрывать с нее семена. Славя так и сидела спиной ко мне, не шевелясь.
шз: "Кажется, с утешением и падением на грудь возникли проблемы. Может быть, она сценарий не читала?"
гг: "Славя… У тебя все в порядке?"
сл: "Нет. Но это неважно."
Что-то мне подсказывает, что я тут нежеланный гость.
гг: "Ты извини, что я навязываюсь… но… может, я смогу помочь?"
сл: "Вряд ли…"
Да, так и есть. Наверное, сейчас стоит встать и уйти… Да, вот сейчас… Сейчас встану, извинюсь и пойду… 
Славя подняла голову, провела ладонями по лицу, стирая слезы… 
"Действительно плакала!"
… потом повернулась ко мне, нацепив свое обычное оптимистичное выражение лица.
сл: "Не волнуйся, все в порядке. Ну, почти.{w} А у тебя?"
гг: "Э-э-э… Да вроде тоже неплохо."
За исключением таинственных подземелий, психованных пионеров, кошкодевочек и прочего вороха тайн.
сл: "Теперь тебе здесь больше нравится?"
"О чем это она вообще?"
гг: "Ну… да, нравится. Здесь хорошо."
сл: "А у тебя никогда не было чувства, будто весь этот лагерь придуман специально для тебя?{w} Как будто он - исполнение твоей мечты? Будто ты всегда хотел попасть сюда, но не мог?"
гг: "Знаешь, я как-то не задумывался на эту тему."
сл: "А если задуматься? Похоже?"
"Да что ей надо-то от меня? От Шурика бещенство подхватила, что ли?"
гг: "Ну… ээ… наверное… да."
сл: "Правда?"
Она вперилась в меня взглядом, ожидая моего ответа, и от этого взгляда мне стало как-то неуютно.
гг: "Ээ… да. Правда. Так и думаю. Очень похоже."
"Лучше во всем с ней соглашаться."
Славя как-то обреченно вздохнула, но больше вопросов не задавала. Просто сидела, уставясь на воду.
гг: "Ладно, я, наверное, пойду… Пока…"
Я постарался удалиться как можно незаметнее. По крайней мере, Славя никак не отреагировала на мой уход.
"Странная она сегодня какая-то…"
Не-е-ет, все, хватит на сегодня тайн. Пора в кроватку, утро вечера мудренее.
