# План-набросок на поиски Лене во время концерта и сопровождение до карьера в левой ветке.


label alt_day6_uvao_left_UN_search:
    # сцена не задаётся, переходит из предыдущего фрагмента
    # концовка предыдущего фрагмента:
    # "Тут со стороны сцены внезапно грянула музыка, разом заглушив шум, производимый десятками пионеров, и несколько детских голосов, вступив невпопад, затянули про \"солнечный круг, небо вокруг\"."
    # "Юля подпрыгнула и, задрав хвост, бросилась к крайнему ряду кустов, пытаясь между ветками рассмотреть происходящее на сцене."
    #
    #
    # ГГ пытается продолжить расспросы, но послан Юлей далеко на юг.
    # Chess: "Если ты мне и дальше мешать будешь, я щас под сцену уползу!"
    #
    # ГГ решает искать Лену. Высказывает беспокойные мысли на её счёт. Смотрит сквозь кусты - Лены среди зрителей нет.
    # Chess: "Сёмен на этой ветке тоже относительно опионерился, так что беспокойство за судьбу ближнего рулит, наверно. Ну и случай с Шуриком опять же показал, что Юля не так проста, как кажется."
    # ГГ не решается оповестить старших ("Чем я подтвердить смогу? Дураком буду выглядеть") и принимает решение найти Лену - мало ли что с ней могло случиться. Ещё удумает что!
    # ГГ решает начать поиски Лены с её домика, предварительно из кустов убедившись, что перед сценой её нет. Домик заперт, но вдруг замечает Лену вдалеке на дорожке (где-то возле домика ОД/ГГ), далее следуют кустами на юго-восток до карьера.

