# Д5-ужин после палева на стоянке
#
#
label alt_day5_uvao_spoled_supper:
    $ persistent.sprite_time = "sunset"
    $ sunset_time()
    window hide
    scene bg int_dining_hall_people_sunset
    with dissolve
    play ambience ambience_dining_hall_full fadein 3
    window show
	#засоня/болтун с кошочками - ни разу не охотник
	#Семёна воспитывают, огрызаемся, намекнув, что вожатые в лагере тоже не сильно моральны. Получаем немножко инфы от Виолы, ОД в смущении

В столовую мы шли вместе с Ольгой Дмитриевной. Всю дорогу она хранила зловещее молчание, которое пугало меня больше самых громких криков. Шедшая со стороны клубов Славя сначала хотела что-то сказать, но потом видимо передумала, посмотрев на мрачное лицо вожатой.
Впрочем Ольга Дмитриевна, видимо угадав намерение Слави, сама обратилась к активистке.
ОД:  - Что у тебя, Феоктистова ?
С: - Да я хотела.. Замялась Славя.
ОД: - Ну говори, что случилось-то ? 
С: - Алиса снова Сыроежкину угрожает. А тут ещё эта история с Александром. Он сейчас в медпункте и не может моральную поддержку Сергею оказать.
ОД: Ох уж, эта Двачевская.. Вздохнула Ольга Дмитриевна.  – Я её ведь предупреждала сколько раз.. 
Пока Славя, так кстати попавшаяся нам на глаза, отчитывалась вожатой, я решил воспользоваться моментом и проверить снимок Юли на смартфоне. С момента появления Ольги Дмитриевны на стоянке, у меня ведь так и не выдалось случая рассмотреть его как следует. Более того, в тот момент я еле успел спрятать телефон в карман. Хвала рандому, вожатая была так шокирована Юлей, что не обратила на него внимания. 
Очень кстати остался в бункере и мой рюкзак. Не представляю, что бы подумала наша любимая надзирательница, увидев меня в полной походной выкладке. Надо, кстати, будет сходит  за ним как-нибудь незаметно. Только, боюсь, я у вожатой теперь на особом положении буду..
Итак: галерея, последние снимки..  ! Мать моя женщина !   !  !!   Вместо ожидаемого изображения Юли я увидел НЕЧТО.  Я не силён в астрономии, но ближе всего к увиденному подходило понятие ГАЛАКТИКА. В угадывающемся силуэте Юли мерцала система из звёзд и звёздных скоплений, межзвёздного газа и пыли, а может даже и тёмной материи.
Что же это ? Может быть у меня включился какой-то фото-фильтр ? Но я никогда раньше не видел такого  у себя в телефоне. Брак самого снимка ? Тоже маловероятно. Или же.. Сердце вдруг заколотилось с бешенной скоростью. Юля ненастоящая !  Она мне привиделась ! Я схожу с ума !
Ш: «Да-да, расскажи мне об этом. -  Подключилась к разговору Шиза.  -Ненастоящая кошкодевочка с ненастоящими ушами и ненастоящим хвостом спала у тебя на груди. Ходила вместе с тобой по тоннелям, хрумкала орехи и таскала еду из лагеря. Она существует, поверь мне. Кроме того, вожатая тоже её видела. Получается, она тоже сошла с ума ? Это ведь только гриппом все вместе болеют, а с ума сходят исключительно поодиночке. Уж я-то знаю толк в таких вещах. Да и тебе ли бояться шизы ? Как говорится, зараза к заразе не пристаёт »
Последний довод Шизы показался мне убедительней всего. 
С: »Но ЧТО же она тогда такое ?»
Ш: «А вот этого я пока не знаю, дружок. Мало данных».
ОД: -Пойдём Семён. Потянула меня за руку вожатая, закончившая свои расспросы. Кажется она немного успокоилась. Отвлеклась, должно быть. И слава Богу. Меньше всего мне хотелось сейчас скандалить. Кажется с момента прибытия в лагерь, я только и занимаюсь отстаиванием своей точки зрения.
После традиционного мытья рук, мы наконец отправились в столовую.  Там было как всегда – то есть шумно и многолюдно. Пионеры весело болтали и смеялись, не забывая поглощать ужин. И никто из них не представлял, какой неприятный разговор меня сейчас ожидает. Впрочем, я и сам, признаться,  не знал, чего ожидать от Ольги Дмитриевны.  Что она, в конце концов, может мне предъявить ? То, что болтался вне стен лагеря ? Ну болтался и болтался, что с того ? Не я первый в самоволки хожу и не я последний.
Ш: «А как же Юленька ?»  Шиза в своём репертуаре. Никогда не упустит случая съехидничать.
Ш: »Да-да, как же наша кошкодевочка ?»
С: «Не наша. Пока»
Ш: «А хочется ?»
С: «Возможно»
Ш: "Тогда всё отрицай и ничего не подписывай»  И Шиза зашлась демоническим хохотом.
Я уже хотел сесть за свободный столик около входа, но вожатая остановила меня.
ОД:  -Не сюда. Во-о-н туда проходи. И показала на стол для персонала  в дальнем углу, где сидела … доктор Виола. 
Она-то здесь зачем ? Нет, зачем она здесь это понятно. Но зачем мне проходить именно к ней за стол ? Ведь Виолу к воспитанию пионэров привлекали в исключительных случаях. Во избежание, так сказать. А что в моём случае ожидается процесс воспитательный, параллельно с питательным,  не было никаких сомнений. И дело действительно серьёзное. Хорошо, хоть Саныча не привлекли.
Ш: «Может тебя даже из пионеров исключат». Притворно шмыгнула носом Шиза. «Горе-то какое»
Не удостоив её ответом, я плюхнулся за стол. Как ни странно, о моём пропитании уже кто-то позаботился. Тарелка с картофельным пюре, дымящаяся, источающая самый что ни на есть восхитительный аромат котлета и горошек.  А компот !? Ах, да, вот и он. Всё как обычно.  Я с наслаждением втянул носом запах горячей еды. Как же мне нравится этот лагерь ! 
Орехи (которыми я угостился у Юли), хоть и являются ценным источником сложных белков, но в качестве пригодной еды для растущего организма подходят слабо. Да и мало их было. Надеюсь сервировкой стола занималась не Ульянка. Не хотелось бы снова ужинать сколопендрой.
В: - Ты ешь, ешь, пионер. Приглашающим жестом показал на тарелку Виола.  - Здоровое питание прежде всего.
Я не заставил себя упрашивать и набросился на еду. Ольга Дмитриевна присела радом. А Виола между тем продолжила:
В: - Ешь и одновременно рассказывай. Я понимаю, что разговаривать с набитым ртом- это нарушение  всех педагогических и медицинских норм, но сейчас, как ты сам понимаешь, случай исключительный.
С: - А что собственно рассказывать ? Осведомился я, откусив кусок котлеты.
В: - Как что ? Спокойно сказал Виола.  – Про нашу легенду лагерную.  Тебя видели вместе с ней. И с ней же ты весь день провёл, как я предполагаю, исходя из того, что тебя никто не мог нигде найти.
ОД: - Именно так, никто не мог найти. Подключилась к разговору вожатая. - Ты снова игнорируешь  коллективные мероприятия.  Кроме того, у нас здесь Шурик пострадал. А теперь  оказывается ещё и ты подвергаешь свою жизнь опасности.
С: - Шурик пострадал ? Деланно удивился я. Видимо, уловив что-то, Виола пристально посмотрела на меня, но ничего не сказала. А вот вожатая кажется ничего не заметила.
ОД :- Да, потерялся в лесу. А когда мы нашли его, вёл себя странно, пытался напасть. Мы смогли его успокоить..
Как же, видел-видел. Методы самые что ни на есть пионерские.
ОД: ..- смогли успокоить, но ты, между прочим, должен был помочь нам  в поисках. Так тебе никогда не стать порядочным пионером ! 
Да, кажется моё собственное достоинство всё-таки нуждается в отстаивании.  Но без скандала !
С: - Ольга Дмитриевна.  Как можно более деловым тоном обратился я к вожатой.  – А ведь некоторые вожатые, не будем показывать пальцем, тоже не являют собой образец нравственности. Как же я могу стать порядочным пионером, если мне не с кого брать пример ?
ОД: - Семён. Что ты несёшь !?  Возмутилась Ольга Дмитриевна.
С: - Да я даже не знаю, с чего собственно начать. С вашей «активной» педагогическо-воспитательной работы, в виде лежания в шезлонге с книгой, или с загорания на пляже, в то время как подконтрольные вам пионеры выполняют ваши бессмысленные поручения, или с вечерних посиделок с физруком ? 
Если первая половина моей относительно гневной тирады, кажется прошла мимо вожатой, то вторая, похоже, попала не в бровь, а в глаз. Она даже не нашлась, что ответить и молча смотрела на меня. Удивлена была и Виола, но похоже не так сильно. Кажется в её полуулыбке было больше удовлетворения, как будто она что-то знала, а я своими словами лишь подтвердил её предположения.
ОД:  -Семён.. Я не знаю, что ты там себе напридумывал, но..  
 Теперь голос её звучал уже не так уверенно. Смущение ? У нашей вожатой ? Да она на себя не похожа.  Мне даже на какой-то момент стало стыдно. И за себя и за неё. И что я правда физрука сюда приплёл ? Ведь собственно лично мне Ольга Дмитриевна ничего плохого не сделала.  А ведь её за аморалку и из комсомола исключить могут.
За столом повисло напряжённое молчание. За разговорами я даже не заметил, что все пионеры уже давно закончили есть и разошлись. Столовая опустела. Дежурные подметали пол, протирали столики и поднимали стулья.
Наконец Виола решила прервать затянувшуюся паузу.
В: - Подождите, Ольга Дмитриевна.  Обратилась она к вожатой.  – Семён. Теперь она смотрела на меня. И я вдруг заметил, что она впервые назвала меня по имени. – Мне кажется мы, как взрослые люди, могли бы найти разумный компромисс.
В: - Прежде всего, я хочу предупредить тебя, Семён, о возможной опасности со стороны этого.. (она пошевелила пальцами, пытаясь подобрать определение поточнее).. явления. Мы не знаем, ЧТО это такое, мы не знаем, ЧЕГО можно от него ожидать. Ты можешь конечно не обращать внимания на мои предостережения, но я надеюсь на твою рассудительность.
Пока я переваривал эту информацию, она повернулась к вожатой, всё ещё пребывающей в состоянии лёгкого шока. 
В: -Оля, я думаю, можно предоставить мальчику некоторую свободу действий и сделать его пребывание в лагере.. более комфортным. В пределах разумного, конечно.
В: -Только не думай, пионер, что это подействовал твой детский шантаж.  Она строго посмотрела на меня. - Моя задача следить за психологическим климатом в лагере. А сейчас , я думаю, нам всем пора идти.
Вместе с Ольгой Дмитриевной мы шли к нашему домику, так как уже приближалось время отбоя. Думаю, сегодняшние посиделки..
Ш: «полежалки»
 ..полежалки с Санычем отменяются.
ОД:  - Семён. Не думай, что ты победил. В моих силах сделать твоё пребывание в этом лагере не то, что более комфортным, но и вообще невыносимым.
С: - Я понимаю, Ольга Дмитриевна. 
ОД:  - Вот и хорошо. И она, впервые за весь вечер улыбнулась.
Да, денёк сегодня был ещё тот, подумал я, заходя в домик. Раздеваться сил уже практически не было. Спать, спать, спать.. 
ОД: - Кстати, Семён. Ты ведь в библиотеку так и не записался ? 
С:- Нет.. растерянно ответил я.  Какая уж тут библиотека.
ОД: - Ну вот. Пришлось учебник твой обратно сдать. Женя хватилась. Не бери  больше без спроса. Как говорится: нет читательского билета – нет и книжек.
Она, что, все книжки свои наизусть знает ? Кто бы мог подумать, что она в библиотеке не только спит. Но вслух сказал только:
С: - Хорошо, Ольга Дмитриевна.
ОД:  - Молодец. Спокойной ночи. Не забудь завтра навестить Александра в медпункте. 
И она потушила свет. Ну а я моментально провалился в сон.
