# Побег в убежище, вечером Д6
# Зайти можно через беседу в изоляторе, или сбежать с пляжа
label alt_uvao_D6_shelter_runaway:

"Пока я собирался с духом, эта кошка без особых затей спрыгнула в зияющую бездну."
uv "Давай, тут невысоко!"
"раздалось оттуда."
if alt_uvao_D5_hentai:
    "Несколько раз выдохнув, я оттолкнулся  от осыпающегося склона и полетел в неизвестность."
else:
    "Не рискуя повторять ее трюк, я лег на живот и постепенно стал сползать вниз, цеплясь руками за траву и нашаривая ногами опору,{w} которой все не было и не было."
    th "Придется прыгать!"
    "Собравшись с духом, я разжал пальцы…"

th "ДЖЕРОНИМО-О-О!"
"..." with vpunch
"Внизу меня встретила куча земли, и еще несколько комьев свалилось мне на голову."
th "На самом деле не так уж и высоко…"
"Я огляделся. Наверное, это один из тех шахтных ходов - кажется, я разглядел уходящие в темноту рельсы… Надо было все-таки захватить фонарик!"
me "Тебе придётся снова вести меня за руку. Я ни черта не вижу в такой темноте…"
if alt_uvao_D5_hentai:
    uv "Хорошо. Давай лапу!"
    
    "Удивительно, но вскоре я начал что-то различать во мраке. По крайней мере, спотыкался я все реже, а шёл все быстрее."
    "Очень скоро уже не Юля вела меня, а мы с ней шли бок-о-бок… Кажется, она улыбалась - этого я разглядеть не мог."
    # Меняем фоны шахт
    th "Дождемся, пока все уедут, а потом в какой-нибудь домик переселимся. С голоду не помрём - в реке рыба, в лесу грибы-ягоды… Рай в шалаше, ага…"
    "Перед мысленным взором пронеслась картина нашей совместной жизни в маленькой хижине в лесу, натуральным хозяйством."
    "Я - добываю пропитание, а моя скво готовит еду… бррр, лучше наоборот! А то она нам наготовит…"
    dreamgirl "Ты серьезно решил стать отшельником? Не хочу разбивать наивную детскую мечту, но с твоими навыками можно дожить разве что до осени. А потом?"
    th "А потом - можно куда-нибудь отсюда выбраться, только своим ходом. Хватит с меня волшебных автобусов!"
    th "Доберемся до цивилизации… а там уже посмотрим по обстоятельствам. Что-нибудь придумаем!"
    dreamgirl "То есть, ты серьезно решил слить всю жизнь коту под хвост? Уж прости за очевидный каламбур…"
    
    "Препираться не хотелось."
    th "Мне кажется, или впереди что-то светится?"
else:
    uv "Хорошо. Давай руку!"
    # Темнота, звук шагов и шахтный эмбиент
    "Провал остался позади, вместе с тусклым лунным светом, и мне опять пришлось полностью довериться своей спутнице."
    th "Темнота - хоть глаз выколи! Как это Юля тут хоть что-то видит?"
    th "Может, она не глазами пользуется, а ушами - как летучие мыши?"
    th "Или просто настолько хорошо здесь все знает, что может ходить в полной темноте? Вполне возможно…"
    th "Интересно, я тоже научусь бегать по этим ходам в полной темноте?"
    th "Главное при этом - не разучиться совсем глазами пользоваться, а то превращусь в крота какого-нибудь… Не, такой вариант мне не подходит!"
    th "Лучше уж тоже в кота. Будем такие вдвоем по лесу скакать, хвостатые и ушастые."
    dreamgirl "Искать будут. Тут тебе не там, тут целый подотчётный пионер пропал! Милицию пригонят, спасателей…"
    th "Или наоборот, сделают вид, что все в порядке. Был пионер, неизвестно откуда приехал - и уехал домой. По бумагам все чисто, а, как известно, без бумажки ты - букашка." 
    th "Вот и будем жить, как букашки… питаясь солнцем и нектаром."
    "Мысли путались и уводили куда-то совсем не туда. Да еще приходилось следить, чтобы не споткнуться обо что-нибудь."
    "Юля, конечно, предупреждала, когда надо было поворачивать, но с мелкими препятствиями, вроде камней или вздыбленных шпал, приходилось справляться самостоятельно. К тому моменту, как впереди забрезжил какой-то свет, я уже отбил все ноги."
    
# Фон с провалом из тоннелей в шахты
"Вчера этот провал казался мне непроглядной тьмой, сегодня же свет тусклых ламп в верхнем тоннеле казался ярче прожектора."
me "Полезли?"
uv "Да, наверх."
"Как обычно, Юля без лишних слов, в два прыжка взбежала по осыпающемуся склону."
"А я последовал за ней,"
if alt_uvao_D5_hentai:
    extend "каким-то шестым чувством выбирая надежную опору среди груды камней."
else: 
    extend "пыхтя и цепляясь за осыпающиеся камни."
# Туннель с провалом
"Бетонный тоннель с прошлого раза так и не изменился - кабели по стенам, пыльный бетонный пол… Идти здесь было намного проще, чем там, внизу."
me "Мы в бункер идем? Ну, в ту комнату за железной дверью?"
uv "Да. Там лучше. Там можно спать, и никто не найдёт."
th "Интересно, она имеет в виду именно спать, или все-таки… не совсем спать?"
"Вот и дверь."
uv "Открывай, а я буду нажимать."
me "Как прикажете, ваше хвостатое величество!"
"Юля фыркнула и надавила на кнопку, а я приготовился применять грубую силу."
th "Надо придумать какой-нибудь способ открывать её в одиночку. А то каждый раз - только вдвоем выходить и заходить, неудобно же! Хотя можно попросту не запирать…"
"Дверь со знакомым, но от этого не менее душераздирающим скрипом повернулась на ржавых петлях."
me "Добро пожаловать, дорогой друг Семён! Ну и ты, Юля заходи."
# show uv surprise
"Она удивленно уставилась на меня, а я продолжал развлекаться."
me "Между прочим, тут написано \"Вытирайте ноги\"."
"Юля смотрела на меня как на идиота. Ну и вправду, откуда бы ей знать классику советской мультипликации? Телевизора-то тут нет."
me "Это шутка была. Не обращай внимания, я дурачусь."
uv "Ааа, шутка... Я не все шутки понимаю. А эту я как будто знаю, но не понимаю…"
me "Да глупости все это. Не обращай внимания."
# show uv smile
uv "Ладно!"

"В бункере Юля немедленно залезла на кровать, потянулась и широко зевнула."
uv "Давай спать."
th "Значит, все-таки спать…"
uv "Ложись сюда."
th "Или нет?…"
"Пока я пытался понять, намек это или нет, Юля уложила поудобнее подушку, потянула меня за руку…"
uv "Идем. Будешь меня греть."
"… и, как только я занял выделенное мне место, улеглась рядом, под рукой - уткнувшись носом мне в бок, закинув ногу на меня и прижавшись всем телом."
"Странно, я думал, ей не бывает холодно… ну уж не летней ночью, по крайней мере. Хотя под землей довольно прохладно…"
"Я вздохнул и обнял ее покрепче. Моя собственная кошкодевочка… милая и беззащитная."
# Цг спящей Юли
if not alt_uvao_D5_hentai: #(Без хентая = Из изолятора или от бед-ветки озера)
    "От поцелуя в висок Юля муркнула и прижалась поплотнее, вызывая вполне объяснимые желания."
    "Рука уже поползла погладить её пушистый хвост и ээ… окрестности, как вдруг Юля сжалась в комок"
    # тревожную музыку сюда
    if alt_uvao_D6_prisoner: # от изолятора
        extend " и забормотала каким-то не своим голосом."
        uv "Виолетта, перестань. Я знаю, чем грозит…"
        uv "…риск - дело благородное. А представь, если удастся…"
        me "Юля?"
        uv "эй, ты здесь?{w} Эй…"
        uv "…я хочу больше узнать…{w} зачем?…"
        "Она металась и бормотала, не просыпаясь, даже когда я легонько её потряс."
        uv "…что ты такое…{w} что ты такое…{w} что… ты…"
        uv "Слов нет…{w} показать…" 
        uv "… мммм…{w} мммм!"
        me "Юля, проснись! Эй!"
        "Кажется, это не просто плохой сон, это что-то похуже. Ещё бы понимать, что…" 
        "Я не мог придумать ничего, кроме как покрепче обнять ее и покачивать, легонько дуя в макушку. Это сработало, хотя и не сразу - спустя минут десять она уже спокойно сопела мне в плечо."
        "Вскоре заснул и я."
    else: # с озера
        extend " и вдруг подскочила на месте, водя вокруг каким-то диким взглядом."
        show uv scared
        me "…Юля?"
        "Будто бы только заметив, она вперилась на меня. Глядя в эти расширенные значки, я почувствовал себя весьма неуютно."
        $ renpy.pause(2)
        uv "Семён? Ты здесь?"
        me "Ну… да. А где мне быть?"
        uv "А почему я была в доме наверху? {w}Там было страшно. А потом я здесь."
        me "Наверное, просто кошмар? Страшный сон приснился."
        show uv normal
        uv "Сон? Наверное."
        "Она уже успокоилась, и готовилась улечься обратно."
        me "Давай спать. Только без кошмаров, хорошо? Мне они не нравятся."
        "Я усмехнулся и почесал ее за ухом."
        me "Хорошо, давай без кошмаров. Спокойной ночи."
        "Она закрыла глаза и будто бы выключилась, моментально погрузившись в сон. Вздохнув, я последовал ее примеру."
        
else: #(Хентай = С пляжа)
    th "Наверное, устала сегодня - вон, уже спит, как сурок. Да и мне тоже не помешает отдохнуть, день сегодня был тот ещё…"
    "Я легко коснулся губами её виска, рядом с торчащими ушками. Юля мурлыкнула и зачмокала губами во сне."
    th "Такая милая… извини, молока у меня нет. Завтра влезем в столовую, там поищем чего-нибудь вкусного."
    "Лениво почесывая её за ушком, я постепенно погрузился в сон."
    # Прогреваем мимиметры
    
# Бэд-энд
jump alt_uvao_D7_bad
