# Концерт
init:
    $ tl_7dl = Character(name=u"Толик", color="#A1752F", what_color="E2C778", drop_shadow = [ (-1, -1), (1, -1), (-1, 1), (1, 1) ], drop_shadow_color = "#000")
# TODO: Перекинуть толика куда-нибудь
label alt_day6_uvao_concert:
    window hide
    $ alt_chapter(6, u"Юля. Концерт")
    scene bg ext_stage_normal_day
    show mt angry pioneer at center
    with dissolve
    play music music_list["eat_some_trouble"] fadein 4
    play ambience ambience_camp_center_day fadein 4
    window show
    "Уже на подходе к сцене я заметил вожатую, нетерпеливо расхаживающую взад-вперёд по дорожке. Она явно кого-то ждала. Меня, родимого, кого же ещё."
    mt "Семён, ну где ты ходишь ?! Концерт уже начинается."
    "Так и есть."
    me "А чего я-то сразу?"
    "Притворно заныл я."
    me "Мне на сцене не выступать."
    mt "А ведь ты мог бы. Будь ты сознательным пионером, как другие ребята. Посмотри вот хотя бы на Славяну. У неё номер сегодня."
    show mt normal pioneer at center with dspr
    "И она показала на Славю, как раз проходившую мимо."
    show sl smile pioneer far at fleft with dissolve
    "Я посмотрел, отчего же не посмотреть. Славя девочка что надо. Но за этой активисткой мне не угнаться. Нет ни желания, ни сил."
    "Заметив мой взгляд, Славя улыбнулась и помахала рукой."
    hide sl with dissolve
    "Ольга тоже проводила Славю взглядом и продолжила:"
    mt "Мероприятие коллективное, к посещению обязательное."
    mt "А ты, как элемент несознательный, у меня вообще на особом контроле. Поэтому сидеть будешь рядом."
    "Вот так так. Приехали! Весь концерт придётся сидеть рядом с вожатой и усиленно изображать удовольствие от терзания моего слуха, потугами местных сотрясателей воздуха изобразить что-то, отдалённо напоминающее пение."
    dreamgirl "Да ладно, тебе не впервой"
    "Вдруг вмешалась Шиза."
    dreamgirl "Помнишь, как тебя назначили судить конкурс талантов?"
    "Я содрогнулся. Такое не забудешь."
    "Не помню в преддверии чего это было, но скорее всего какой-то праздник. Руководство престижного лицея, в котором я учился, решило провести песенный конкурс талантов среди учащихся. Дабы, так сказать, выявить самых одарённых. С последующей отправкой победителя в область, по пути дальнейшего совершенствования."
    "Не знаю уж, какими соображениями они руководствовались при выборе кандидатов, но из всех десяти участников ни у кого не было ни слуха, ни голоса. Вы можете себе такое представить? Ни у кого!"
    "Возможно свою роль сыграло то, что эти так называемые \"певцы\", все сплошь как один, были детьми педагогов, а победителем – естественно – стала дочка директора лицея."
    "Не знаю, как я выдержал то прослушивание, но в тот момент я понял, что ад для людей с музыкальным слухом существует. Неужели сегодня мне предстоит повторение того кошмара?"
    mt "Ну пойдём, пойдём, Семён, чего застыл."
    "Нетерпеливо подтолкнула меня в сторону сцены Ольга Дмитриевна."
    "Пробравшись между пионерами, мы с вожатой сели в первом ряду, рядом со Славей. На самом освещённом месте, между прочим. Кто же это такой умный догадался на зрителей прожекторы направить? Сцену надо освещать, сцену! Зрителей-то зачем?"
    mt "Ну вот, здесь нам с тобой всё будет хорошо видно и слышно."
    show mt smile pioneer at center with dspr
    "Улыбнулась она."
    me "Ага, и нас тоже будет очень хорошо видно и очень хорошо слышно."
    "Пробурчал я про себя. Вот зачем мне такая публичность?"
    mt "Надеюсь ты не будешь предпринимать попыток побега."
    me "Да я и не собирался."
    "Пожал я плечами."
    "И правда, как уж тут теперь сбежишь, когда под самой рампой сидишь и весь лагерь на тебя пялится."
    mt "Смотри у меня."
    "Шутливо погрозила пальцем вожатая."
    mt "А теперь всё внимание на сцену."
    "Тем временем на сцене, Мику, закончив приветственное слово, начала своё выступление."
    "Из колонок полились первые аккорды бодрой музыки. Она звучала смутно знакомо и это было странно. Где я мог её слышать? Ведь в здешнем репертуаре кроме Юрия Антонова на пару с Леонтьевым ничего и не сыщешь."
    "Ого! А песня-то на японском. Нет, как раз в том, что японка поёт по японски, не было ничего удивительного. Меня удивило то, что вожатая дала добро на такое исполнение. Никто ведь ничего не поймёт."
    mt "Ничего страшного."
    "Улыбнувшись, ответила на мой невысказанный вопрос вожатая."
    mt "Пусть ребята приобщаются к культуре других стран. Красоту песни можно и без понимания смысла понять."
    "Ну что же, ей виднее конечно."
    sl "Семён, а это на японском песня?"
    show sl normal pioneer close at left 
    hide mt
    with dissolve
    "Тронула меня за плечо Славя."
    me "Да, на японском вроде. На английский не похоже."
    "Покивал головой я."
    sl "А о чём она?"
    th "Ну откуда же я знаю? У Мику надо спрашивать."
    "Собрав в кучу все свои скудные знания японского языка, я попытался объяснить."
    me "Это песня про девушку, которая мечтает о любви и романтике и говорит о своих чувствах языком рифмы, просто потому, что не умеет по другому. Она мечтает найти родственную ей душу в другом мире. Песня называется \"Расскажи мне про свой мир\", как-то так."
    show sl surprise pioneer close with dspr
    sl "Ты знаешь японский язык?"
    "С нескрываемым уважением посмотрела на меня Славя."
    me "Есть немного."
    hide sl with dissolve
    "Конечно я знаю японский язык. Как впрочем и английский. И ещё пару-тройку. Правда всё на прикладном уровне."
    "Я и мне подобные - мы дети современной культуры, живущие во всемирной паутине.  Мы нахватались знаний, полученных из разных источников. Мы знаем всё и мы не знаем ничего. Дилетанты широкого профиля."
    "Пионеры, будто заворожённые, слушали песню. Кажется права вожатая. Вот она, сила искусства!"
    "Шквал аплодисментов был наградой певице. Замечательная песня. Надо у Мику потом спросить, про что она на самом деле."
    "Уф, наконец-то приглушили эти дурацкие софиты. А то ведь так и ослепнуть недолго. Ряды погрузились в приятный полумрак."
    "Следующие несколько номеров мне запомнились слабо. Может быть из за того, что после песни Мику, любая самодеятельность воспринималась как нечто смутно-невнятное?"
    "Дуэт незнакомых девчонок, поющих мимо нот. Медведь похоже им по ушам изрядно потоптался. {w}Какая-то Саша Баканова с детскими стихами про сыр. {w}Шурик, играющий на губной гармошке песню крокодила Гены. Я и не знал, что он умеет. {w}Уже знакомый мне взъерошенный пацан с красными глазами, играющий на скрипке. Неожиданно хорошо."
    "Славя сидела преступно близко ко мне и с каждой минутой прижималась всё плотнее. Мне ведь это не показалось? И вожатой ведь не боится."
    "Опа, а где же вожатая?"
    "Обернувшись в другую сторону, я обнаружил, что Ольги и след простыл."
    dreamgirl "Ага. Вот так мы значит следим за пионерами. Ну что же, вожатым тоже надо отдыхать. А то Саныч наверное заждался уже."
    "Ну что же, раз вожатой нет… То у меня есть кое какие мысли по поводу дальнейшего времяпрепровождения. Тем более, что кое кто явно не против."
    dreamgirl "Бьёт копытом, землю роет молодой сперматозоид."
    th "А ты мне здесь не пошли. У меня, может быть, исключительно чистые намерения."
    dreamgirl "Ага, с исключительно грязными последствиями."
    "Но попытавшись обнять Славю, я получил решительный, хоть и мягкий отпор."
    show sl normal pioneer with dissolve
    sl "Сём, давай не здесь."
    "Мягко попросила девочка, убирая мою руку со своей спины."
    sl "Люди же кругом."
    hide sl with dissolve
    "Ох уж эта женская логика! Прижиматься до состояния диффузии значит можно у всех на виду. А руки распускать ни-ни. Ну ладно, подождём. Ещё не вечер."
    "На лагерь опустилась такая стремительная и густая темнота, которая возможна только в южных широтах.  Моё внимание привлекло какое-то шевеление в ближайших кустах."
    "Присмотревшись и заметив подозрительно знакомые уши, я похолодел. Юля! Заметят ведь! Хорошо, что Ольги рядом нет. С её проницательностью, она бы точно запалила контору."
    "Позабыв обо всём на свете, кошкодевочка почти полностью высунулась из кустов и, упиваясь зрелищем, казалось вся была там, на сцене."
    "Чем она там так увлечена? Я не поверил своим глазам, увидев на сцене того, кого меньше всего можно было заподозрить в любви к музыке и массовым мероприятиям, в частности. Ну разве что, исключая круглосуточный приём пищи."
    "Да-да, на сцене отжигал тот самый незнакомый мужик из столовой! Он играл на балалайке, закрыв глаза и полностью отдаваясь процессу. Красота музыки была такова, что я восторженно поинтересовался у соседки:"
    show sl smile pioneer with dissolve
    me "Славь, а что же это за музыкант такой замечательный?"
    sl "А, это Анатолий. Ты его в столовой наверняка видел."
    me "Видеть-то видел. Я не думал даже, что он разговаривать нормально умеет, не то, что так играть."
    sl "Я и сама, честно признаться, не ожидала от него такой мастерской игры. У него, похоже, много скрытых талантов."
    show sl smile2 pioneer with dspr
    "Славя улыбнулась, видимо тоже наслаждаясь струнными переборами."
    hide sl with dissolve
    "Толян закончил с переборами и перешёл к главной части. Зазвучали знакомые аккорды «Яблочка». Что он творил с инструментом, невозможно описать. Это была не просто игра. Это было сложнейшее виртуозное исполнение вкупе с танцем."
    "Толик подпрыгивал и ходил по сцене вприсядку, и всё это не прерывая игры. Он практически жонглировал балалайкой, а под конец забрался на стол и закончил своё выступление там. Вот это да! Удивил так удивил."
    play sound sfx_concert_applause
    "Не сдержавшись, я поднялся вместе со всеми, чтобы поаплодировать виртуозу."
    tl_7dl "А Ф И Ф О   Ф А  Ф Н И М А И Е." # Спасибо за внимание, но всё-равно не понятно. -R #Коверкание - это перебор, кмк - Ленофаг
    "Хорошо, что все отвлеклись на Толяна и Юлю никто не заметил. Но теперь, когда номер закончился, я потихоньку стал подавать ей знаки – мол, спрячься. Юля понятливо кивнула и снова скрылась в кустах. Не слишком, впрочем, глубоко."
    play sound sfx_wind_gust
    "Откуда-то внезапно налетел порыв ветра и слегка похолодало. Подняв глаза к небу, я увидел довольно густые тучи, грозящие сорвать нам всё мероприятие. Хоть бы дождя что ли не было. Я ведь только во вкус начал входить. Объявили небольшой перерыв."
    show mt normal pioneer with dissolve
    "Невероятным образом материализовавшаяся рядом Ольга Дмитриевна толкнула меня в бок локтём и протянула какой-то свёрток."
    mt "На, питайся. И девочку свою не забудь угостить. Я и на неё тоже брала."
    me "Ка… кую девочку?"
    th "Неужели Юлю заметила!?"
    mt "Да вот же, справа от тебя сидит!"
    "Рассмеялась вожатая, кивнув на Славю."
    "Я перевёл дух. Так и инфаркт схватить недолго."
    me "Да она не моя девочка…"
    mt "Вижу-вижу. Вон как прижимаешься."
    "Славя тут же поспешила отодвинуться."
    show sl angry pioneer at left
    show mt laugh pioneer at right 
    with dissolve
    sl "Ольга Дмитриевна!"
    "Видно было, что Славя сильно смущена."
    mt "Ладно- ладно, молчу."
    mt "Ну вы тут наслаждайтесь концертом и дальше, а мне по делам отойти надо."
    show sl normal pioneer close at left
    hide mt
    with dissolve
    "Всё ещё посмеиваясь, она удалилась."
    "Я развернул свёрток и с наслаждением втянул свежий запах сдобы. Свежие булки, класс!"
    "Тут же в соседних кустах раздалось шуршание и я, громче, чем было нужно, сказал Славе:"
    me "Славя, угощайся, пожалуйста!"
    show sl smile pioneer close at left with dissolve
    sl "Спасибо."
    "Улыбнулась девочка."
    hide sl with dissolve
    "Надо эти шанежки побыстрее употребить, чтобы у кое кого соблазна не было. Уминая одну за другой ароматные булки, я мог бы поклясться, что слышу урчание. Причём очень близко."
    "Похоже дождь всё-таки решил не портить нам концерт и благополучно прошёл мимо. Продолжаем."
    "На сцену вышел Электроник с гитарой. Ничего себе. Оказывается, оба кибернетика ещё и музыканты. А я думал они в своей электронике погрязли. А им ничто человеческое тоже не чуждо. Хотя собственно гитара-то электро, так что закон жанра не нарушен."
    "В ночной тишине полились мелодичные звуки и Электроник запел. Чуть хриплый, слегка неуверенный поначалу, но затем набирающий силу голос. А у него неплохой вокал. Сорвав свою порцию оваций, Электроник раскланялся и ушёл. Молодец, Эл!"
    show sl normal pioneer close at left with dissolve
    me "Слушай, Славь, я и не знал, что у нас здесь столько талантов!"
    "Не скрывая восторга, сказал я соседке."
    me "Я ожидал, в лучшем случае, хорошего исполнения от Мику. Ну может от Алисы ещё. А тут ты посмотри – прямо конкурс \"Песня года\" какая-то."
    show sl laugh pioneer close at left with dspr
    "Славя рассмеялась."
    sl "Как ты низко нас ценишь. А я тебе говорила, что ты ещё ничего не знаешь о лагере."
    sl "И тебе предстоит узнать ещё больше."
    "С намёком продолжила она."
    me "Ну в этом я не сомневаюсь."
    show sl smile2 pioneer close at left with dspr
    "В тон ей ответил я."
    me "Буду ждать с нетерпением."
    hide sl with dissolve
    "Ну раз у нас так всё хорошо складывается… Попробовать ещё раз?"
    "И я снова попытался обнять девочку. Хвала рандому, в этот раз она не стала убирать руку и только лукаво посмотрела мне в глаза. Я почувствовал, что краснею. Ну если по мордасам сразу не получил, значит всё в порядке."
    "Украдкой я посмотрел в сторону кустов – вроде всё тихо. Если присмотреться, то уши-то видны конечно. Но к счастью, никому в голову не придёт пялиться в кусты, а не на сцену."
    "На сцене гитарный дуэт Мику с Алисой. Ну за этих переживать вообще смысла нет. Ожидаемо - исполнение по высшему разряду. Вокал Мику отлично дополнялся струнными переборами двух гитар. А песня на этот раз звучала на английском."
    show sl normal pioneer close at left with dissolve
    sl "Сём, а это про что?" 
    "Всё-таки хорошо знать несколько языков. Ну или хотя бы больше, чем один. Слегка поглаживая девочку по спине, я стал объяснять."
    me "Песня называется «Рядом с тобой». Она естественно о чувствах. Чувствах девушки к молодому человеку. Эта девушка хочет всё своё время проводить рядом с ним. Что-то там об ангелах, птицах и звёздах."
    sl "Как романтично…"
    "Прошептала Славя."
    sl "И какая красивая песня."
    play sound sfx_concert_applause
    "Ожидаемо получив шквал аплодисментов, девочки удалились."
    "Славя мягко освободилась от моей руки, по прежнему обнимающей её за плечи."
    sl "Сём, мне надо на сцену, готовиться. Сейчас ещё один номер будет, а потом и мне выступать."
    "С сожалением я выпустил её руку."
    show sl smile pioneer at center with dissolve
    sl "Ты тут не скучай без меня. И похлопать не забудь."
    me "Я уверен, что ты затмишь всех сегодня."
    show sl laugh pioneer at center with dspr
    sl "Не сглазь, смотри."
    "Рассмеялась Славя."
    "Очаровательная улыбка у неё, всё-таки."
    hide sl with dissolve
    "Что это у нас сегодня одна заграница среди музыкантов. Неужели никто по нашей эстраде-то и не пройдётся? А, ну вот, кажется что-то русское народное намечается."
    "На сцену выбежали ребята из второго отряда народных костюмах и принялись долбить по сцене сапогами, видимо изображая таким образом танец. Ну что же, для любительского исполнения вполне, вполне. Не ансамбль Александрова конечно, но для лагеря сойдёт."
    "Ага, вот и наша звёздочка. Для своего выступления Славя надела какой-то совершенно сногсшибательный голубой сарафан с народным орнаментом и сидел он на ней, надо сказать просто м-м-м – пальчики оближешь."
    "Я думал, что после всех этих отличных выступлений, меня уже ничто не способно удивить, но когда Славя начала петь, понял, что ошибался. Её глубокий, невероятный по красоте и силе голос заполнил всё вокруг. Казалось, ей даже не нужен был микрофон; её услышали бы и так в любом уголке лагеря."
    show mt normal pioneer at right with dissolve
    mt "Какой голос, а?"
    "Вожатая снова здесь. И снова незаметно. Похоже у Ульянки уроки скрытности берёт."
    me "Ага."
    "Восторженно кивнул я."
    me "А где вы были, Ольга Дмитриевна?"
    show mt angry pioneer at right with dspr
    mt "А вот это уже не твоё дело."
    "Нахмурилась вожатая."
    me "Ладно, ладно, я просто так спросил."
    play sound sfx_concert_applause
    "И я поднялся, чтобы поаплодировать, без сомнения лучшему номеру сегодняшнего концерта. Ну и разумеется, его исполнительнице."
    show sl normal pioneer
    show mt normal pioneer at right behind sl
    with dissolve
    "Подбежала слегка запыхавшаяся Славя."
    sl "Ну как я выступила?"
    "Явно волнуясь, спросила она."
    me "Ты была просто неподражаема."
    "Совершенно искренне ответил я."
    me "Это самое прекрасное, из всего, что я слышал."
    show sl smile2 pioneer with dspr
    sl "Спасибо, Сём."
    "Зарделась девочка."
    show mt laugh pioneer at right with dspr
    mt "Эй, голубки."
    "В разговор вмешалась  вожатая, всё это время стоящая рядом и наблюдающая за происходящим."
    mt "Не забудьте, вам после концерта ещё аппаратуру на место определить надо."
    sl "Конечно, конечно, Ольга Дмитриевна. Не волнуйтесь, мы с Семёном всё сделаем. Правда, Сём?"
    "Я кивнул головой."
    mt "Ну вот и хорошо. Тогда я пойду заключительную часть проведу."
    hide mt with dissolve
    "И вот ряды лавочек опустели, стихла музыка и о том, что здесь только что в течение двух часов проходил концерт (надо сказать, довольно хороший), напоминала только пустая сцена и куча аппаратуры, которую нам предстояло транспортировать."
    "Часть в клуб, а часть на площадь, для вечерних танцулек. И пульт диджейский ещё надо не забыть."
    #Помощь, ужин
    return
