# Д6-левая ветка, расспросы Мику о Лене.
# План-набросок
#
# Устанавливает флаг разговора с Мику о Лене alt_uvao_D6_left_MI_talk
#
label alt_day6_uvao_left_ask_MI_about_UN: #Приходим сюда сразу из меню "Поговорить с Мику"
# сцену не выставляем
    "Решив, что расспросить хорошенько соседку Лены - не такая уж плохая идея, я не стал откладывать дело в долгий ящик."
    "Осторожно заглянув ещё раз в столовую, я убедился, что никого с ультрамариновыми волосами там не наблюдается."
    "Рассудив, что подготовка к предстоящему концерту вряд ли может обойтись без руководителя художественного кружка, я направился к сцене."
# После обеда ГГ вновь терзается _явными_ подозрениями насчёт Юли, но он не уверен до конца.
# Повторно размышляет, что Мику может что-то знать, раз соседка.
# Идёт к сцене - Мику наверняка должна быть там.

# Как и сказано в бабле, разговор происходит в атмосфере суматохи и судорожного бардака.
# На вопрос, не замечала ли за Леной что-то странное в последнюю неделю, Мику начинает тараторить всё подряд, но вдруг выдаёт, что да, стала совсем задумчивая, грустит-плачет, и т.п. Эмоциональные изменения, короче.
# Говорит, что в первую ночь, как ГГ приехал - Лена до утра сидела и рисовала что-то, и потом тоже. Рисунки категорически не показывает - прячет.
# Мику смущённо признаётся, что тайком посмотрела рисунки. Там много ГГ.
# Перестаёт тараторить и, подбирая слова, говорит, что рисунки странные. ГГ - это явно ГГ, но какой-то другой и старше. Особо упоминает один или два рисунка с видами города, но не в Союзе, наверное, а зарубежного. - Почему город зарубежный? Объясняет, что архитектура несовременная (там Питер, но Мику его не видела вживую, поэтому не называет, хотя, возможно, упоминает пару узнаваемых архитектурных ориентиров), но очень много машин, прямо-таки битком, на улицах висят "эти... я не знаю как по-русски... баннеры... ну - такие плакаты с рекламой поперёк улицы" и другая реклама. Возможно, ещё какие-то приметы 2013-2014-го годов. "У вас, в Союзе, не так как-то всё.". Одним словом, ГГ должен смекнуть, что Лена рисует то, чего не видела и видеть не могла, зато ГГ это вполне знакомо.
# Отвлекают окончательно.

# После разговора с Мику замечаем недалеко от сцены препирающихся ОД и Алису.

# Далее строго по баблу ГГ ищет Юлю
    $ alt_uvao_D6_left_MI_talk = True
    jump alt_day6_uvao_left_ask_UV_about_UN

