# Д6-подъём
#
# используется флаг выхода на тру-энд alt_uvao_true
#
label alt_day6_uvao_getting_up:
    $ routetag = "uv"
    $ alt_chapter(6, u"Юля. Утро")
    $ persistent.sprite_time = "sunset"
    $ sunset_time()
    scene bg int_house_of_mt_sunset
    play ambience ambience_int_cabin_day fadein 4
    window show
    if alt_uvao_true:
# Будит ОД
		"Проснулся я от бесцеремонной тряски. Чья-то рука крепко ухватила меня за плечо и, похоже, просто так отпускать не собиралась."
		"С некоторым трудом удалось открыть глаза. Рука, как можно было догадаться, принадлежала вожатой."
        show mt normal pioneer close at center with dissolve2
		th "Кажется, со мной это уже было… Спасибо хоть, сегодня без перегара обошлись."
		"Действительно, в отличие от вчерашнего утра, Ольга была бодра, свежа и вполне довольна жизнью."
		"Убедившись, что я более-менее проснулся, она прекратила наконец свою импровизированную утреннюю разминку и отпустила мою многострадальную руку."
        show mt smile pioneer at center with dissolve
		mt "Семён, хватит дрыхнуть!{w} Времени восемь часов, погода отличная!"
		mt "Тем более, у меня отличные новости для тебя!"
		me "Дайте угадаю - наступил мир во всём мире?"
		"Проворчал я, отчаянно зевая.{w} Кажется, перед самым пробуждением мне что-то снилось… Что-то важное, но что именно - вспомнить никак не получалось."
#		dreamgirl ""
#		"Голос Шизы тоже показался мне каким-то заспанным."
        show mt laugh pioneer with dspr
		mt "Ну не настолько грандиозно, к моему сожалению. Но от зарядки и утренней линейки я тебя освобождаю."
        show mt normal pioneer with dspr
		mt "Кстати, снова по болезни, как и вчера, так что не забудь заглянуть в медпункт к Виолетте."
		"Она нахмурилась было, но не удержалась и прыснула, махнув рукой."
        show mt laugh pioneer with dspr
		"Вспомнив сцену за вчерашним ужином, я лишь смущённо заёрзал в кровати."
        hide mt with dissolve
        play sound sfx_close_door_1
		"Продолжая посмеиваться, Ольга проворно убежала на улицу, а я вяло принялся выпутываться из хитроумного узла, в который за ночь превратилось моё одеяло.{w} Недосмотренный сон никак не шёл из головы."
		th "И всё-таки, чте же мне снилось такое?…"
		menu:
			"Одеваться!":
				# сны - ерунда!
				# встаём, идём умываться и к Виоле на долгий разговор с чаем (https://ru.wikipedia.org/wiki/%D0%AD%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D1%87%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA#/media/File:%D0%9D%D0%B5%D0%B0%D0%B2%D1%82%D0%BE%D0%BC%D0%B0%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D1%8D%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%BE%D1%87%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA.jpg)
				"Впрочем, и в самом деле пора было уже вставать. Выспался я сегодня вволю, так что хорошенького понемножку."
				"Быстро одевшись и прихватив полотенце, я отправился к умывальникам."
#				jump 
			"Попытаться вспомнить сон.":
				"Рассудив, что из-за пятиминутной задержки ничего не случится, я воспользовался проверенной методикой - закрыл глаза и постарался расслабиться, позволяя сну чуть-чуть коснуться меня."
				show blinking
				scene black with dissolve
				"Здесь главное было удерживать сознание на грани между явью и грёзой, не давая ни одной из них победить…"
				window hide
			    $ renpy.pause(5)
				"…Оглушительно чихнув, я резко сел в постели, пытаясь сообразить, что происходит."
				dreamgirl "А вот это ты напрасно сделал."
				"Голос Шизы звучал укоризненно. Я беспомощно потряс головой, которую словно бы наполнили ватой."
				th "Что именно я сделал напрасно? Чихнул?"
				dreamgirl "Проснулся ты напрасно, бестолочь! Подождал бы ещё немного - как раз было бы пора снова спать ложиться."
				"Я вглянул за часы и охнул, кубарем скатившись с кровати."
				th "Мама дорогая, вот это я вздремнул! Может и не спать, но обедать-то уже точно скоро пора будет!"
				"Наскоро одевшись, я решил что немного холодной воды на мою бестолковую голову сейчас не помешает и поскакал к умывальникам."
#				jump 
				# досыпаем…
				# встаём, идём умываться и бредём в поисках пожрать
				# разумеется, никаких снов не вспомнили, а если бы не Шаза - и не вспомнили бы, что вспоминали
				# //Пересечься со Славей во имя жратвы
				# //Перекус, общение, предложение пообедать вместе
				# идём к Виоле на короткий разговор
    elif alt_uvao_D5_sh_mines:
		# Спалились накануне вечером ОД, знаем об аномалии немного.
		pass
	else:
		# Самостоятельное расследование, о Юле никто не знает.
		pass
    
	
# Заготовки
	play music music_list["everyday_theme"] fadein 5

    stop ambience fadeout 3
    play sound sfx_open_dooor_campus_1
    window hide
    $ renpy.pause(2)
    scene bg ext_house_of_mt_sunset with dissolve
    play ambience ambience_camp_center_day fadein 6
    window show
# на улице
    window hide
    scene bg ext_square_sunset with dissolve
    window show
#
    stop music fadeout 5
