# Д6-левая ветка. Танцы после медпункта или карьера для тру- и фальш-гуд-ГГ
#
# Набросок
#
label alt_day6_uvao_left_dance:
    "Хотя от медпункта до площади было буквально рукой подать, дорога заняла у меня несколько минут - чем дальше я продвигался по полуосвещённой дорожке, тем неувереннее становились мои шаги."
# Меняем музыку. "lightness" уже было. Надо бы что-то раритетное эстрадное, необязательно, чтобы под это можно было танцевать :) 
    "\"Пастуха\" сменила какая-то другая мелодия, незнакомая мне, но хорошо известная местной публике, судя по одобрительным возгласам."
    "Я остановился в тени кустов, не решаясь выйти на открытое пространство."
    "В голове вертелось множество причин повернуть назад и, как назло, ни одной - сделать последний шаг вперёд."
    # "Там сейчас были люди, которые знали, зачем собрались вместе."
    "Я представил себе, как выхожу на площадь и... {w}Переминаюсь с ноги на ногу возле скамеек в компании таких же лузеров, с которыми не захотела танцевать ни одна девочка?"
    dreamgirl "А ты не слишком перегибаешь палку?"
    "Шепнул голос в голове."
    dreamgirl "Как-то ты очень уж плотно вжился в роль семнадцатилетнего недоросля."
    dreamgirl "Да здесь одни сопляки собрались, пацаньё, большинство из них даже не целовалось ни разу, а ты-то чего ты трясёшься? {w}Кое-какой опыт у тебя, хвала рандому, есть - и в танцах, и не только! {w=1.0}{b}Ты мужик вообще, или где?!{/b}"
    "Я глубоко вдохнул и, как в прорубь бросился, шагнул вперёд."
    #сцена - украшенная гирляндами вечерняя площадь
    "Ослеплённый брызнувшим прямо в глаза светом прожектора, я запнулся{w=1.0}... и немедленно был схвачен за руку!"
    show sl happy dress
    sl "Семён! Я тебя везде ищу, куда же ты пропал!"
    show sl normal dress
    sl "То есть... Я хочу сказать, все давно здесь собрались, а тебя всё нет и нет..."
    show sl shy dress close
    "Славя внезапно смутилась и опустила было взгляд, но быстро справилась с собой и сказала, глядя мне в глаза:"
    sl "Я подумала... может быть, ты бы согласился потанцевать со мной? Хотя бы немного?"
    me "Аэ-э-э."
    show sl sad dress close
    "Девочка вдруг прикусила нижнюю губу и я почуствовал, что ещё немного - и она заплачет."
    "Мысленно выписав себе оплеуху для бодрости, я судорожно закивал, одновременно пытаясь совладать с прилипшим к гортани языком."
    me "Ко...коне...конечно, да.{w=1.5} Ну конечно же, с радостью!"
    show sl smile dress close
# Меняем музыку на медленно-танцевальную. Романтик!
#Вероятно, дальше текст следует пустить италиком - заодно с переходом на настоящее время.
#Возможно, текст пустить на весь экран. Или есть какой-то подходящий ЦГ с нехентайной призывно-манящей Славей?
    "Левая рука уже сжимает горячую ладошку, правая сама тянется было к талии партнёрши, но я спохватываюсь, здесь же так не принято."
    "Первые несколько тактов мы неловко топчемся на месте, стараясь не наступать друг другу на ноги, и смущённо отводя глаза, но вот Славя снова ловит мой взгляд, и следующие шаги даются неожиданно легко."
    # "Я наконец могу как следует разглядеть наряд Слави."
# ЛБ: пристально отсмотреть сцену дискотеки в Д3. Мог ли ГГ там танцевать Славю? Насколько плотно могли общаться, насколько подробно успел рассмотреть сарафан. Можно ли воспользоваться ключами от 7ДЛ-куна, или безнадёга? Если повезёт, и можно быть уверенным в отсутствии повтора, то здесь приводим немного эротических наблюдений про сарафан, как сидит, нестеснённая (предположительно) бюстиком грудь. Кстати, где-нибудь толкнуть про золотистые(?) волосы.
#Ленофаг: Можно танцевать Славю в третий день, при этом схороняется вот такая переменная: alt_day3_dancing = 2
#Немного из того танца: 
#"На ней серо-голубое платьице, скорее, сарафанчик, до середины бедра с интересным орнаментом явно растительного происхождения."
#"Оно такое лёгкое с виду, что кажется прозрачным, и я поймал себя на мысли, что стараюсь посмотреть наскозь - а ну как что увижу?"
#me "Твоё платье - просто что-то!"
#"Признался я."
#me "Это хорошо, что ты в нём не каждый день ходишь."
#me "Иначе ни работать, ни отдыхать было бы невозможно. Только расслабишься - а тут ты, красивая."
...
#dreamgirl "Ага, а если представить, что под этим платьем ничего нет…"
#th "Гусары, молчать."
    "В голове крутятся какие-то обрывки фраз про \"прекрасный вечер\" и \"тебе так идёт это платье\", но язык всё ещё деревянный. Наверное, оно и к лучшему - чем лепетать банальности, лучше промолчать. {w=1.5}Глядишь, за умного сойду."
    "Девушка тоже молчит, поглядывая на меня из-под длинных пушистых ресниц - куда там всяким \"максфакторам\"."
    "Несколько раз она облизывает губы, словно собираясь что-то сказать, но слова так и остаются непроизнесёнными."
    "Немного удивлённый её непривычной робостью, молчу и я."
    "Звучат финальные аккорды, и я с сожалением делаю шаг назад, но Славя лишь чуть плотнее сжимает свои пальцы на моих... и я остаюсь."
    "Кажется, на площади полно народу, наверняка должны быть и знакомые лица, но всё вокруг словно бы не в фокусе, кроме фигурки напротив."
    "Девушка наконец что-то говорит, я отвечаю и, наверное, даже впопад, но ненужные слова забываются раньше, чем сорвались с наших губ."
    "Мне всё ещё немного неловко от того, что наши глаза снова и снова встречаются, но девушку это, похоже, не смущает. Через минуту мы уже кружимся в танце, не разрывая призрачную нить взгляда."
    "Поэтому когда Славя вдруг отпускает мою руку и, разом сокращая дистанцию между нами до нуля, полуобнимает меня за плечо, я нисколько не удивляюсь, лишь завершаю освободившейся рукой начатое несколько минут назад движение."
    "Наверное, сказывается длительное отсутствие практики - рука ложится чуть ниже, чем следовало бы."
    "Славя слегка вздрагивает, но пока я соображаю, как бы поделикатнее поднять руку до уровня талии, следует ещё одно быстрое пожатие пальцев, чуть лукавый взгляд небесно-голубых глаз, и моя рука остаётся на прежнем месте." # ЛБ: уточнить оттенок глаз.
    "С такого расстояния я чувствую тепло её дыхания у себя на горле и лёгкий запах дегтярного мыла, исходящий от волос и кожи."
    "Мягкие, упругие соприкосновения разгорячённых тел, поначалу будто бы случайные. Теперь я уже совершенно точно знаю, что кроме моей рубашки и её тонкого сарафана нас больше ничто не разделяет."
    "Ещё несколько танцев вместе - два, а может быть и все десять? Я не замечаю сменяющихся мелодий, мир вокруг застит горячая пелена, в голове восторженно-пусто. {w}Всё, что имеет сейчас значение - это искорки в глазах девушки напротив, её манящие губы на расстоянии вдоха от моих и близкий-близкий жар её тела."
    "Снова медленный танец. Мы лениво перебираем ногами, наплевав на окружающих и прижавшись друг к другу."
    "\"Я устала.\" - шепчет Славя. \"Давай отдохнём?\""
    "Я неохотно отпускаю её и покорно веду к свободной скамейке."
    "Там она замирает на секунду, остановив на мне пугающе пристальный взгляд."
    "Потом резко встряхивает косами, словно бы что-то окончательно решив для себя."
    sl "Пойдём со мной. Я хотела... поговорить с тобой."
    "Шепчет она."
    "От её взгляда сердце горячим толчком ударяется в кадык. Судорожно сглотнув, я киваю и следую за ней в сумрак ночного лагеря."
# Конец выделения италиком (если было), конец на весь экран или ЦГ (если было). Переходим на привычный стиль повествования в прошедшем времени.
    # сцена - несколько пятен разного размера и цвета (как от наложения сильного flare на источник света) на чёрном (тёмном) фоне. На крайняк - наложить Noir густой-прегустой на ночную дорожку у домиков.
    # приглушаем музыку до 50%
    "Крепко держа за руку, Славя решительно тянула меня куда-то в темноту - после яркого освещения на площади в глазах мельтешили какие-то разноцветные пятна и я едва понимал, куда мы бежим."
#
#
#############
# Вариант соскока №1, до скуки невинный
#############
    # сцена - ночная дорожка у домиков. Та, что с шишками. Можно парочку кустов-масок накинуть в переднем слое.
    "Кажется, мы оказались в итоге на дорожке между какими-то домиками, но прежде чем зрение успело окончательно адаптироваться, Славя остановилась так резко, что я едва не сбил её с ног."
    show sl surprise dress at left
    show ba smile uniform at right
    with dissolve2
    ba "Тааак! Пионеры! {w=1.5}И что же это вы здесь вдвоём делаете? Дискотека вооон там!"
    "В голосе физрука звучала неприкрытая издёвка, и я почувствовал, как сами собой сжимаются кулаки."
    "Не задумываясь ни о шансах, ни о последствиях, я шагнул было вперёд, как Славя вдруг ахнула в голос. {w}Обернувшись и увидев её лицо, я так и замер на месте."
    show sl scared dress at left
    sl "Как же я...{w=2.0} Ведь если ты в самом деле..."
    show sl cry dress
    show ba em1 uniform #с подозрительным прищуром
    "Она вдруг судорожно всхлипнула и прошептала:"
    "...то всегда сможешь..."
    show sl crying_shame dress # ЛБ: "истерика" by Ленофаг
    "Тут Славя прижала к лицу ладони и заревела."
    me "Славя!"
    "Я бросился было к ней, но она вырвалась и отчаянно замотала головой, зарыдав ещё громче."
    "Сквозь слёзы она пыталась ещё что-то сказать, но разобрать уже вовсе ничего было нельзя."
    "Совершенно сбитый с толку, я перевёл взгляд на физрука. Тот стоял, приоткрыв рот и выпучив глаза, и явно понимал в происходящем ничуть не больше моего."
    "Славя тем временем не только не собиралась успокаиваться, но начинала уже подвывать в голос. Это меня немного отрезвило. {w}Определённо, надо было что-то предпринимать."
    dreamgirl "Вообще-то, здесь неподалёку медпункт, а там, как мы уже знаем, есть всё для утешения страждущих духом."
    me "Борис Сан...э-э-э... Александрович. {w=0.8}Борис Александрович!" #ЛБ: уточнить, всегда ли ГГ знает, как зовут БА. Если с бегунком не заходил, техноквест не выполнял (и именуют ли БА в техноквесте БА, кстати?)...
    show ba normal uniform
    ba "А?"
    "Похоже, физрук успел забыть о моём присутствии и уставился на меня с недоумением."
    me "Борис Александрович, её бы в медпункт, может? Виоле показать, она сейчас там как раз. {w}Мне-то её не дотащить, наверное."
    "Физрук несколько секунд растерянно переводил взгляд с заливающейся слезами девочки на меня и обратно, потом кивнул."
    ba "Ага, да. Правильно."
    "Он вдруг погрозил мне внушительным кулаком."
    show ba em1 uniform
    ba "Смотри у меня, если что!"
    "После этого он сгрёб рыдающую Славю в охапку и, что-то успокоительно ей бурча, потащил прочь."
    hide ba
    hide sl
################
# Конец варианта соскока №1
################
#
#############
# Вариант соскока №2, с поцелуями
#############
#
    "Свернув с мощёной дорожки, Славя молча протащила меня сквозь какие-то заросли, и мы оказались на маленьком островке среди буйно разросшихся кустов."
    #ЛБ: Что-то надо придумывать с бэком.
    #ЛБ: Так или иначе, сейчас на сцене довольно темно, луна за облаками.
    "В полутьме угадывались очертания садовой скамейки с чугунными ножками. Одним словом, идеальное место для тех, кто хочет укрыться от чужих нескромных взглядов, не пренебрегая при этом комфортом."
    "Я замер в растерянности."
    th "Ну же, не тормозить! Что-то над сказать или сделать, девушка ждёт..."
    "Славя опередила меня, вновь взяв инициативу на себя, и подтолкнула в сторону скамейки."
    "Кажется, она вздохнула - или мне просто послышалось?"
    "Впрочем, эта мысль вылетела из головы, толком не оформившись - девушка уселась на скамейке рядом, тесно прижавшись ко мне."
    "Чувствуя, что во рту снова пересохло, я промямлил:"
    me "Так что..."
    "Нежные пальцы легли на мой затылок, зарываясь в волосы, разворачивая голову..."
    "...Тёплые мягкие губы накрыли мои."
    # blink
    th "..."
    "На несколько долгих мгновений меня накрыло горячечной волной желания."
    "Не отрываться. {w=1.5}Не отпускать. {w=1.5}Сильнее! {w=1.5}Ещё!"
    dreamgirl "А ты неплохо справляешься. Видно, это и в самом деле, как ездить на велосипеде - навык не утрачивается."
    dreamgirl "И девочка молодец, старается изо всех сил, хотя у неё-то опыта никакого."
    th "Что?.. Почему?"
    "Я по-прежнему плохо понимал где нахожусь. Сознание, разбуженное скучающим голосом моей шизы, слабо барахталось под слоем очень простых и ярких ощущений."
    "Голос в голове язвительно фыркнул."
    dreamgirl "Нельзя же быть таким эгоистом. Отвлекись хоть немного от своего животного начала и удели капельку внимания даме."
    # unblink
    # здесь и далее спрайтом идёт силуэт Слави
    sl "Сёмён?"
    "Кажется, Славя почувствовала, что я отвлёкся и, оторвавшись от моих губ, требовательно заглядывала мне в глаза."
    sl "Что-то не так?"
    "Прежде, чем я сумел придумать какой-то ответ, она отпустила меня{w}... чтобы через секунду оказаться верхом у меня на коленях, лицом к лицу."
    "Мгновение помедлив, привстала на коленях, высвободила подвернувшийся было под бёдра подол сарафана, обхватила меня руками за плечи и заёрзала, устраиваясь поудобнее."
    dreamgirl "М-м-м! Класс! {w}Вот оно, главное достоинство твоих коротких пионерских штанишек!"
    "Ощущения и впрямь были самыми что ни на есть восхитительными, а спустя несколько секунд они крайне удачно дополнились прикосновением упругой девичьей груди, пусть и отделённой от меня целыми двумя слоями ткани, но больше не стеснённой ничем."
    "Словно со стороны я наблюдал, как мои пальцы сами собой скользнули вверх от коленей по её ногам и, завершая круг, легли на идеальной формы ягодицы - пока что ещё поверх тонкой ткани сарафана... {w}Славя тихонько ахнула и, мгновенье помедлив, слегка подалась ко мне."
    "Однако червячок сомнения у меня в мозгу уже набирал силы."
    "Я наполовину машинально ответил на настойчивый поцелуй Слави."
    th "Как-то... как-то слишком быстро всё происходит."
    dreamgirl "О, так ты тоже это заметил? Поздравляю, теперь нас двое."
    sl "Семён, я тебе нравлюсь?"
    "Шепнула моя валькирия, чуть отстранившись."
    dreamgirl "Эй! Куда она торопится, с такими-то вопросами? Вот поживёте вместе пару лет, а уж потом..."
    me "Ну да... Да! Очень нравишься."
    "Хрипло каркнул я в ответ."
    "Слова прозвучали как-то неуверенно, но Славя, порывисто вздохнув, лишь придвинулась ещё ближе, заставляя меня буквально окаменеть. {w}Во всех смыслах."
    dreamgirl "Чувак, а ты в курсе, что тебе, по большому-то счёту, осталось только шорты расстегнуть, если пуговицы сами раньше не оторвутся, и с такой дистанции можно уже будет переходить прямо к делу?"
    "О да, я был в курсе. {w}И ещё теперь я был уверен, что ей от меня что-то надо. Что-то выходящее за рамки хоть поцелуев, хоть обмена жидкостями."
    "Организм продолжал бунтовать и требовал продолжения банкета, но просто так отмахнуться от нашёптывания паранойи было уже невозможно."
    dreamgirl "О, кажется, у тебя случился проблеск сознания? Ну тогда самое время включать понемногу верхний мозг и придумывать, как ты будешь выкручиваться."
    dreamgirl "Хотя, с другой стороны, стоит ли отказываться от того, что само идёт в руки?"
    "Отстранившись назад, насколько это позволяла сделать спинка скамейки, я освободился из сладкого плена губ девушки."
    "Вдохнул поглубже и, словно преодолевая перегрузку в пять \"же\", кое-как поднял руки на её талию."
    me "Славя, подожди... Подожди..."
    "Девушка замерла неподвижно."
    sl "Я... я что-то не так сделала?"
    "Сдавленным голосом произнесла она."
    me "Нет-нет, просто... Просто как-то внезапно всё получилось..."
    "Я чуть было не ляпнул что-то вроде \"и у меня давно ни с кем не было\", но вовремя прикусил язык."
    th "Спокойствие! Только спокойствие! Не хватало ещё спалиться или клоуном себя выставить."
    "Я вдруг понял, что девушка дрожит, и вряд ли от вожделения."
    "Она судорожно вздохнула и вновь потянулась ко мне."
    sl "Семён, пожалуйста!"
    "Зашептала Славя мне на ухо."
    sl "Ты не понимаешь."
    # по возможности, осветляем фон
    "Из-за туч вдруг выглянула луна - я только сейчас понял, что всё это время она скрывалась за облаками."
    # меняем силуэтный спрайт на нормальный ночной
    show sl fear dress close
    "Увидев вблизи её искажённое не то болью, не то страхом лицо, я невольно отпрянул."
    sl "Т-ты н-не понимаешь."
    "Повторила она, стуча зубами. Теперь её тело уже явственно била сильная дрожь."
    sl "Пожалуйста, Семён, пожалуйста!"
    "Славя вдруг стиснула меня руками с такой силой, что дыхание перехватило."
    "Запаниковав, я попытался вскочить, готовый спихнуть девушку на землю, если потребуется, но та упорно не желала разжимать объятья."
    with vpunch
    "В результате через секунду я рухнул обратно на скамейку, подминая Славю под себя."
    play sound sfx_bodyfall_1
    with vpunch
    sl "Семён, пожалуйста, пожалуйста! Ты не понимаешь!"
    with vpunch
    "Крикнула она."
    sl "Пожалуйста, Семён, я не могу, я боюсь!"
    $ meet('ba','Голос')
    show sl shocked dress close
    ba "Ты что делаешь, гадёныш!"
    with hpunch
    with flash_red
    "Рявкнули у меня над ухом, и неведомая сила, ухватив за шиворот, потащила меня куда-то вверх."
    hide sl
    with None
    show ba evil uniform with dspr
    "Меня резко крутануло в воздухе и я узрел прямо перед собой разъярённое лицо физрука."
    $ meet('ba','Саныч')
    ba "Ах ты сволочь!"
    "Свободной рукой он сгрёб меня за грудки. Даже в неверном свете луны было видно, как наливается кровью его лицо."
    "Полузадушенный, я слабо трепыхался, пытаясь освободиться, и тут вдруг за моей спиной Славя ахнула в голос."
    sl "Как же я не...{w=1.0} Ведь если ты в самом деле..."
    "Она вдруг судорожно всхлипнула и пролепетала:"
    sl "...то всегда сможешь..."
    "Саныч зарычал и встряхнул меня так, что на миг мне показалось, что голова оторвётся."
    sl "Нет... пожалуйста... {w=1.5}Отпустите его, это я..."
    show ba em1 uniform #тот, что с подозрительным прищуром
    "...выворачивая шею до отказа, я сумел обернуться и увидел стоящую рядом Славю..."
    show sl cry dress
    sl "Это я его сюда... {w=1.5}нарочно... это я его..."
    "Она вдруг широко распахнула глаза."
    sl "Или... {w=1.5}Если ты не... Если я ошиблась, и..."
    "Она снова всхлипнула."
    sl "Он не... не виноват... я нарочно... {w=1.5}я хотела..."
    sl "Не виноват..."
    with flash
    sl "{b}Я нарочно{/b}!!!" # ЛБ: надеюсь, болдом ясно, что кричит.
    show sl crying_shame dress # ЛБ: "истерика" by Ленофаг #Ленофаг: Залейте уже на гит её, лол
    "Тут Славя рухнула обратно на скамейку и заревела в голос, прижав руки к лицу."
    "Она пыталась ещё что-то говорить, но разобрать между всхлипами можно было только \"не виноват\" и \"стыдно\"."
    "Совершенно сбитый с толку, я перевёл взгляд на физрука. Тот стоял, приоткрыв рот и выпучив глаза, и явно понимал в происходящем ничуть не больше моего."
    "Славя тем временем не только не собиралась успокаиваться, но начинала уже подвывать в голос. Это меня немного отрезвило. {w}Определённо, надо было что-то предпринимать."
    if alt_uvao_D6_CS_vetrov:
        # идём на тру
        th "Так. В лагере есть медпункт, а в медпункте есть всё для утешения страждущих духом. {w}Да и Саныча хорошо бы отвлечь, пока не раздавил."
    else:
        # идём на фальш
        dreamgirl "Вообще-то, здесь неподалёку медпункт, а там, как мы уже знаем, есть всё для утешения страждущих духом. {w}Да и медведя этого хорошо бы спровадить подальше, пока не раздавил."
    me "Борис Сан...э-э-э... Александрович. {w=0.8}Борис Александрович!" #ЛБ: уточнить, всегда ли ГГ знает, как зовут БА. Если с бегунком не заходил, техноквест не выполнял (и именуют ли БА в техноквесте, кстати?)...#Ленофаг: Ба именуют во второй стадии техноквеста Вообще, раз на то пошло, имя физрука есть в бегунке, который дают на второй день. 
    show ba normal uniform
    ba "А?"
    "Похоже, физрук успел забыть о моём присутствии и уставился на меня с недоумением."
    me "Борис Александрович, её бы в медпункт, может? Виоле показать, она сейчас там как раз. {w}Мне-то её не дотащить, наверное."
    "Физрук несколько секунд растерянно переводил взгляд с заливающейся слезами девочки на меня и обратно, потом кивнул."
    ba "Ага, да. Правильно."
    "Он наконец разжал пальцы, и я чуть не шлёпнулся на землю, потеряв равновесие."
    me "Я правда не... Ну, в общем...".
    "Он вдруг сунул мне под нос внушительный кулак."
    show ba em1 uniform
    ba "С тобой потом разберёмся, и смотри у меня, если что!"
    "После этого он сгрёб рыдающую Славю в охапку и, что-то успокоительно ей бурча, потащил прочь."
    hide ba
    hide sl
    "Я наощупь нашёл скамейку и осторожно присел на краешек."
    "В голове творилось чёрт знает что. Мысли скакали, как цирковые блохи, и поверх всего этого заливался визгливым хохотом вновь поднявший голову внутренний циник: \"Ты знал, ты знал! Она всё врала! Она тебя использовала!\"." #ЛБ: в новом коммоне в Д1 у ГГ много-много подозрительных мыслей по поводу Слави - мол, желает корыстно попользоваться. Надо обыгрывать.
    #ЛБ: подсмотреть у Автора показ спрайта и текста по таймеру (кажется, в сыче с Улей что-то есть), либо так:
    show sl crying_shame dress #соорудить 50% прозрачность #Ленофаг - пример юзания прозрачности есть у Автора в конфиге, там компонуется  image un tr
    sl "...стыдно!.."
    hide sl
    "...пока я не стиснул зубы и не велел этому поганцу заткнуться."
    "Не знаю, что там затевала Славя, но для неё, похоже, было по-настоящему тяжело врать мне и притворяться." #ЛБ: возможно, стоит эту тему чуть развить. Надо Славю обелить, подчёркивая, что она хорошая, просто её нужда заставила.
    "Несколько минут я гадал, что же могло Славе от меня понадобиться настолько, чтобы устраивать всю эту кутерьму, а потом махнул рукой."
    "Откуда-то всплыло полузабытое \"то ли все бабы дуры, то ли... на этом мысль останавливается\"."
    dreamgirl "Знаешь, что тебе сейчас следует сделать?"
    th "Пойти в медпункт и убедиться, что с девочками всё в порядке?"
    "Обречённо поинтересовался я."
    "Ответом была мысленная проекция вращающегося у виска указательного пальца."
    dreamgirl "Похоже, из тебя Саныч остатки мозгов вытряс. В медпункте и без тебя разберутся."
    dreamgirl "Сейчас тебе следует аккуратно, больше ни во что не впутываясь, пойти домой и лечь спать!"
    "Идея, как ни крути, была хорошая. Правильная."
    # кустим спрайтами кустов
    "Я встал и побрёл через кусты наугад, стараясь не споткнуться о корни и не порвать одежду."
    # сцена - пристань ночью
    "Впрочем, на этот раз далеко идти не пришлось - буквально через пару шагов я оказался на берегу реки неподалёку от пристани."
    "Дискотека, похоже, уже закончилась, но в лагере всё ещё царило оживление. Пионеры шлялись туда-сюда, кто поодиночке, а кто и парами, там и сям слышались голоса и смех."
    # сцена - дорожка между домиков ночью
    "Похоже, по случаю последнего дня смены вожатые не слишком спешили наводить порядок и загонять подопечных спать. {w}Впрочем, у них, возможно, были какие-то свои заслуживающие внимания дела."
    "Верный принятому решению, я был очень осторожен и бдителен - настолько, что заметил спешащую навстречу Ульяну с ведром раньше, чем она меня, и успел спрятаться в тени."
    th "Кажется, кому-то сегодня вечером обеспечен холодный душ."
    "Меланхолично подумал я, выбираясь из своего укрытия."
    dreamgirl "Хочешь догнать и отобрать ведро?"
    th "Пожалуй, не хочу. Кажется, на сегодня я действительно исчерпал лимит по увиливанию от неприятностей."
    # Приходим домой. Спать немедленно!
