# Д6-левая ветка, поиски и расспросы Юли о Лене перед концертом
# План-набросок
#
# Используется флаг разговора с Мику о Лене alt_uvao_D6_left_MI_talk
#
label alt_day6_uvao_left_ask_UV_about_UN:
# ГГ ищет Юлю
# из бабла: //Старый корпус, стоянка, лес - кошочки нигде нету. После посещения всех трёх локаций находим на площади возле памятника, окликает сама. 
# (особо рассусоливать не стоит, кмк, пробежаться скоренько по локациям и как следует утомиться физически) ГГ находит её в кустах возле площади - окликает оттуда сама, когда ГГ стоит, обречённо стоит, озираясь.
#
# сцена - площадь днём
# Юля интересуется, что за движуха в лагере.
# ГГ объясняет про концерт, Юля желает смотреть и слушать, тащит ГГ за собой (или ГГ тащится за ней)
#
# сцена - сцена 75% в рамочке из кустов
    scene bg ext_stage_big_day:
        xalign .48 yalign .48 zoom 0.75
    show bush_frame at truecenter
    with fade 
    
# ГГ разговаривает с Юлей - та всё выкладывает про вечер первого дня ("- Объясните суду, зачем Вы убили своих родителей? - А чё они???").
# Рассказывает, что хотела подойти к Семёну вечером первого дня, но помешала Унылка.
# Chess: "- Эта та, у которой волосы странные? Сама виновата, нечего мешаться было!"
# Понимаем, что недовольство кошочки причиняет окружающим проблемы.
# ЛБ: кмк, если не знаем про рисунки, то Юля говорит туманнее, либо успевает сказать меньше до начала концерта.

    # начинается концерт
    jump alt_day6_uvao_left_concert_time