# Д6-левая ветка, карьер.
# План-набросок
#
label alt_day6_uvao_left_UN_sandpit:

# сцена - карьер.
# концовка предыдущего фрагмента:
    # "...и вдруг очутился на открытом пространстве, большую часть которого занимал солидных размеров песчаный карьер."
    # "Лес с этой стороны подходил почти вплотную к карьеру. Некоторые особо неудачливые деревья, накренившись, балансировали на самом краю, отчаянно хватаясь обнажёнными корнями, как растопыренными пальцами, за ненадёжный воздух. {w}Чувствовалось, что участь их предопределена - пройдут год или два, дожди ещё немного подмоют непрочную песчаную стену..."
    # "Лена была здесь, куда-то пробираясь по-над краем. Прячась за деревом, я наблюдал, как она подошла к группе особняком стоящих сосен и замерла перед ними неподвижно."

# Лена подходит ближе к деревьям, некоторых стволов касается рукой.
# Воровато оглядывается по сторонам, ГГ затаивается как может.
### возможно здесь фоном пустить memories_piano
# Лена что-то достаёт из кармана и что-то делает со стволом - вырезает?
# ГГ начинает подбираться поближе. Видит, что Лена действительно что-то вырезает на стволе - сердечко?
# ГГ успевает заметить аналогичные разнокалиберные метки на других стволах, и тут Лена оборачивается. Что-то поспешно прячет за спину - ножик?
# ГГ кхекает и мычит, что он здесь случайно Лену заметил и что как раз хотел поговорить.
# Лена, не сводя с ГГ глаз, пятится, подходя опасно близко к краю карьера.
# ГГ сообщает об опасности, но поздно - песок начинает осыпаться (слышим нарастающее шуршание), край обрыва под ногами Лены начинает съзжать, она падает, хватается за траву и ветки.
# ГГ бросается на помощь, падает на колени, хватает Лену за руку (её ноги уже повисли в пустоте, широко раскрытые глаза), после чего чувствует, что поехал ещё большой кусок с ними обоими. Не глядя тянется назад в отчаянной попытке схватиться, вцепляется чья-то рука, всё рушится вниз.
# Падение непонятно, долгое или нет, внезапно заканчивается. Все трое полузасыпаны песком, ГГ отплёвывается... ТРОЕ???
# С ними Юля, недовольно трясёт головой - песок набился в уши.
# Рядом Лена протирает глаза, вытаращивается на Юлю.
# Юля отплёвывается и порицает ГГ, что тот падал, пыталась спасти. Зачем падал?
# ГГ поясняет, что Лена, мол, падала... Юля недовольно фырчит на Лену - "от тебя одни проблемы"
# Лена тоже вызверивается на Юлю - "Я тебя знаю, ты... ты плохая!"
# ГГ успевает мысленно "Вот! Точно они пересеклись где-то!"
# Лена взвизгивает "Семён", резко хватает ГГ за руку, так что тот пошатывается.
# Юля пытается использовать _умение_ (возможно, ГГ нечто ощущает странное). Лена в итоге вопит что-то трогательное и закрывает собой ГГ.
# Юля кричит что-то невразумительное наподобие "Неправильная!".
# Юля дыбит волосы и бросается на Лену. ГГ отброшен хрупкой Леночкой в сторону, Юля промахивается мимо извернувшейся Лены.
# Юля с Леной медлят секунду в боевых стойках, ГГ как раз успевает вскочить и броситься между ними, слегка наклонившись (чтобы ему как раз по балде прилетело)... "Мир кувыркнулся."
# ГГ снова мордой в песок. "Кажется, меня опять приложили по голове. Правда, на этот раз не мячом."
# Его со слезами поднимают - едва ли не хором "Сенечка, ты живой?"
# Производим подсчёт потерь - ушиблена и кружится голова, разодрана кожа на плече от рукава и до локтя (кровушка проступает на глазах).
# Дамы зверски друг на друга косятся, но больше пока что не дерутся. Обе взъерошены, но без видимых травм. Слёзно просят прощения у ГГ, одновременно тянут его каждая к себе. ("прости меня, это всё она! я бы никогда!")
# Быстро начинают скатываться в агрессивную истерику, ГГ орёт "Тихо!"
# Вилка, где всех запутываем с выбором
    # - "Лена, остановись!"
        # "Юля мне зла не желает! И тебе тоже!"
        # "А ты, Юля, зачем бросаешься? что она тебе сделала?"
    # - "Юля, остановись!"
        # "Лена, ты достала уже! Что, совсем с катушек съехала?!"
        # Окончательно обижаем Лену, далее на катапульту

# Дамы смущены. ГГ судорожно прикидывает, что делать дальше. Ура, идея! - Лену отвести в лагерь и сдать медицине.
# Одновременно машинально ощупывает голову.
# dreamgirl "Ах, голова! Голова! Оторвали! Я умира...кха-кха!"
# Лена со слезами: "Сенечка, у тебя кровь! Тебе больно?" переживает за ГГ. "Тебе к врачу надо!"
# dreamgirl "Единственное, что может спасти смертельно раненного кота, — это глоток бензина."
# ГГ от неожиданности невнятно хрюкает, давясь смешком. Лена: "Сенечка, тебе плохо?!"
# ГГ радостно симулирует головокружение и прочее сотрясение мозга. "Я в порядке... Лена, давай... тихонечко дойдём до медпункта. Юля, ты не волнуйся, меня никто не обидит, и вообще, ты меня спасла, я только к доктору схожу, голову ушиб немножко. Давай завтра увидимся, ладно?"
# Юля смотрит на ГГ с сомнением ("неужели раскусила, что притворяюсь?"), но потом сообщает, что да, это плохо, когда голова болит, и сваливает понемногу.

# ГГ даёт Лене очистить ранку на руке носовым платочком. ГГ замечает, что у Лены тоже слегка поцарапана рука, но та отмахивается.
# ГГ позволяет вести себя в медпункт.
# Лена по дороге держится поначалу молодцом. Ведёт себя деловито, без намёка на эротику. Заботится без назойливости, не быстро ли идут, сильно ли голова кружится, не надо ли передохнуть.
# На подходах к обитаемой территории спохватывается, что у Сэма вся одежда в песке ("Интересно, сама-то и не испачкалась совсем. Как только сумела?") и принимается его отряхивать, на чём неожиданно срывается в слёзы, уткнувшись ГГ в плечо.
# ГГ что-то лопочет растерянное, неловко поглаживает Лену по спине.
# Лена быстро берёт себя в руки. "Из-звини. Я так испугалась, что ты... что с тобой... когда ты упал...". ГГ или Шиза отмечают, что "конечно, за ГГ она испугалась, а что сама с обрыва вверх тормашками летела - уже и неважно". Лена утирает слёзы, заканчивает чистить ГГ и идут дальше. ГГ намекает, что ему уже лучше, и неплохо бы идти обходными путями, чтобы публику не нервировать.
# По дороге ГГ несколько раз порывается было завести Выведывательный Разговор насчёт отношения к нему Лены и давно ли это с ней, но так и не решается.
# Понемногу вечереет.
# Лена уже не так деловита, молчит, сама по себе непрерывно смущается, краснеет, потупляет глазки и вздрагивает, но Сэма держит крепко, хотя временами уже и за него - у неё умеренный отходняк.
# Кустами выруливают к медпункту, входят.
# ВЦ на месте, смотрит поверх очков, отпускает виолизм по поводу "таким экзотическим вместе занимались".
# Лена мямлит было что-то, ГГ перехватывает инициативу, усаживает даму на кушетку и в пулемётном стиле "а-ля Мику" сообщает, что ничего страшного, просто упали втроём с Юлей и немного поцарапались. Очень может быть, что Лену именно Юля и поцарапала, как бы чего не вышло. И да, наверное, с Леной получилось примерно как с Шуриком вчера.
# ВЦ замирает озадаченно, Лена мямлит "что-что-что?", но тут ВЦ приходит в движение: "Так, только столбняка ещё нам не хватало! Быстренько, сыворотку!". Энергично звенит шприцами и ампулами. "Ну-ка, руку!"
# Вводит _внутривенно_ поочерёдно ГГ и Лене. ГГ удивляется - "было дело, кололи противостолбнячную - так её же подкожно полагается, вроде бы?", но помалкивает. ВЦ обрабатывает раны, одновременно бодро трандычит что-то про опасность столбняка в духе "Кавказской пленницы", не давая никому и рот открыть. ГГ сидит вместе с Леной на кушетке и слушает вполуха. ВЦ продолжает трандычить.
# Лена сидит смущённо, глаз не поднимает, теребит пальцами подол юбки. Через несколько минут расслабляется, потом обмякает и сонно приваливается к ГГ.
# ВЦ замолкает, с помощью ГГ укладывает заснувшую Лену на кушетку, проверяет пульс, укрывает.
# ВЦ: "Тебе я физраствор ввела. А теперь будь любезен, пионер, поподробнее."
# Здесь микровилки по флагам от утра Д7 на общую тему "Я рассказал о произошедшем на карьере и заодно поделился своими подозрениями насчёт Лены."
# Здесь микровилки по тем же флагам на тему "ВЦ задумчиво покивала головой." "Ну да, ну да, очень похоже, что... А не пойти ли тебе куда-нибудь отсюда? За Леной я присмотрю, молодец что привёл, а сам иди. На дискотеку иди, вот! Штаны почисти только, и иди."
# ГГ с нашлёпкой пластыря на руке (возможно, слегка раздосадованный, что прогнали, но всё-таки довольный, что сбагрил Лену с рук долой), идёт умываться, потом в домик - чиститься, потом как раз и дискотека начинается, где уже рыщет Славя.