# Д6 левая ветка, хозработы со Славей.
# План-набросок
#
#
#
label alt_day6_uvao_left_dutywork
    # сцена - бельевой склад.
    "Целью недолгой пробежки оказался бельевой склад."
# Славя объясняет, что надо отвезти грязное постельное бельё в прачечную. "Сушилка была сломана, только вчера починили, вот и накопилось, а завтра конец смены, это ещё бельё, всё постирать не успеют...". Короче говоря, несколько многословна.
# Заходят на склад, Славя показывает два объёмистых тюка. Берут (не больно-то и тяжёлые) и вытаскивают наружу, укладывают на тележку.
# "Ой, подожди...". Славя скрывается на складе и тут же возвращается со свёртком. "Вот, я и своё постирать хотела... Ой!"
# Свёрток немедленно раскрывается у неё в руках, ГГ рефлекторно бросается ловить и... в руках у него оказывается симпатичный лифчик. Остолбеневает.
# Славя, собирая с пола прочие деликатные предметы одежды и белья, усмехается: "Решил примерить? Кажется, это не твой фасон."
# Закончив подбирать с пола: "Ну что ты, как маленький. Бюстгальтера никогда не видел / никогда не видел, что девушки под одеждой носят?". Мягко отбирает.
# ГГ про себя замечает, что видел, и гораздо больше, чем Славя могла бы подумать, но оставляет эту информацию при себе.
# Вместо этого неловко отшучивается "Да нет, просто как-то неожиданно. Ты, когда в следующий раз решишь шоу устроить - предупреждай заранее, минут за пять."
# Славя реагирует неожиданно нервно, меняется в лице, но тут же берёт себя в руки и вновь улыбчива. "Ну что, пошли?"
# Вдвоём тащут по лагерю тележку ("лёгкая, здесь и в одиночку-то делать нечего!")
# Славя молча искоса поглядывает.
# Шиза подкалывает "Не думаю, что он у ней единственный был" - "Ты о чём?" - "О лифчике. Ты уже минут пять пялишься на её грудь."
# ГГ смущённо огрызается и поспешно отводит взгляд, Славя, будто подслушала мысленный диалог, едва слышно хихикает - может, и послышалось.
# Добираются до прачечной (ориентировочно - возле администрации, что делать с бэком - пока неясно). Славя просит подождать, без особого труда хватает оба тюка и скрывается с ними в прачечной.
# Не успевает Сэм пощёлкать клювом, как Славя приволакивает два других тюка, следом ещё два. "это постиранное, надо на склад отвезти."
# ГГ невольно задумывается о судьбе белья Слави, памятуя о своих испорченных джинсах. Если дежурил по столовой - заодно припоминает картофелечистку. Шиза подкалывает "Что же ты, надо было предложить услуги по ручной стирке."
# Обратно добираются тоже без труда, тележка большая и мешки с неё не падают. Рагружаются.
# Славя просит ещё помочь и постельное бельё разобрать по комплектам, но и эта работа - не бей лежачего, почти управились за пятнадцать минут. ГГ не выдерживает "Слушай, а зачем ты меня помочь-то просила? Я ведь толком и не делал ничего, ты в одиночку чуть ли не быстрее управилась бы."
# Славя усаживается на последний тюк с бельём. "Ты не думаешь, что мне не так уж весело быть всё время одной? Не хочется почувствовать себя девушкой, чтобы кто-то позаботился обо мне, помог... да просто побыл рядом? Кто-то хороший..." Развивает эту тему несколько подробнее.
# ГГ несколько смущён, хотя и тронут. Вероятно, что-то хорошее и растерянное думает про Славю.
# В последнем тюк оказываются стиранные личные вещи отыхающих - штаны-рубашки всякие. "Пусть лежат, потом разберу по отрядам, а дальше вожатые разберутся". Быстро заканчивают, выходят. Славя запирает склад. "Спасибо тебе большое". Слегка смущённо "Ты как, не против ещё немного помочь? Если я тебе не слишком надоела, конечно."
# У ГГ невольно вырывается "конечно же нет, не против!" - "Вот и славно!"
# далее идут готовить эстраду - скопипиздить из текста Сычёва - далее на обед.