# Д6 средяння левая ветка, разговор с Виолой.
# План-набросок-черновик
#
# Используется флаг alt_uvao_D4_viola_morning
#
label alt_day6_uvao_spoiled_CS_talk
#ЛБ: далее до отметки - правленный мной текст Сычёва. Ожидаются новые итерации.
    window hide
    scene bg ext_aidpost_sunset with dissolve
    play ambience ambience_camp_center_day fadein 4
    $ persistent.sprite_time = "day"
    $ day_time()
    window show
    "Страшилки вожатой по-прежнему казались мне не слишком убедительными, но прояснившаяся было после умывания голова снова беспокоила меня всё больше и больше, а звон в ушах всё усиливался."
    "Что ж, видно и вправду придётся навестить доктора Виолу. Столовая подождёт – голова важнее."
    # сцена - дорожка между домиками утром
    "Дорога до медпункта, по идее недолгая, заняла у меня раза в три больше времени, чем должна была. Я шел медленно, стараясь не растрясти больную голову и заодно пытаясь собрать мысли в кучу."
    "Вроде бы и неубедительные, слова Ольги всё время приходили мне на ум."
    th "Эй, ты здесь?"
    "Без особой надежды позвал я, решив провести консультацию со своим внутренним голосом."
    dreamgirl "Здесь конечно. Я всегда здесь. Чего изволите-с?"
    th "Можно хоть иногда без твоих шуточек обойтись?"
    dreamgirl "В принципе можно, конечно… Но нужен ли тебе будет такой скучный внутренний собеседник?"
    dreamgirl "Кажется, тебе собственного занудства должно быть достаточно!"
    "Голос захихикал, довольный собственной шуткой, но тут же резко оборвал сам себя."
    dreamgirl "Ладно, чего хотел-то?"
    th "Мне по Юле консультация нужна. Ты же, вроде как, за интуицию считаешься? Вот и выскажись."
    dreamgirl "Ну если судить по словам и поведению вожатой, которая, похоже, боится данного явления до… гхм… в общем, сильно боится, то опасаться стоит и тебе."
    dreamgirl "Вопрос в том, чего именно тебе следует опасаться? Думаю, тебе стоит сначала переговорить с нашей милейшей докторицей."
    th "Как-то на голос интуиции это мало похоже. Хотя и говорят, что одна голова хорошо, а две…? Одна у меня, а другая… тоже у меня. {w}И с головой этой явно надо уже что-то делать."
    # сцена - медпункт снаружи утром
    play sound sfx_knock_door7_polite
    "Вот и медпункт. Глубоко вздохнув, я постучался."
    cs "Заходи, пионер, заходи."
    th "Интересно, как она узнала, что это я? Ах, да! Она же ко всем так обращается."
    "Моя паранойя, помноженная на шизофрению, иногда позволяла делать парадоксальные выводы."
    window hide
    scene bg int_aidpost_day
    show cs normal glasses far
    with dissolve
    play music music_list["eternal_longing"] fadein 4
    play sound sfx_open_door_1
    play ambience ambience_int_cabin_day fadein 4
    window show
    "Виолетта Церновна сидела за столом и заполняла какие-то бланки."
    cs "А, Семён. Присядь пока."
    "И она приглашающим жестом показала на кушетку."
    show cs normal glasses with dissolve
    "Присев, я от нечего делать стал рассматривать кабинет. Раньше как-то возможности не было. Весы, шкаф с лекарствами, пара кушеток, ничего необычного. На стене плакат с бодрой надписью, призывающей разводить овощи. Зачем он здесь?"
    "Вспомнив, что Ольга говорила про Шурика, я покосился на дверь в изолятор, но та была закрыта."
    "Есть ли кто-то в изоляторе, нет ли - было совершенно непонятно."
    "Впрочем, прежде чем я успел заскучать, Виолетта закончила писать и повернулась ко мне."
    cs "Я тебя внимательно слушаю, Семён."
    me "Голова меня беспокоит."
    if alt_uvao_D4_viola_morning:
        cs "Ну с очень похожей жалобой ты уже приходил ко мне пару дней назад."
        cs "На что сегодня жалуемся?"
    else:
        cs "В каком смысле?"
    me "Шум, гул, звон в ушах…"
    "Виола кивнула."
    cs "Что ж, давай проведём осмотр."
    show cs smile glasses with dspr
    cs "Да не бойся ты!"
    "Рассмеялась она, заметив как я сжался."
    cs "Сегодня просто обычный осмотр."
    "Оказывается она может и нормально разговаривать."
    cs "Можешь даже рубашку не снимать… пионер."
    show cs normal glasses with dspr
    "Виола поочерёдно посветила мне фонариком в глаза, послушала пульс, смерила давление и задумалась."
    cs "Ну что я могу сказать. По первичным результатам обследования, все медицинские показатели у тебя в норме."
    cs "Хорошо бы ещё, конечно, томограмму головного мозга сделать."
    "Виолетта обвела помещение задумчивым взглядом, явно прикидывая, не завалялся ли где-нибудь под шкафом томограф."
    cs "...Но сегодня не получится, наверное."
    cs "Я думаю, ты просто переутомился. Возможно, перегрелся на солнце."
    cs "А пока – вот тебе таблетка болеутоляющего."
    "Она достала таблетку анальгина и налила стакан воды." #ЛБ: может, лучше цитрамона?
# Далее - текст ЛБ
    "Под её внимательным взглядом я запил таблетку и вернул стакан назад."
    me "Ну... Я пойду, наверное? Завтрак уже скоро."
    "Засобирался было я, но Виола удивлённо подняла брови."
    cs "Как же так, я-то надеялась, что ты не только за таблеткой зашёл, пионер."
    cs "Думала, поговорим по душам, содержательно."
    th "Так, начинается. Кажется, снова будут воспитывать."
    cs "Я, правда, надеялась, что ты это сделаешь немного раньше. "
    if alt_uvao_D4_viola_morning:
        extend "Скажем, на пару дней раньше, я бы сказала."
    cs "Впрочем, лучше поздно, чем никогда."
    cs "Нам совершенно точно есть о чём поговорить с тобой, уверяю тебя."
    cs "К сожалению, как ты справделиво заметил, скоро уже завтрак, а мне сегодня надо в столовую успеть пораньше, снять пробу."
    "Виола поморщилась."
    cs "Обычно это пустая формальность, между нами говоря, но вчера чуть ли не весь четвёртый отряд слёг с расстройством желудка - якобы наелись зелёных ягод."
    cs "Во всяком случае, такова официальная версия, хотя сейчас я уже точно знаю, чьи именно родители решили побаловать своё чадо скоропортящимся лакомством, идиоты..."
    dreamgirl "Какая трогательная история! Но тебе-то она зачем всё это рассказывает?"
    cs "...так или иначе, но сегодня целая толпа детей завтракает четвёртым столом, а на мне - снятие пробы с соблюдением всех положенных формальностей. {w}Не хочу, чтобы возможные проверяющие дёргали меня потом из-за этой ерунды."
    th "Может, ей поделиться не с кем, вот она и разоткровенничалась?"
    dreamgirl "А может, она к тебе в друзья набивается?"
    cs "Так что, проводишь меня до столовой, пионер?"
    "Не дожидаясь моего ответа, Виолетта направилась к выходу, на ходу одёргивая халат."
    "Мне ничего не оставалось, как последовать за ней. {w}Ещё чего доброго запрёт меня здесь - с неё станется."
#последовательно сменяют друг друга сцены утренних медпункта снаружи, площади, столовой издали.
    "Мы вышли на крыльцо. Медсестра аккуратно заперла дверь на ключ, опустила его в карман и повернулась ко мне."
    cs "Вот что, Семён..."
    "Начала она негромко."
    th "Ну что, меня ждёт очередная сексистская шуточка?"
    cs "...давай поговорим как взрослые люди."
    cs "Мы ведь с тобой {i}оба взрослые{/i} люди, правда?"
    "Ни тон, которым это было сказано, ни взгляд, которым меня одарила Виола, не оставляли сомнений - паспорт мой не сгинул вместе с курткой и таинственным автобусом, а попал {i}куда следует{/i}."
    "По спине отчего-то пробежал холодок, но Виолетта продолжала сверлить меня настойчивым взглядом разноцветных глаз, и я нехотя кивнул, признавая её правоту."
    cs "Ну вот и славно!"
    cs "Не то, чтобы я собиралась делать объявление по лагерю о некоторых фактах твоей {i}прошлой{/i} биографии, просто так мы сможем временно отказаться от своих ролей и поговорить на равных."
    "Дружелюбно улыбнулась в ответ Виола и неспеша двинулась по дорожке к площади, жестом приглашая меня идти рядом с ней."
    "Помедлив секунду, я догнал медсестру и пошёл по левую руку от неё. {w}В конце концов, начало разговора уже было интересным... а сбежать я всегда успею, если что."
    cs "Так вот, Семён, у меня к тебе есть весьма заманчивое предложение."
    "Продолжала Виола."
    cs "Нет-нет, не из тех, что принято подписывать кровью, не делай такое серьёзное лицо."
    cs "Уверяю тебя, про разноцветные глаза - это всё суеверия."
    "Усмехнулась она, искоса поглядывая на меня."
    cs "И да, прежде всего, просто чтобы не оставлять недосказанностей - это не твой родной мир. {w}Я знаю, что ты это знаешь, но хотела расставить все точки над i."
#    cs "Такого рода события здесь не то, чтобы явление совсем уж обыденное, но случаются... время от времени. {w}Подробности позже, если позволишь - это долгий разговор."
#    cs "Пока достаточно того, что ты оказался здесь."
    "Виолетта помолчала несколько секунд, но я твёрдо решил не открывать рта до победного - пусть уж первая раскрывает карты."
    cs "Так вот, возвращаясь к тому заманчивому предложению. От тебя не потребуется ничего невыполнимого."
    cs "Я всего-то и хочу, чтобы ты контролировал Юлю, если она вдруг появится, и обеспечивал таким образом безопасность лагеря до конца смены."
    me "А..."
    "Посмотрев на меня, и убедившись, что продолжения не будет, Виола утвердительно кивнула головой."
    cs "Да-да, безопасность не только отдельных личностей - возьми хоть Трофимова, у него провалы в памяти, как следствие контакта - но и всего лагеря."
    cs "Я понимаю, ты наверняка склонен недооценивать опасность для окружающих этого существа, Юли, но это по неведению."
    cs "Уверяю тебя, при других обстоятельствах я сама была бы двумя руками за продолжение наблюдений, но были, как я вчера уже упоминала, очень неприятные инциденты в прошлом. {w}{b}Чрезвычайно{/b} неприятные."
    cs "Одним словом, не надо ей пока что ни с кем больше контактировать, может плохо кончиться."
    "На мой взгляд, всё сказанное Виолой по-прежнему выглядело не слишком убедительным."
    th "В конце концов, что я достоверно знаю об этом месте? Нет, даже об этом мире? Только то, что он очень похож на привычный мне... И что {i}там{/i}, у меня, не встречаются девочки с ушами и хвостом - разве что на косплей-вечеринках."
    th "А вот кстати, насчёт ушей... Ладно, чёрт с ней, с моей конспирацией - всё равно у Виолы все карты на руках."
    me "Скажите, Виолетта, я правильно понимаю, что подобные, скажем так, существа, здесь, {i}в этом мире{/i}, явление вполне обыденное?"
    # show cs удивлённая
    cs "Да нет, я бы не сказала. Скорее уж наоборот - в отличие от переноса сюда людей из вашего мира, появление подобных существ - событие, мягко говоря аномальное."
    cs "Больше тебе скажу, до сих пор таких случаев будо зафиксировано всего три{w}... И все закончились в той или иной степени трагично - или для самого контактёра, или для окружающих."
    "Между нами повисло тяжёлое молчание."
    
# Нет, тебе Юля не опасна... Если будешь думать головой. Я... настоятельно рекомендую избегать с ней слишком близких контактов, хотя она и вызывает у тебя неожиданно сильную эмпатию, я ведь права?
# Ну и меня держишь в курсе происходящего.
# Одним словом, помогаешь мне спокойно закрыть смену. Кстати, это завтра, ты в курсе? На автобус и вперёд.
# Взамен - когда приедем в город, помощь с устройством после лагеря, а если захочешь, то помощь с обучением и перспектива интересной работы в будущем. Скучно не будет, обещаю.
# Разумеется, даже если ты откажешься от моего предложения, то голодным и холодным тебя не бросят, но... с моей опекой будет проще. Те же документы о _полном_ среднем образовании, например... Если понимаешь, о чём я... Ну и информации обо всём происходящем ты получишь намного больше, обещаю. Тебе же интересно, я угадала?
# Доходят до столовой. "Так что ты посиди, подумай."
# Сидим, думаем. Как в замедленной съёмке наблюдаем слоняющихся пионеров, обращаем внимание, какое всё яркое и хорошее вокруг. Шиза накручивает - "не слишком ли яркое, чтобы быть настоящим?", "Всё на свете из пластмассы/И вокруг пластмассовая жизнь."
#
#меню
# "Пусть даже так."
    th "Я не хочу назад. Даже если всё это ненастоящее - пусть! Если эту сказку расскажут мне до самого конца, и на этом - всё, финал... то я согласен."
    th "Если я не смогу различить, где сон, а где явь - не всё ли равно?"
    dreamgirl "Что же, это было честно сказано."
    dreamgirl "Я тебе тоже кое-что скажу."
    dreamgirl "Это не мир вокруг ненатурально яркий. Он совершенно обычный. Он был точно таким во времена твоего детства, вспомни, ну же, давай!"
    dreamgirl "Просто со временем ты разучился на него смотреть, ты попросту забыл, как это делать. А сейчас - вспомнил, только-то и всего."
    pass
# "Мне не нужны подделки."
    # пускаем эффект noir
    dreamgirl "А вот так реалистичнее выглядит?"
    th "Теперь да, как обычно... Подожди, я не понял, что случилось?"
    #немедленная катапульта. Добро пожаловать в милую нераскрашенную "реальность"
# Из столовой выходит ВЦ.
    cs "Ну как, что надумал... пионер?"
    me "По-моему, это называется покупать кота в мешке... но я не вижу ни одной причины, чтобы отказаться."
    cs "Что же, я нисколько не сомневалась... Почти."
    cs "Ладно, иди завтракай. Кстати, если вдруг доведётся разговориться с Трофимовым - порасспрашивай его... аккуратно. Может, вспомнит что-то интересно, ну ты понимаешь."
    th "Кажется, мне садятся на шею! Но снявши голову по волосам не плачут!"
# jump идём завтракать с Шуриком.
    

    
#ЛБ: дальше всё удалить. Никаких схождений с ума!
#ЛБ: ВЦ, раз уж Сэм соблаговолил зайти, чутка делится информацией. Поясняет без подробностей, что Юля опасна не столько для Семёна, сколько для окружающих. "Катастрофические последствия! Угроза безопасности всех этих детей!". Взывает к ответственности.
#ЛБ: Вообще, до завтрака времени всего ничего было, и его потратили на осмотр, так что дальнейший разговор стоит перенести на "по дороге к столовой"
    "Слова Виолы почти успокоили меня, но я не дал себе расслабиться."
    me "Виолетта Церновна."
    cs "Что-нибудь ещё?"
    me "Да. На самом деле, у меня есть подозрения, что моё ухудшившееся состояние связано с… с Юлей."
    "Виола снова вздрогнула, хоть и мгновенно взяла себя в руки. Как и в прошлый раз, когда я упомянул это имя."
    # ЛБ: "Виола снова вздрогнула" - кажется, Виола пока что не вздрагивала до этого...
    cs "Да, это очень вероятно."
    "Спокойно кивнула головой она."
    cs "А я всё ждала, когда ты сам придёшь с этим вопросом."
    cs "Ты ведь помнишь, что случилось с Трофимовым? Боюсь, что подобный кризис может повториться. И он будет повторяться всё чаще и чаще, пока психика данного субъекта не будет полностью разрушена."
    # ЛБ: Разве тема про Трофимова уже где-то обсуждалась ранее подробно?
    me "Что!?"
    "Я вскочил с кровати."
    me "Шурик полностью сойдёт с ума?"
    cs "Это один из вариантов развития событий."
    "Всё с тем же убийственным спокойствием ответила Виола."
    cs "Как только он будет попадать в зону воздействия этой… аномалии, его психика будет страдать."
    cs "И с каждым разом всё сильнее."
    me "Что же делать?"
    cs "Единственный известный мне способ, который позволит избежать воздействия, это полностью исключить контакт с аномалией."
    me "Значит надежда всё-таки есть."
    "С облегчением сказал я, снова усаживаясь."
    cs "Я пока не настроена столь оптимистично."
    cs "Подобное предупреждение и тебя касается тоже, Семён."
    "Тут она посмотрела прямо мне в глаза своим разноцветными глазищами."
    cs "Я не хочу тебя пугать… но твоя кошкодевочка опасна.{w} Очень опасна."
    cs "То, что у тебя воздействие проявляется в другой форме, нежели у Трофимова, возможно ещё хуже."
    cs "Ты, как более спокойный человек, в конечном итоге, окончишь свои дни полностью в вегетативном состоянии."
    play sound eat_horn fadein 2
    cs "Подумай о моих словах, а сейчас иди завтракать."
    hide cs
    "И в самом деле, по лагерю разносился сигнал горна."
    window hide
    stop sound fadeout 3
    scene bg ext_aidpost_sunset with dissolve
    play ambience ambience_camp_center_day fadein 4
    play sound sfx_open_door_1
    window show
    "Я вышел из медпункта полностью опустошённым. Одна новость хлеще другой."
    "Что же мне делать? Поверить Ольге? Поверить Виоле? Но не могли же они сговориться? Или могли? Да и зачем всё это? Разыграть такой спектакль ради меня одного. Вопросов как всегда больше, чем ответов…"
    "Меня обгоняли беззаботные пионеры, спеша занять лучшие места в столовой. Что же у меня за пионерлагерь такой получается? Все дети, как дети – отдыхают, веселятся. А у меня сплошные думы и непонятки."
    dreamgirl "А что ты, собственно удивляешься, дружок? Ты сам-то, что – обычный пионер? Или ты из соседнего города приехал на летний отдых? {w}Вот и я о том же."
    dreamgirl "Необычному пионеру – и отдых необычный."
    menu:
        "Поверить словам Виолы":
            th "Дыма без огня не бывает, как говорится. Наверное, мне действительно стоит прислушаться к её словам."
            "И я не спеша отправился к столовой."
            jump alt_day6_uvao_breakfast_with_sh
        "Да это же какой-то бред":
            #TODO Текст
            "Если я правильно понимаю, тут должна быть катапульта. Нейтрал."
