#Завтрак с Шуриком
label alt_day6_uvao_breakfast_with_sh:
    #TODO Music
    window hide
    scene bg int_dining_hall_people_day with dissolve
    play ambience ambience_dining_hall_full fadein 4
    window show
    "Как и ожидалось, в столовой  было битком. Ну ещё бы – с моей-то нерасторопностью. Ну хотя бы очередь на раздаче не такая большая, как обычно.  Взяв себе неизменные бутерброды и кофе, я обернулся, выбирая куда сесть."
    "Свободными оставались всего пара столов. Один возле окна, где всегда в одиночестве принимал пищу какой-то пожилой пионер (а может и не пионер) с не запоминающимся лицом. За другим свободным столом сидел Шурик, молча жуя бутерброд и рассеяно озираясь по сторонам. Почему-то тоже один. Интересно, где это он друга-кибернетика потерял?"
    "Когда его недремлющее око коснулось меня, Шурик подозрительно оживился и стал призывно махать рукой."
    show sh normal_smile pioneer far at right with dissolve
    sh "Эй, Семён! Иди сюда. Я тебе место занял."
    "Что?! Шурик занял место мне? Никогда не замечал за ним подобных приступов альтруизма. Что более вероятно, ему от меня что-то нужно. Но спорить я не стал и направился к свободному стулу."
    show un smile pioneer far at fleft behind sl
    show sl smile pioneer far at left
    show mi smile pioneer far at cleft behind sl
    with dissolve
    "За соседним столом завтракала Славя в компании Лены и Мику. Девочки что-то горячо обсуждали. Заметив меня, они смолкли и дружно кивнули – мол, с добрым утром, Сенечка. И вам, милые, и вам, подумал я кивая в ответ. Славя и Мику улыбнулись, Лена, как всегда засмущалась, но тоже смогла изобразить что-то, похожее на робкую улыбку."
    hide un
    hide mi
    hide sl
    with dissolve
    show sh normal_smile pioneer at cright with dissolve
    sh "Садись, Семён, садись. Я с тобой как раз поговорить хотел."
    "Всё ещё с таким же нездоровым оживлением продолжил  Шурик."
    "Так я и знал. Что ему от меня понадобилось-то? Но вслух сказал:"
    show sh normal_smile pioneer close with dissolve
    me "Доброе утро. Поговорить? О чем? И где это ты Электроника потерял?"
    sh "Что?… А, доброе, конечно. Электроник? Он сегодня как-то быстро поел и ушёл. Сказал, что у него дела какие-то в библиотеке. Наверное литературу по роботу хочет какую-нибудь техническую найти."
    "Я пожал плечами и принялся за свой бутерброд. Библиотека-библиотекой, а обед, то есть завтрак - по расписанию."
    sh "Скажи, Семён, а ты вчера ничего странного не замечал?"
    show sh smile pioneer close with dspr
    "Спросил Шурик и, как ему показалось, хитро прищурился."
    "Я, приподнял бровь, в свою очередь спросил у него:"
    me "Странного? В смысле?"
    show sh normal pioneer close with dspr
    sh "Да понимаешь, со мной что-то вчера произошло.  И никто мне ничего не рассказывает. А сам я ничего не помню."
    "Я внимательно посмотрел на него. Врёт, поди."
    dreamgirl "Врёт-врёт, можешь не сомневаться. По глазам вижу"
    "Глаза у Шурика слегка поблёскивали за стёклами очков, но в целом выглядели как обычно. Что там можно разглядеть, совершенно непонятно. Но Шизе виднее. А Шурик тем временем ждал моего ответа."
    th "Конечно я видел. Много странного. Больше, чем он мог бы предположить. Но я не был уверен, что Шурик тот человек, с которым стоит обсуждать подобные вещи."
    dreamgirl "Правильно. А то ещё кусаться начнёт"
    "Согласилась со мной Шиза."
    "Тем более, что он за мной следил. Интересно, почему."
    me "Да нет, извини, Шурик. Ничего я такого странного в лагере не видел."
    show sh upset pioneer close with dspr
    sh "Ну а если не в лагере?"
    "Не унимался Шурик."
    sh "Ты вчера ходил куда-нибудь за пределы лагеря?"
    th "Ходил, естественно, но это совершенно не твоего ума дело."
    "Подумал я, но сформировал мысль по другому."
    me "Нет. Никуда я не выходил. Ты ведь знаешь, что без сопровождения взрослых территорию лагеря покидать нельзя. А вот ты, как мне кажется, вчера куда-то отлучался."
    show sh serious pioneer close with dspr
    "Глаза Шурика как-то странно забегали. Он несколько раз глубоко вздохнул и видимо решился на откровенный разговор."
    sh "Я? Да понимаешь, нам с Электроником детали нужны для робота. Здесь в лагере мы всё переворошили. Все сломанные приборы проверили. Нет нужных и всё тут. Не разбирать же единственное работающее радио."
    "Я молча ждал продолжения. Пока что всё выглядело достаточно правдоподобно."
    sh "Ну вот. Во время уборки на чердаке клуба, я случайно нашёл карту старого корпуса лагеря, знаешь небось – он здесь недалеко расположен, в лесу."
    "Так. Уже становится интереснее."
    sh "Карту лагеря? И что в ней такого?"
    show sh serious pioneer close with dspr:
        zoom 1.1
    "Шурик наклонился ко мне поближе и зашептал."
    sh "То, что это не лагерь вовсе."
    show sh serious pioneer close with dspr
    "Я изобразил на лице сложное выражение изумления, смешанного с недоумением. Вроде получилось неплохо. Шурик, похоже удовлетворённый моими потугами, кивнул."
    me "Не лагерь? А что же?"
    sh "Точно не знаю, но, кажется, это место должно было служить каким-то укрытием на случай техногенной катастрофы. Это если судить по разветвлённой системе подземных тоннелей под корпусом и комнат-отсеков с гермодверями."
    me "Это ты всё понял по карте?"
    "Восхитился я. Почти искренне."
    show sh normal pioneer close with dspr
    sh "Не совсем."
    "Смущённо сказал Шурик."
    sh "Тоннели и комнаты безопасности я видел своими глазами."
    me "Ах вот как. Ну и нашёл ты там что-нибудь полезное?"
    sh "К сожалению нет. Не знаю, сколько я ходил по этим тоннелям, но потом со мной, похоже, что-то случилось. Я ничего не помню. А очнулся уже на поляне возле корпуса."
    "И Шурик пересказал уже известную мне сцену с киданием через бедро и пощёчинами."
    me "Так. Теперь мне всё понятно. А почему ты решил спросить у меня?"
    show sh serious pioneer close with dspr
    sh "Да говорю же – я у всех уже спрашивал, кроме тебя. И все молчат. Даже Электроник."
    "Я изобразил задумчивость. Шурик с надеждой смотрел на меня. Щас! Так я тебе всё и рассказал."
    th "Незачем усугублять ситуацию. Со мной самим ничего ещё не ясно."
    me "Нет, Шурик, извини ещё раз. Ничего необычного я вчера не видел. Спал вчера целый день как сурок в своём домике. Только к ужину вышел."
    "По лицу Шурика было видно, что он глубоко разочарован. Потом, видимо поняв, что здесь он больше ничего не добьётся, молча кивнул мне и ушёл."
    hide sh with dissolve
    th "Ну а что он интересно ожидал от меня услышать? Может ему ещё и фото Юли показать? Обойдётся."
    "Я принялся за второй бутерброд. За время этой увлекательной беседы, кофе совсем остыл."
    show sl smile pioneer close with dissolve
    "И тут ко мне за стол подсела Славя и широко улыбнулась – будто в столовой солнышко включили."
    "Её улыбка осветила все ближайшие столы, лица пионеров и поварих. Мне показалось, что даже безликий одинокий пионер слегка улыбнулся за своим столиком. Возможно только показалось – не могу сказать наверняка."
    sl "Привет, Семён!"
    "Весело сказала девочка."
    me "Привет."
    "Не особо жизнерадостно ответил я."
    show sl surprise pioneer close with dspr
    sl "Что с тобой, Сёма?"
    "Заботливо поинтересовалась Славя."
    th "Ого! Что это ещё за Сёма?"
    dreamgirl "Что-что? Нравишься ты девочке, не видишь что-ли?"
    th "Я? Нравлюсь?"
    dreamgirl "Ну а что? Парень ты видный. Пользуйся моментом."
    me "Да что-то голова разболелась. Спасибо, что поинтересовалась."
    show sl happy pioneer close with dspr
    sl "Да не за что, Сёма."
    "И снова эта улыбка… Славя, Славя… Эх, не было бы у меня Юли."
    dreamgirl "Гусар, ты девками-то не разбрасывайся. Никого у тебя пока нет. Забыл про предупреждение милого доктора?"
    "И в самом деле. Сделав над собой небольшое усилие, я улыбнулся девочке в ответ."
    me "Что ты хотела, Славя?"
    "Как можно дружелюбнее поинтересовался я у явно обрадованной такой переменой собеседницы."
    sl "Про танцы помним?"
    "Дождавшись моего утвердительного кивка, она продолжила."
    sl "Мероприятие коллективное, пропускать нельзя."
    "Да, по мне видимо очень заметно, что я не любитель подобных массовых сборищ с увеселительным уклоном."
    "Так, с этим разобрались. Но Славя явно хотела сказать мне не только это."
    show sl shy pioneer close with dspr
    sl "А ещё я хотела бы попросить тебя о помощи."
    me "Какого рода помощь требуется?"
    "Спросил я, примерно догадываясь."
    show sl laugh pioneer close with dspr
    sl "Помощь с организацией мероприятия, естественно."
    "Весело ответила активистка."
    me "Понятно. А почему именно я? И я, что, буду делать всё один?"
    sl "Ну… Во первых ты будешь не один. Электроник тоже поможет. А во вторых…"
    "Тут она наклонилась к моему уху, накрыла мою руку своей и прошептала:"
    show sl tender pioneer close with dspr:
        zoom 1.1
    me "Ты ведь такой сильный и не откажешься помочь девушке?"
    "Руку я не спешил убирать. Было приятно, не скрою."
    show un shy pioneer far at fleft with dissolve
    "За соседним столом, где Славя завтракала с девочками, осталась только Лена. Мику видимо уже закончила есть и ушла. Лена не слышала, о чём мы говорим, но когда она заметила руку Слави на моей, то вздрогнула и уткнулась в свою чашку."
    hide un with dissolve
    me "Ну…"
    sl "А взамен я буду танцевать с тобой{w} весь{w} вечер."
    "Промурлыкала Славя и, видимо решив дожать меня, продолжила:"
    sl "А после танцев мы можем вместе погулять."
    "Я усмехнулся."
    me "Ну кто я такой, чтобы отказываться от такого предложения?"
    show sl happy pioneer close with dspr
    sl "Вот и отлично! Значит договорились."
    "Обрадовалась Славя."
    sl "Тогда через десять минут на площади."
    hide sl with dissolve
    "Я допил кофе, отнёс поднос с посудой на кухню и пошёл к выходу."
    #TODO Текст
    "По сути прыгаем на хозработы, но прелюдии нет."

# Завтрак, слушаем Шурика со стороны.
#
# Используется флаг alt_uvao_D5_sh_mines
#
label alt_day6_uvao_breakfast_without_sh:
    window hide
    scene bg int_dining_hall_people_day with dissolve
    play ambience ambience_dining_hall_full fadein 4
    window show
    "Столовая была уже битком. Неудивительно. Свободными оставались всего пара столов. Один возле окна, где всегда в одиночестве принимал пищу какой-то пожилой пионер (а может и не пионер) с незапоминающимся лицом. А другой возле Электроника и Шурика." #Толик? Пожилой? Серьёзно?
    "Удача! Они-то мне и нужны. Может быть удастся что-нибудь узнать про вчерашние фортели этого гладиатора. Возможно Шурик доверяет Элу и будет с ним откровенен."
    "Взяв на раздаче традиционные утренние бутерброды и кофе, я отнёс поднос за выбранный стол и сел так, чтобы держать в поле зрения обоих кибернетиков."
    #TODO: Эмоции хакиров
    show sh normal pioneer far at fright
    show el normal pioneer far at cright
    with dissolve
    sh "…ты же знаешь, что у нас деталей для робота не хватает катастрофически. А я тут недавно разбирался на чердаке клубов и нашёл план-схему старого корпуса, который здесь недалеко."
    el "Да знаю я, что здесь недалеко находится старый заброшенный корпус. И что в нём может быть интересного?"
    sh "Да ты дальше слушай!"
    show sh serious pioneer far at fright with dspr
    "Было заметно, что Шурик сильно возбуждён. Главное, чтобы он опять с катушек не съехал."
    "Похоже, что Электроник подумал о том же самом, потому что с тревогой сказал:"
    el "Шурик, ты главное спокойнее."
    "Шурик глубоко вздохнул несколько раз и кажется взял себя в руки."
    sh "Так вот. Оказывается этот корпус совсем не то, чем кажется. Под его территорией располагается сложная система тоннелей и бункеров. Вероятно на случай какой-то техногенной катастрофы. Или, что более вероятно, для каких-то исследований."
    "По лицу Электроника было видно, что он считает рассказ своего друга не более, чем горячечным бредом, вызванным переутомлением, но вслух он ничего не сказал. Вот, что значит воспитание."
    "Видимо, решив пока принять на веру рассказ о тоннелях, бункерах и техногенных катастрофах, он мягким тоном обратился к Шурику."
    dreamgirl "Правильно. С сумасшедшими спорить низзя."
    el "Так, допустим. А зачем ты туда пошёл?"
    sh "Ну я же говорю – найти каких-нибудь радиодеталей. Для робота. Там ведь наверняка есть много всякой аппаратуры."
    "Логика в его словах несомненно была. Видимо поэтому Электроник проглотил и это."
    "Но всё же спросил. И как мне показалось, даже немного обиженно. Как же - вместе делают общее дело, а тут на тебе."
    el "А почему ты меня не позвал с собой?"
    sh "Хотел тебе сюрприз сделать."
    "Мгновенно отреагировал Шурик."
    sh "Ты придёшь в клуб, скажешь: \"Затянулся наш проект. Месяц уже стоит. Жаль, что у нас нет резисторов серии Е24\". А я тебе: \"Да вот же они\". И мы сможем наконец закончить нашего робота и заняться другим проектом." #…родим двоих деток, получим мильйон и будем жить долго и счастливо, ага.
    "Видно было, что к разговору он подготовился основательно. Но сможет ли он убедить вожатую в своей правоте и невиновности также легко, как Электроника ? Кроме того, оставался невыясненным и ещё один момент."
    "Кажется Электроник тоже вспомнил про этот самый момент, потому что понизив голос спросил:"
    el "Шурик. А чем было вызвано твоё внезапное нападение и неадекватное поведение?"
    "Шурик помрачнел."
    sh "А вот это самое интересное. Дело в том, что я ничего не помню. Я помню как спускался в тоннель. И всё, потом провал. А в следующий момент меня уже бьёт по лицу Ольга Дмитриевна."
    sh "Больно, кстати."
    "Он потёр щёку."
    "Электроник сидел какой-то притихший, переваривая полученную информацию. Но длилось это недолго - видимо инстинкт учёного преобладал."
    dreamgirl "Дух преобладал над плотью, ага"
    el "Возможно подобное неадекватное состояние и провалы в памяти - так называемая антероградная амнезия - вызваны травмой головы. Ты нигде не падал?"
    sh "Вроде нет."
    el "Какова же может быть причина в таком случае? Переутомление, возможно? Или что-то другое?"
    "Электроник задумался, перебирая варианты и что-то шепча про себя."
    sh "У меня есть теория. Даже две. И они даже могут быть связаны."
    sh "Первая. Не проветриваемые десятилетиями тоннели, соответственно недостаточный приток свежего воздуха что приводит к кислородному голоданию."
    sh "Вторая. Возможно в тоннелях произошла утечка какого-то газа, вызывающего временное изменение сознания."
    sh "К такому выводу меня привёл странный запах в катакомбах."
    el "Но это звучит как-то уж совсем фантастически."
    sh "И тем не менее, это может быть правдой."
    "В самом деле, вся эта история выглядела фантасмагорией, особенно последняя её часть. Было заметно, что Шурик всё это придумал от начала до конца. Но только не Электронику. Видимо он полностью доверял своему другу. Но вот оправдает ли этот друг такое доверие…?"
    "Курносый нос Электроника задрался, глаза горели. Видно было, что он уже мысленно строил теории относительно поведения Шурика в катакомбах и ему уже не терпелось вернуться в клуб и произвести какие-нибудь расчёты."
    "Поняв, что здесь я больше ничего не узнаю, я поднялся с места, отнёс поднос с посудой в мойку и пошёл к выходу из столовой."
    if alt_uvao_D5_sh_mines:
        #TODO: JUMP
        "Прыгаем на палевную ветку"
    else:
        #Всё шито-крыто.
        jump alt_day6_uvao_duty

label alt_day6_uvao_breakfast_with_viola:
    window hide
    scene bg int_dining_hall_people_day with dissolve
    play ambience ambience_dining_hall_full fadein 4
    window show
    #TODO Текст
    "Приходим, встречаем Виолу."