label alt_day5_uvao_ev_beach_event:
# Заглянули на пляж, чтоб искупаться
# Видим Славю в раздрае чувств
# Славя на вопросы не отвечает, но внезапно предлагает искупаться вместе

После такого напряженного дня мысль искупаться казалась весьма здравой.
Я неспеша дошел до вотчины Ольги Дмитриевны - хвала рандому, сейчас ее тут не было, и некому было устроить мне внеочередную выволочку за... да за что угодно!
Я нашел подходящий пятачок земли и уже начал развязывать осточертевший галстук, как вдруг заметил кого-то в дальнем углу пляжа, под деревом(по БГшке).
Она сидела, уткнувшись лицом в колени, косы безвольно стелились по земле. Такой Славю я еще не видел. Она что, плачет?
шз: "И ты, как рыцарь на белом коне, должен немедленно утешить печальную деву. Преисполненная благодарности, она падает тебе на широкую грудь и доверит все свои тайные секреты. 
Например, что такое таинственное она хранит на складе."
"А почему бы и нет? Не проходить же мимо. Я от нее ничего, кроме хорошего, не видел, может, смогу помочь чем-то?"
Чувствуя себя донельзя неловко, я направился к ней, старательно шурша ногами по песку - чтобы она не подумала, что я подкрадываюсь.
гг: "Эм… Славя?"
сл: "Семен. Что тебе?"
Она так и не подняла голову, голос ее звучал глухо и неприветливо.
гг: "Да в общем-то ничего… Я просто искупаться собирался, и тебя заметил…"
сл: "Одному нельзя. Не положено. Надо, чтоб кто-то из вожатых присматривал."
гг: "Вот как… Жаль…"
Я сел рядом. Не зная чем занять руки, я сорвал какую-то травинку и стал обрывать с нее семена. Славя так и сидела спиной ко мне, не шевелясь.
шз: "Кажется, с утешением и падением на грудь возникли проблемы. Может быть, она сценарий не читала?"
гг: "Славя… У тебя все в порядке?"
сл: "Нет. Но это неважно."
Что-то мне подсказывает, что я тут нежеланный гость.
#Как вариант - запилить условие \ выбор.
    гг: "Ты извини, что я навязываюсь… но… может, я смогу помочь?"
    сл: "Вряд ли…"
    Да, так и есть. Наверное, сейчас стоит встать и уйти… Да, вот сейчас… Сейчас встану, извинюсь и пойду… 
    сл: "…хотя…"
    гг: "Да?"
    Она подняла голову, провела ладонями по лицу, стирая слезы… 
    "Действительно плакала!"
    … потом повернулась ко мне, нацепив свое обычное оптимистичное выражение лица.
    сл: "Не хочешь искупаться?"
    шз: "Ого, это внезапно даже для такого альфа-самца, как ты! Романтичное купание вдвоем под луной…"
    Я ошарашенно смотрел на Славю. Она серьезно?
    сл: "Ну так что, ты пойдешь?"
    шз: "Очнись, тебя девушка спрашивает!"
    # если хентай - сюда можно добавить мысли про верность кошочке и ответ шизы - "Юля-то? Да она понятия не имеет ,что такое ревность!"
    гг: "Э… да, конечно."
    Славя быстро скинула с себя пионерскую форму, оставшись в одном купальнике, который, только подчёркивал её великолепную фигуру. Она с улыбкой наблюдала, как мои непослушные пальцы борются с пуговицами рубашки…
    шз: "А плавки ты надевать не собираешься, я так понимаю? И правильно, быстрее к делу перейдем!"
    "Блин, точно."
    гг: "Подожди, я сейчас переоденусь."
    Она фыркнула и улыбнулась.
    сл: "Какой ты стеснительный, Семен!"
    Я добежал до кабинки, молниеносно переоделся внутри и выскочил обратно…
    # ЦГ Слави, входящей в воду d2_sl_swim. На заднем фоне деревья - ну и хрен с ними, это будет заводь
    …И замер как вкопанный. Славя, словно танцуя, входила в воду, ступая прямо по лунной дорожке. Луна чуть подсвечивала плавные изгибы ее тела, будоража воображение.
    Сделав несколько шагов, она оттолкнулась и почти без брызг вошла в воду, а я внезапно вспомнил, что человеку надо иногда дышать.
    шз: "Телефон, телефон твой где, олух? Надо было снимать скорее!"
    "Да утихни ты, озабоченный"
    шз: "Ага, это я сейчас чуть слюнями весь пляж не залил. Ну так не заставляй девочку ждать!"
    Вынырнув, она призывно помахала мне рукой. Собравшись с духом, я разбежался и нырнул, подняв приличную волну.
    # ЦГ из-под воды
    Темная, прохладная вода успокоила лихорадочные мысли, я наслаждался неторопливым движением сквозь темноту. Только когда запас воздуха подошел к концу, я вынырнул и завис на поверхности, раскинув руки и ноги в сторону, словно звезда, и бездумно уставившись в звездное небо.
    # фон реки, или звезд?
    Что-то плеснуло рядом. 
    сл: "Хорошая ночь. Звезды такие красивые…"
    гг: "Ага."
    Я скосил глаза в сторону - Славя точно так же лежала на воде, и лунный свет отражался на её груди. Заметив мой взгляд она слегка покраснела, но отворачиваться не стала.
    сл: Красиво здесь
    гг: ага...
    Я услышал всплеск со стороны Слави, решил повернуть голову, как вдруг... в глаза хлынула вода.
    Славя звонка рассмеялась
    гг: Война, значит?
    Не дожидаясь ответа, я зачерпнул воды и со всей силы кинул(если можно так назвать) в Славю
    сл: Ай... прямо в глаза
    Поняв, что с силой всё-таки перебрал, я подплыл к ней, чтобы утешить, но это лишь был обманный манёвр, на который я успешно повёлся. Однако ответить я не успел, так как она сразу подплыла ко мне и обняла. Я был немного удивлён такой Славе. Хотя, немного - слабо сказано.
    Она посмотрела мне в глаза, словно ожидая чего-то, но ничего ответить я не мог, только смотрел и тонул в этих голубых глазах.
    Так ничего не сказав друг-другу она поплыла к берегу.
    шз: Господи, ну ты и тормоз. Придумал бы хоть что-нибудь, чем просто пялиться как дебил, который будто девочку на расстоянии ближе одного метра не видел.
    Ответить мне ему было нечего и я неспеша поплыл на берег.
шз: "А вот если подумать… ЗАЧЕМ она это устроила?"
"Может быть, потому что я ей нравлюсь?"
шз: "Да неужели? И что ей мешало намекнуть об этом пару дней назад?"
Я не нашелся с ответом, и вместо этого снова ушел под воду.
Когда я вынырнул, Славя уже была на берегу, вытиралась и одевалась. Я снова засмотрелся, а она, специально для меня, стала делать все неторопливо, поворачиваясь то так, то эдак, пытаясь показать свою красоту своих форм…
сл: "Ты выходишь?"
крикнула она мне, покончив с одеждой. Я отрицательно помотал головой - ее представление вызвало вполне понятную мужскую реакцию, и мне не хотелось представать перед ней в таком виде.
шз: "А может быть, ей этого и надо? Смотри, теряешь шанс замутить с та-а-акой девочкой! Хотя повторюсь, что-то тут нечисто…"
сл: "Ну тогда я пойду, и ты тоже выходи. И, Семен…"
Она замялась.
сл: "…спасибо тебе!"
"Интересно, за что?"
Она убежала по тропинке, а я вылез, слегка обсох и переоделся. Пора было отправляться на боковую…


label alt_day5_uvao_dv_un_event:
# Натыкаемся на беседующих Алису и Лену
# Слышим обрывки фраз, потом они замечают Семена
# Семен с дурацкой лыбой выходит и "А что это вы здесь делаете?"
# Лена убегает в смущении, Алиса злится и прогоняет