# Д6-посещение пляжа после допроса Шурика на тру-ветке
#
# используется флаг встречи со Славей на пляже alt_uvao_D5_evening_sl
# устанавливает флаг завтрака со Славей в Д6 alt_uvao_D6_morning_sl
#
label alt_day6_true_sl_morning:
# //Пересечься со Славей во имя жратвы
# //Перекус, общение, предложение пообедать вместе
# Chess:  Славя кормит в пустой столовой, осторожно пытается Семёна разговорить, усиленно демонстрирует свой интерес к нему.
    # Умывание ледяной водой несколько проясняет мысли, начинаем соображать, что делать дальше.
    # С одной стороны, Виола ждёт, с другой - очень уж жрать охота.
    # Еду всё равно взять негде, влечёмся в строну медпункта. Проходя мимо площади, замечаем Славю.
    # Голос желудка побеждает чувство долга (если был пляж - думаем, что заодно можно будет попытаться что-то понять, хотя нам и ссыкотно немного. (Шиза:"Вдруг она психическая?"))
    # Славя прямо-таки радостно вызывается покормить и тащит в столовую. Даём сравнение с вечером Д1 - как-то она подозрительно себя ведёт. Или просто кажется?
    # Прибываем в столовую. Славя притаскивает хлеб с маслом, кусок варёной говядины ("Это мясо предназначалось для супа. Вот, немного... хм... осталось") и напрочь остывший перестоявшийся чай.
    # Жрём всё подряд.
    if alt_uvao_D5_evening_sl
        # Сквозь еду пытаемся завести разговор про вчерашний пляж.
    else
        # Славя заговаривает сама, частично повторяя инфу из вчерашнего пляжа.
        # Недоумеваем и пытаемся узнать, к чему этот разговор.
    # Славя мнётся и уходит от разговора - "Долгий разговор... Давай лучше пообедаем вместе, а там видно будет".
    # Благодарим Славю. Разбегаемся.
    $ alt_uvao_D6_morning_sl = True
    jump alt_day6_true_CS_talk_short
