#Завтрак с Шуриком
label alt_day6_uvao_breakfast_with_sh:
    #TODO Music
    window hide
    scene bg int_dining_hall_people_day with dissolve
    play music music_list["so_good_to_be_careless"] fadein 4
    play ambience ambience_dining_hall_full fadein 4
    window show
    "Как и ожидалось, в столовой было битком. Ну ещё бы – с моей-то нерасторопностью. Ну хотя бы очередь на раздаче не такая большая, как обычно. Взяв себе неизменные бутерброды и кофе, я обернулся, выбирая куда сесть."
    "Свободными оставались всего пара столов. Один возле окна, где всегда в одиночестве принимал пищу какой-то пожилой пионер (а может и не пионер) с не запоминающимся лицом. За другим свободным столом сидел Шурик, молча жуя бутерброд и рассеяно озираясь по сторонам. Почему-то тоже один. Интересно, где это он друга-кибернетика потерял?"
    "Когда его недремлющее око коснулось меня, Шурик подозрительно оживился и стал призывно махать рукой."
    show sh normal_smile pioneer far at right with dissolve
    sh "Эй, Семён! Иди сюда. Я тебе место занял."
    "Что?! Шурик занял место мне? Никогда не замечал за ним подобных приступов альтруизма. Что более вероятно, ему от меня что-то нужно. Но спорить я не стал и направился к свободному стулу."
    show un smile pioneer far behind sl:
        xalign 0
    show sl smile pioneer far:
        xalign 0.2
    show mi smile pioneer far behind sl:
        xalign 0.4
    with dissolve
    "За соседним столом завтракала Славя в компании Лены и Мику. Девочки что-то горячо обсуждали. Заметив меня, они смолкли и дружно кивнули – мол, с добрым утром, Сенечка. И вам, милые, и вам, подумал я кивая в ответ. Славя и Мику улыбнулись, Лена, как всегда засмущалась, но тоже смогла изобразить что-то, похожее на робкую улыбку."
    hide un
    hide mi
    hide sl
    with dissolve
    show sh normal_smile pioneer at cright with dissolve
    sh "Садись, Семён, садись. Я с тобой как раз поговорить хотел."
    "Всё ещё с таким же нездоровым оживлением продолжил  Шурик."
    "Так я и знал. Что ему от меня понадобилось-то? Но вслух сказал:"
    show sh normal_smile pioneer close with dissolve
    me "Доброе утро. Поговорить? О чём? И где это ты Электроника потерял?"
    sh "Что?… А, доброе, конечно. Электроник? Он сегодня как-то быстро поел и ушёл. Сказал, что у него дела какие-то в библиотеке. Наверное, литературу по роботу хочет какую-нибудь техническую найти."
    "Я пожал плечами и принялся за свой бутерброд. Библиотека-библиотекой, а обед, то есть завтрак - по расписанию."
    sh "Скажи, Семён, а ты вчера ничего странного не замечал?"
    show sh smile pioneer close with dspr
    "Спросил Шурик и, как ему показалось, хитро прищурился."
    "Я, приподнял бровь, в свою очередь спросил у него:"
    me "Странного? В смысле?"
    show sh normal pioneer close with dspr
    sh "Да понимаешь, со мной что-то вчера произошло. И никто мне ничего не рассказывает. А сам я ничего не помню."
    "Я внимательно посмотрел на него. Врёт, поди."
    dreamgirl "Врёт-врёт, можешь не сомневаться. По глазам вижу."
    "Глаза у Шурика слегка поблёскивали за стёклами очков, но в целом выглядели как обычно. Что там можно разглядеть, совершенно непонятно. Но Шизе виднее. А Шурик тем временем ждал моего ответа."
    th "Конечно я видел. Много странного. Больше, чем он мог бы предположить. Но я не был уверен, что Шурик тот человек, с которым стоит обсуждать подобные вещи."
    dreamgirl "Правильно. А то ещё кусаться начнёт."
    "Согласилась со мной Шиза."
    "Тем более, что он за мной следил. Интересно, почему."
    me "Да нет, извини, Шурик. Ничего я такого странного в лагере не видел."
    show sh upset pioneer close with dspr
    sh "Ну а если не в лагере?"
    "Не унимался Шурик."
    sh "Ты вчера ходил куда-нибудь за пределы лагеря?"
    th "Ходил, естественно, но это совершенно не твоего ума дело."
    "Подумал я, но сформировал мысль по другому."
    me "Нет. Никуда я не выходил. Ты ведь знаешь, что без сопровождения взрослых территорию лагеря покидать нельзя. А вот ты, как мне кажется, вчера куда-то отлучался."
    show sh serious pioneer close with dspr
    "Глаза Шурика как-то странно забегали. Он несколько раз глубоко вздохнул и, видимо, решился на откровенный разговор."
    sh "Я? Да понимаешь, нам с Электроником детали нужны для робота. Здесь в лагере мы всё переворошили. Все сломанные приборы проверили. Нет нужных и всё тут. Не разбирать же единственное работающее радио."
    "Я молча ждал продолжения. Пока что всё выглядело достаточно правдоподобно."
    sh "Ну вот. Во время уборки на чердаке клуба, я случайно нашёл карту старого корпуса лагеря, знаешь небось – он здесь недалеко расположен, в лесу."
    "Так. Уже становится интереснее."
    me "Карту лагеря? И что в ней такого?"
    show sh serious pioneer close with dspr:
        zoom 1.1
    "Шурик наклонился ко мне поближе и зашептал."
    sh "То, что это не лагерь вовсе."
    show sh serious pioneer close with dspr
    "Я изобразил на лице сложное выражение изумления, смешанного с недоумением. Вроде получилось неплохо. Шурик, похоже удовлетворённый моими потугами, кивнул."
    me "Не лагерь? А что же?"
    sh "Точно не знаю, но, кажется, это место должно было служить каким-то укрытием на случай техногенной катастрофы. Это если судить по разветвлённой системе подземных тоннелей под корпусом и комнат-отсеков с гермодверями."
    me "Это ты всё понял по карте?"
    "Восхитился я. Почти искренне."
    show sh normal pioneer close with dspr
    sh "Не совсем."
    "Смущённо сказал Шурик."
    sh "Тоннели и комнаты безопасности я видел своими глазами."
    me "Ах вот как. Ну и нашёл ты там что-нибудь полезное?"
    sh "К сожалению, нет. Не знаю, сколько я ходил по этим тоннелям, но потом со мной, похоже, что-то случилось. Я ничего не помню. А очнулся уже на поляне возле корпуса."
    "И Шурик пересказал уже известную мне сцену с киданием через бедро и пощёчинами."
    me "Так. Теперь мне всё понятно. А почему ты решил спросить у меня?"
    show sh serious pioneer close with dspr
    sh "Да говорю же – я у всех уже спрашивал, кроме тебя. И все молчат. Даже Электроник."
    "Я изобразил задумчивость. Шурик с надеждой смотрел на меня. Щас! Так я тебе всё и рассказал."
    th "Незачем усугублять ситуацию. Со мной самим ничего ещё не ясно."
    me "Нет, Шурик, извини ещё раз. Ничего необычного я вчера не видел. Спал вчера целый день как сурок в своём домике. Только к ужину вышел."
    "По лицу Шурика было видно, что он глубоко разочарован. Потом, видимо поняв, что здесь он больше ничего не добьётся, молча кивнул мне и ушёл."
    hide sh with dissolve
    th "Ну а что он интересно ожидал от меня услышать? Может ему ещё и фото Юли показать? Обойдётся."
    "Я принялся за второй бутерброд. За время этой увлекательной беседы кофе совсем остыл."
    show sl smile pioneer close at center with dissolve
    "И тут ко мне за стол подсела Славя и широко улыбнулась – будто в столовой солнышко включили."
    "Её улыбка осветила все ближайшие столы, лица пионеров и поварих. Мне показалось, что даже безликий одинокий пионер слегка улыбнулся за своим столиком. Возможно только показалось – не могу сказать наверняка."
    sl "Привет, Семён!"
    "Весело сказала девочка."
    me "Привет."
    "Не особо жизнерадостно ответил я."
    show sl surprise pioneer close at center with dspr
    sl "Что с тобой, Сёма?"
    "Заботливо поинтересовалась Славя."
    th "Ого! Что это ещё за Сёма?"
    dreamgirl "Что-что? Нравишься ты девочке, не видишь что-ли?"
    th "Я? Нравлюсь?"
    dreamgirl "Ну а что? Парень ты видный. Пользуйся моментом."
    me "Да что-то голова разболелась. Спасибо, что поинтересовалась."
    show sl happy pioneer close at center with dspr
    sl "Да не за что, Сёма."
    "И снова эта улыбка… Славя, Славя… Эх, не было бы у меня Юли."
    dreamgirl "Гусар, ты девками-то не разбрасывайся. Никого у тебя пока нет. Забыл про предупреждение милого доктора?"
    "И в самом деле. Сделав над собой небольшое усилие, я улыбнулся девочке в ответ."
    me "Что ты хотела, Славя?"
    "Как можно дружелюбнее поинтересовался я у явно обрадованной такой переменой собеседницы."
    sl "Про танцы помним?"
    "Дождавшись моего утвердительного кивка, она продолжила:"
    sl "Мероприятие коллективное, пропускать нельзя."
    "Да, по мне видимо очень заметно, что я не любитель подобных массовых сборищ с увеселительным уклоном."
    "Так, с этим разобрались. Но Славя явно хотела сказать мне не только это."
    show sl shy pioneer close at center with dspr
    sl "А ещё я хотела бы попросить тебя о помощи."
    me "Какого рода помощь требуется?"
    "Спросил я, примерно догадываясь."
    show sl laugh pioneer close at center with dspr
    sl "Помощь с организацией мероприятия, естественно."
    "Весело ответила активистка."
    me "Понятно. А почему именно я? И я, что, буду делать всё один?"
    sl "Ну… Во первых ты будешь не один. Электроник тоже поможет. А во вторых…"
    show sl tender pioneer close at center with dspr:
        linear 1 zoom 1.1
    "Тут она наклонилась к моему уху, накрыла мою руку своей и прошептала:"
    me "Ты ведь такой сильный и не откажешься помочь девушке?"
    "Руку я не спешил убирать. Было приятно, не скрою."
    show un shy pioneer far at fleft with dissolve
    "За соседним столом, где Славя завтракала с девочками, осталась только Лена. Мику видимо уже закончила есть и ушла. Лена не слышала, о чём мы говорим, но когда заметила руку Слави на моей, то вздрогнула и уткнулась в свою чашку."
    hide un
    show sl shy pioneer close at center with dspr:
        zoom 1.1
    with dissolve
    me "Ну…"
    sl "А взамен я буду танцевать с тобой{w} весь{w} вечер."
    "Промурлыкала Славя и, видимо решив дожать меня, продолжила:"
    sl "А после танцев мы можем вместе погулять."
    "Я усмехнулся."
    me "Ну кто я такой, чтобы отказываться от такого предложения?"
    show sl happy pioneer close at center with dspr
    sl "Вот и отлично! Значит договорились."
    "Обрадовалась Славя."
    sl "Тогда через десять минут на площади."
    hide sl with dissolve
    "Я допил кофе, отнёс поднос с посудой на кухню и пошёл к выходу."
    window hide
    stop music fadeout 4
    scene bg ext_dining_hall_near_day with dissolve
    window show
    "И спустя каких-то пару мгновений я оказался на площади."
    jump alt_day6_uvao_duty_sl

# Завтрак, слушаем Шурика со стороны.
#
# Используется флаг alt_uvao_D5_sh_mines
#
label alt_day6_uvao_breakfast_without_sh:
    window hide
    scene bg int_dining_hall_people_day with dissolve
    play music music_list["so_good_to_be_careless"] fadein 4
    play ambience ambience_dining_hall_full fadein 4
    window show
    "Столовая была уже битком. Неудивительно. Свободными оставались всего пара столов. Один возле окна, где всегда в одиночестве принимал пищу какой-то пожилой пионер (а может и не пионер) с незапоминающимся лицом. А другой возле Электроника и Шурика." #Толик? Пожилой? Серьёзно?
    "Удача! Они-то мне и нужны. Может быть удастся что-нибудь узнать про вчерашние фортели этого гладиатора. Возможно Шурик доверяет Элу и будет с ним откровенен."
    "Взяв на раздаче традиционные утренние бутерброды и кофе, я отнёс поднос за выбранный стол и сел так, чтобы держать в поле зрения обоих кибернетиков."
    show sh normal pioneer far at fright
    show el normal pioneer far at cright
    with dissolve
    sh "…ты же знаешь, что у нас деталей для робота не хватает катастрофически. А я тут недавно разбирался на чердаке клубов и нашёл план-схему старого корпуса, который здесь недалеко."
    el "Да знаю я, что здесь недалеко находится старый заброшенный корпус. И что в нём может быть интересного?"
    sh "Да ты дальше слушай!"
    show sh serious pioneer far at fright with dspr
    "Было заметно, что Шурик сильно возбуждён. Главное, чтобы он опять с катушек не съехал."
    "Похоже, что Электроник подумал о том же самом, потому что с тревогой сказал:"
    show el upset pioneer far at cright with dspr
    el "Шурик, ты главное спокойнее."
    "Шурик глубоко вздохнул несколько раз и кажется взял себя в руки."
    show sh normal pioneer far at fright
    show el normal pioneer far at cright
    with dspr
    sh "Так вот. Оказывается этот корпус совсем не то, чем кажется. Под его территорией располагается сложная система тоннелей и бункеров. Вероятно на случай какой-то техногенной катастрофы. Или, что более вероятно, для каких-то исследований."
    "По лицу Электроника было видно, что он считает рассказ своего друга не более, чем горячечным бредом, вызванным переутомлением, но вслух он ничего не сказал. Вот, что значит воспитание."
    dreamgirl "Правильно. А что подумал Электроник, никто не узнал, потому что он был очень воспитанный."
    "Видимо, решив пока принять на веру рассказ о тоннелях, бункерах и техногенных катастрофах, он мягким тоном обратился к Шурику:"
    #dreamgirl "Правильно. С сумасшедшими спорить низзя."#Малость не в том месте эта реплика Шизы, закоменчу, поставлю другую повыше
    el "Так, допустим. А зачем ты туда пошёл?"
    sh "Ну я же говорю – найти каких-нибудь радиодеталей. Для робота. Там ведь наверняка есть много всякой аппаратуры."
    "Логика в его словах несомненно была. Видимо поэтому Электроник проглотил и это."
    "Но всё же спросил. И как мне показалось, даже немного обиженно. Как же - вместе делают общее дело, а тут на тебе."
    show el surprise pioneer far at cright with dspr
    el "А почему ты меня не позвал с собой?"
    sh "Хотел тебе сюрприз сделать."
    "Мгновенно отреагировал Шурик."
    sh "Ты придёшь в клуб, скажешь: \"Затянулся наш проект. Месяц уже стоит. Жаль, что у нас нет резисторов серии Е24\". А я тебе: \"Да вот же они\". И мы сможем наконец закончить нашего робота и заняться другим проектом."
    show el normal pioneer far at cright with dspr
    "Видно было, что к разговору он подготовился основательно. Но сможет ли он убедить вожатую в своей правоте и невиновности также легко, как Электроника? Кроме того, оставался невыясненным и ещё один момент."
    "Кажется Электроник тоже вспомнил про этот самый момент, потому что понизив голос спросил:"
    show el upset pioneer far at cright with dspr
    el "Шурик. А чем было вызвано твоё внезапное нападение и неадекватное поведение?"
    show sh serious pioneer far at fright
    show el normal pioneer far at cright
    with dspr
    "Шурик помрачнел."
    sh "А вот это самое интересное. Дело в том, что я ничего не помню. Я помню как спускался в тоннель. И всё, потом провал. А в следующий момент меня уже бьёт по лицу Ольга Дмитриевна."
    sh "Больно, кстати."
    "Он потёр щёку."
    "Электроник сидел какой-то притихший, переваривая полученную информацию. Но длилось это недолго - видимо инстинкт учёного преобладал."
    dreamgirl "Дух преобладал над плотью, ага."
    el "Возможно подобное неадекватное состояние и провалы в памяти - так называемая антероградная амнезия - вызваны травмой головы. Ты нигде не падал?"
    sh "Вроде нет."
    el "Какова же может быть причина в таком случае? Переутомление, возможно? Или что-то другое?"
    "Электроник задумался, перебирая варианты и что-то шепча про себя."
    sh "У меня есть теория. Даже две. И они даже могут быть связаны."
    sh "Первая. Не проветриваемые десятилетиями тоннели, соответственно недостаточный приток свежего воздуха, что приводит к кислородному голоданию."
    sh "Вторая. Возможно в тоннелях произошла утечка какого-то газа, вызывающего временное изменение сознания."
    sh "К такому выводу меня привёл странный запах в катакомбах."
    el "Но это звучит как-то уж совсем фантастически."
    sh "И тем не менее, это может быть правдой."
    "В самом деле, вся эта история выглядела фантасмагорией, особенно последняя её часть. Было заметно, что Шурик всё это придумал от начала до конца. Но только не Электронику. Видимо он полностью доверял своему другу. Но вот оправдает ли этот друг такое доверие…?"
    "Курносый нос Электроника задрался, глаза горели. Видно было, что он уже мысленно строил теории относительно поведения Шурика в катакомбах и ему уже не терпелось вернуться в клуб и произвести какие-нибудь расчёты."
    hide sh
    hide el
    with dissolve
    "Поняв, что здесь я больше ничего не узнаю, я поднялся с места, отнёс поднос с посудой в мойку и пошёл к выходу из столовой."
    jump alt_day6_uvao_duty

label alt_day6_uvao_breakfast_with_viola:
    window hide
    scene bg int_dining_hall_people_day with dissolve
    play ambience ambience_dining_hall_full fadein 4
    window show
    #TODO Текст
## палевное утро, к Виоле не хотим.
#
#
#Беседовать с Виолой на голодный желудок - нет уж, увольте!
#"Серьёзные разговоры подождут. Война войной, а обед по расписанию! Ну, то есть завтрак."
## столовая, детские вопли
#
#Сегодня на раздаче было какое-то столпотворение! Перед окошком бесилась и толкалась стая детей младшего школьного возраста.
##это вчерашние обожравшиеся ягодами. Им сегодня особую диету, как отравившимся.
#
#"Им же обычно еду сразу на столе раскладывают, с чего вдруг сегодня такие нововведения? Придется ждать, не расталкивать же мне их."
#От вкусных запахов крутило живот, от воплей сворачивались уши. Очередь - точнее, то, во что эти человекообразные ее превратили - никак не уменьшалась.
#"Я сейчас кого-нибудь сам сожру!"
#В: - Скучаешь, пионер?
#"То, что я так старательно оттягивал…"
#- Доброе утро, Виолетта Церновна.
#Произнес я чрезвычайно вежливо. Вчера она помогла погасить конфликт с Ольгой, и вообще выторговала мне немного самостоятельности, но… 
#В: - Доброе, доброе. Как хорошо, что ты мне попался, нам совершенно необходимо кое-что обсудить.
#Ласковая интонация не оставляла места иных трактовок - обсуждение будет проходить с использованием новейших достижений допросной технологии.
#Шиза: "Да окстись, какие там сыворотки правды? Проверенные временем дыба, кнут, и доктор Виола в красном кожаном корсете с головы до ног. Сам все расскажешь."
#Сцена, возникшая перед мысленным взором, была настолько переполнена чувственностью, вожделением, страхом, ожиданием и предвкушением боли пополам с наслаждением, что я поневоле покраснел.
#"Грёбаный ты извращенец!"
#В: - Ну-ну, всё совсем не так, как ты себе навоображал. Намного серьёзнее.
#В: - Давай за мной. Дети, пропустите-ка тётю доктора!
#Она прошла сквозь расступившуюся толпу прямиком к раздаче и, перекинувшись парой слов с поваром, вручила мне поднос с двумя порциями.
#
#Мы проследовали к свободному столику среди выделенных под администрацию, и я был освобождён от своей ноши.
#В: - Присаживайся, пионер. Поговорим.
#"А я-то надеялся, что дело ограничится эксплуатацией меня как официанта…"
#Шиза: "А ты в курсе, что старорежимое название официанта - половой?... Всё, молчу-молчу."
#
#В: - Как себя чувствуешь?
#- Ну… нормально. 
#В: - Головных болей, шума в ушах, галлюцинаций - нет?
#Я замялся. С одной стороны, утренний втык от Ольги и впрямь вызвал головную боль, а с другой…
#"Она же меня сразу лечить начнёт!"
#В: - Значит, все-таки есть.
#- Да ерунда, так, чуть-чуть голова утром болела. И всё, уже прошло! Здоров, как конь!
#И я, чтобы проиллюстрировать собственные слова, стал с аппетитом поглощать завтрак.
## что там у нас в меню, овсянка?
#- Ммм, вкуснотища!
#Виолу моё выступление, кажется, не впечатлило.
#В: - Аппетит у тебя здоровый, вижу. Особенно после вчерашних прогулок с персонификацией.
#- С кем?!
#В: - С этой твоей… Юлей. Ты так вчера и не рассказал, где вы были и что делали.
#- Ну-у-у… мы…
#Видя моё замешательство, Виола перегнулась ко мне через стол и понизила голос.
#В: - Всякие непотребства можешь пропустить.
#if hentai:
#"Что?! Откуда она знает?!"
#/if
#В: - Меня больше интересует произошедшее с Трофимовым. Вы его там видели?
#- Ээ… да, видели.
#В: - Вот и рассказывай. Где видели, что он делал, что происходило… 
#Я вздохнул.
#- Сначала мы его возле старого корпуса увидели. Он там что-то искал. 
#- Мы от него спрятались внизу, в убежище. Вы ведь знаете, где…
#В: - Знаю. Значит, спрятались в убежище, а дальше?
#- Дальше...
#if hentai:
#- Да ничего особенного!
#В: - Ну-ну. После такого ничего нам обычно душу вынимают, за поведение, несоответствующее высокому моральному уровню советского пионера.
#else:
#- Беседовали. Я пытался выяснить, кто она такая и что происходит.
#В: - Узнал?
#- Не очень.
#/if
#В: - Ладно, дальше. Что там с Александром?
#- Мы его в шахтах встретили.
#В: - Так, и что произошло?
#- Да он вообще псих! Набросился на меня со своей арматуриной, а потом, когда Юля выскочила меня защищать - запаниковал и удрал. А мы за ним, по шахтам, а он от нас на поверхность, через какой-то пролом в лесу. А там его уже Ольга с отрядом поймала.
#Виола выслушала этот остросюжетный рассказ с непробиваемым выражением лица.
#А я добавил:
#- Мне кажется, он в шахты не за деталями полез, а Юлю искать. Судя по тому бреду, что он нёс.
#В: - Час от часу не легче.
#- Вы думаете… Шурик из-за Юли рехнулся?!
#
#if hentai: #Виола уже подозревает, что попаданец уже тогось, и хочет просто уменьшить число пострадавших. 
#В: - А ты как думаешь? Не от несчастной любви, уж точно.
#Она замолчала, что-то обдумывая. Потом вздохнула.
#В: - Твоя подружка - просто источник неприятностей.
#- Юля?! Да нет же, она никому зла не хочет.
#В: - А я и не говорю, что она со зла. Но само её присутствие… 
#В: - Вот об этом, кстати, я и хотела с тобой поговорить. Вернее, попросить.
#В: - Если… точнее, когда вновь встретилась...Уводи её подальше от лагеря, пожалуйста. Мне совершенно не нужны другие подобные… инциденты. 
#В: - Я сейчас должна была бы устраивать тебе разнос за нарушение правил, грозить наказаниями, рассказывать, насколько опасна твоя подружка…
#В: - Но, по-моему, это бессмысленно.
#В: - Поэтому - постарайся, чтобы ваши свидания проходили без свидетелей. И мне спокойнее, и вам никто не помешает. Понимаешь?
#- А… а Юля и вправду опасна? 
#В: - Безусловно. После сколько-нибудь продолжительного контакта с ней у человека одна дорога - в желтый дом, сиречь в психоневрологический диспансер.
#- И я - тоже?
#В: - У любого обычного человека. А тебя к таковым причислить сложно, ввиду твоего происхождения.
#В: - Возможно, твоя головная боль - просто следствие переутомления. А возможно и нет. Кто знает...
#
#Она поднялась из-за стола.
#В: - Мы договорились, пионер?
#- Ээ… Да. Хорошо.
#В: - Ну вот и славно.
#
#else: #Семён предположительно готов к ассимиляции, предлагает сотрудничество
#В: - Без всяких сомнений.
#В: - К сожалению, причин такого… эффекта, скажем так, мы не знаем, но одно можно сказать определенно.
#В: - Общение с персонификацией крайне печально заканчивается для любого. 
#- Все сходят с ума? Так же, как Шурик?
#В: - Так же, или иначе - зависит от личной предрасположенности. Кто-то буйствует, кто-то наоборот, впадает в ступор…
#"Зачем она мне всё это рассказывает?"
#- Виола, что вам от меня надо?
#Мой вопрос, кажется, сбил плавное течение её лекции.
#В: - Да, действительно, мне от тебя кое-что надо. 
#В: - Как ты уже, надеюсь, понял, отпускать твою подружку гулять без надзора - плохая идея. А присматривать за ней некому… кроме тебя.
#- Меня?!
#"Она мне только что целый спич втёрла, какая Юля опасная, а теперь хочет, чтоб я ее пас?"
#В: - Больше некому, Семён.
#В: - А по поводу опасности - тебе это грозит в гораздо меньшей степени, чем кому бы то ни было. 
#В: - Сам посуди, весь день непрерывного контакта - и всего лишь головная боль наутро. Да и та может быть вызвана банальным переутомлением.
#Шиза: "Гордон, нам нужен кто-то, кто поместит образец в активную зону. Не беспокойся, у тебя будет защитный скафандр. Что может пойти не так?"
#Видимо, все мои мысли по этому поводу были четко написаны у меня на лбу, вот такенными буквами. 
#В: - Я не имею в виду специально ловить эту твою… Юлю, но если она тебя сама найдёт - постарайтесь гулять где-нибудь подальше.
#Она поднялась, складывая в поднос едва тронутый завтрак
#В: - В общем, подумай, Семён. Заставлять тебя не могу, но твоя помощь была бы очень кстати.
#
#/if
#
#Еще немного поковыряв ложкой безвкусное месиво, я сдался и отнес тарелки на мойку. Аппетит был успешно перебит беседой с Виолой, да еще и утренняя головная боль вернулась.
## площадь
#
#Я кое-как доковылял до скамейки и рухнул на неё, сдавив руками виски. По ощущениям, внутри черепной коробки перекатывалась морская мина времен Второй Мировой, и взрыв мог грянуть в любой момент, стоит лишь посильнее тюкнуть взрывателем.
#
#"Что за бред… кошкодевочки с психоизлучением, исследователи, замаскированные под пионерский лагерь… опыты на детях?"
#"Шахты, бомбоубежища, светящиеся кристаллы…"
#"Что. За. Бред."
#
#Шиза: "Эй, чувак, ты чего? Успокойся!"
#И этот голос ещё. Заткнись. Заткнись, сволочь!
#Шиза: "Я серьёзно - успокойся. А то…"
#"А то - что? ЧТО?!"
#Шиза: "Блин, да что с тобой?"
#Со мной все хорошо. Я в придуманном мире, где тепло и солнечно, где много милых и добрых девушек, и некоторые даже с кошачьими ушами и хвостами. Все в порядке. Не о чем беспокоиться.
#Шиза: "Чёрт…"
## медленно проявляем фон с высотками
#Произнесено это было с такой обреченностью, что я даже на секунду отвлекся от противотанкового ежа, который ворочался у меня в голове. Отвлекся, поднял глаза, и…
## фон с высотками проявился
#Над привычным пейзажем с Гендой во главе возвышались высотные здания типичного спального района. Я мог бы даже назвать примерный адрес, если присмотреться получше.
#"Какого…?!"
#"Что происходит?!"
#menu:
#"Вскочить!":
#"Надо что-то… это же…!"
#В панике я вскочил со скамейки.
#- Смотрите! Что это?!
#Проходящие мимо пионеры обернулись на крик, потом туда, куда я указывал… потом с недоумением посмотрели на меня.
#- Да вот же! Вы что, не видите?! Вон там! Вон же!
## серая толпа. Взять спрайт из Катавы
#Они стояли кругом, на почтительном отдалении, смотрели на меня и о чём-то перешептывались. Кто-то побежал прочь по тропинке, поминутно оглядываясь…
## Толик норм
#Почему-то из всей толпы я четко видел только этого лысого… не знаю, пионер он, или вожатый, или кто-то из администрации.
## Толик зол
# Он просочился в первые ряды, посмотрел на меня, потом глянул в сторону высоток, скривился и ушёл.
## Толика убрать
#Скамейка, выбрав момент, подло ударила меня по затылку.
## темнота
## jump котопульта в тонущий автобус
#
#"Зажмуриться!":
## зажмуриваемся и темнота
#"Это бред… нет, это бред внутри бреда!"
#"Пожалуйста, оставьте мой измученный мозг в покое…"
#
## пауза, довольно длинная.
## несколько раз показываем-убираем интерфейс
## если получится - подчищаем лог до выхода из столовой
#
#Од: - Семён!
## открываем глаза. Площадь нормальная
#"Я что, задремал?"
#Од: - Поглядите на него! Спит!
#
#
## Ольга припахивает к полезной работе, про морок с высотками успешно забыли.
#
