# Д6-Обед с Алисой или Славей (свободный выбор)
#
# используется флаг обеда с Леной в 4Д alt_uvao_D4_lunch_un
# используется флаг обеда со Славей в 4Д alt_uvao_D4_lunch_sl
# используется флаг встречи со Славей на пляже в Д5 alt_uvao_D5_evening_sl
# используется флаг встречи с Леной и Алисой на площади вечером Д5 alt_uvao_D5_evening_dv_un
# используется флаг Полной Информированности alt_uvao_D6_CS_vetrov
#
    label alt_day6_lunch_dv_sl:
    menu:
        "Сесть с Алисой":
            # Взаимный троллинг
            # "Надо же, как хорошо устроился - и в медпункт, как на работу, и активисточка всё время рядом вьётся!"
            # Задумываемся о поведении Слави
            # Если есть флаг обеда с Леной в 4Д alt_uvao_D4_lunch_un, Алиса упоминает о изменении поведения Лены.
            # Если есть флаг вечера 5д alt_uvao_D5_evening_dv_un - о том, что, похоже, Лена втрескалась в Cемёна.
            # Если есть флаг эффекта alt_uvao_D6_CS_vetrov - Семён задумывается, вспоминает о Лене, начиная с первого дня, подозревает о кошочкином участии.
            if (alt_uvao_D6_CS_vetrov and alt_uvao_D4_lunch_un and alt_uvao_D5_evening_dv_un):
                menu:
                    "Поговорить с Мику":
                        #
                    "Искать Юлю":
                        #
                    "Не надо паники!": # (в баббле - "Свалить к Славе")
                        #jump "Разговор со Славей у столовой"
            else:
                #jump "Разговор со Славей у столовой"
        "Сесть со Славей":
            # Приглашение встретиться после танцев
            if (alt_uvao_D4_lunch_sl and alt_uvao_D5_evening_sl):
                # Как-то Славя внезапно переменилась. Другой человек прямо-таки!
                #jump "Обсудить подозрительное поведение Слави с ОД"
            else
                # Посчитать, что беседа будет о делах амурных (Можно помечтать на веранде столовой)
                # Топаем в домик
