    #
    # Самая левая ветка, события в медпункте
    #
    # сцена - медпункт вечером снаружи
    "К тому времени, как мы добрались до медпункта, я успел наконец отдышаться."
    "Выслушавшая мой сбивчивый рассказ Ольга, наоборот, раскраснелась и пыхтела как паровоз."
    "Взбежав на крыльцо, она рывком распахнула дверь и вбежала вовнутрь."
    cs "Вообще-то, принято стучать, когда..."
    "Вожатая не дала ей закончить."
    mt "Вообще-то, я с самого начала говорила тебе, что это добром не кончится! Скажи, говорила?!"
    # медпункт изнутри (вечером, если есть, но не ночью)
    # CS недовольная поверх очков, MT angry
    "Слегка притормозив, я вошёл следом за Ольгой и, прикрыв за собой дверь, деликатно прислонился к стене возле входа, стараясь не слишком отсвечивать."
    mt "Вот вам, пожалуйста, ещё одно ЧП! Сначала один пионер попал под воздействие, теперь вот ещё Тихонова!"
    "Виолетта окинула её холодным взглядом с ног до головы."
    cs "Да, говорила. А я тебе тогда ещё ответила, чтобы ты не путала обычный пионерский лагерь и полевой спецобъект."
    cs "У нас имеет место активная фаза эксперимента, ради которого всё это и затевалось, между прочим."
    cs "Произошли некоторые события, не предусмотренные первоначальным планом исследований, но ситуация находится под контролем, серьёзно пострадавших нет."
    "Ольга всплеснула руками, но Виола остановила её резким взмахом руки."
    # CS zhi
    cs "А ЧП, моя дорогая, это когда вожатую с физруком застанут на пляже за эээ... действиями аморального характера. Вот тогда это, несомненно, ЧП на территории пионерского лагеря."
    "Я удивлённо заморгал."
    th "Вот это номер! Но откуда она узнала? Получается, кто-то ещё, кроме Юли, их видел и Виоле заложил?"
    "На слова Виолы вожатая ничего не ответила, только дёрнула головой, словно ей вдруг стал тесен воротник."
    "Помолчав несколько секунд, она произнесла напряжённым голосом, ни на кого не глядя:"
    mt "Да, Виолетта, ты совершенно права. Извини пожалуйста."
    cs "Ничего страшного, нервное напряжение, я всё понимаю. Ты присядь."
    "Она махнула в сторону кушетки и Ольга послушно уселась на неё, всё так же ни на кого не глядя."
    "Виола наконец обратила внимание на меня."
    cs "Очень хорошо, Семён, что ты ввёл Ольгу в курс дела. Это сэкономит нам кучу времени."
    "Возможно, мне показалось, но в её голосе прозвучала нотка ехидства."
    # какой-нибудь страшный грохот, hpunch и прочие спецэффекты
    "Дверь с грохотом распахнулась, чуть не пришибив меня, и в медпункт ворвалась Лена."
    "Споткнувшись о порог, она едва не растянулась на полу, но каким-то чудом удержала равновесие, разом очутившись посреди комнаты."
    "Похоже, весь путь до медпункта, и путь немалый, она проделала бегом. Прижимая руки к груди и полусогнувшись, дувушка выдохнула, задыхаясь:"
    un "Где... Где он?!"
    "Виола и вскочившая на ноги вожатая уставились на неё в изумлении."
    mt "Лена, что случилось? О ком ты говоришь?"
    un "Где... Семён?.. Что... с ним?"
    me "Э-э-э... Лена?"
    "Девочка обернулась и наконец заметила меня. Судорожно всхлипнув, она на нетвёрдых ногах сделала шаг ко мне. Я почувствовал, что невольно вжимаюсь спиной в стену."
    un "Ты... Ты не ранен?"
    "Окончательно сбитый с толку, я только и смог выдавить:"
    me "Н-нет...{w=1.0} Что случилось?"
    "Тут ноги у Лены подкосились, и она бы упала, наверное, если бы её не подхватила вожатая и не усадила слабо всхлипывающую девочку на кушетку. Та по-прежнему задыхалась, плечи её ходили ходуном."
    "Виола подошла к стеклянному шкафчику с лекарствами. Покопавшись в нём немного, достала пузырёк с бело-синей этикеткой."
    "По комнате поплыл полузнакомый резковатый запах."
    "В каком-то оцепенении я следил, как капли падают на дно стеклянной мензурки, а медсестра неслышно шевелит губами, считая."
    "Досчитав до двадцати, она покосилась на Лену и добавила ещё десять капель, разбавила водой из графина и протянула девочке."
    cs "Вот, выпей."
    "Лена выставила перед собой руку:"
    un "Н-не... н-не надо."
    "Ольга, дурного слова не говоря, забрала мензурку и залпом проглотила содержимое, поморщившись. Сунув опустевший стаканчик Виоле в руки, она села на кушетку рядом с Леной и, полуобняв её, зашептала на ухо что-то успокаивающим голосом."
    cs "Однако!"
    "Только и выговорила Виола, озадаченно глядя на мензурку, а потом на меня."
    "Я наконец сумел отклеиться от стенки. Подойдя к кушетке, я наклонился к девочке."
    me "Лена, послушай меня. Почему ты решила, будто со мной что-то случилось?"
    "Девочка подняла на меня совершенно круглые глаза."
    un "Мне Алиса сказала, что..."
    "Она всхлипнула. Обычно бледное лицо её шло красными пятнами."
    me "Лена, не волнуйся. Всё хорошо. Всё в порядке, я тебе точно говорю.{w} Так что тебе сказала Алиса?"
    un "Она... Она сказала, что ты в медпункте, и что мне... что мне как можно скорее туда надо придти."
    un "Я подумала... я подумала, что ты... что с тобой..."
    "Вздрогнув всем телом, она снова судорожно всхлипнула и спрятала лицо в ладонях."
    "Я выпрямился. Об остальном и так несложно было догадаться."
    th "Она, конечно, не стала дальше слушать Алису, а всё бросила и помчалась сюда, в медпункт."
    th "Безусловно, женская логика штука сложная, но это, всё-таки, явный перебор. Совершенно ясно, что с  головой у неё неладно."
    dreamgirl "Или она отчаянно в тебя влюблена, что тоже, впрочем, вовсе не свидетельствует в пользу её душевного здоровья."
    "Виолетта, молча следившая всё это время за происходящим, подала наконец голос:"
    cs "Семён, вот что - сбегай-ка ты в столовую и принеси нам всем поужинать."
    "Лена вскинулась было, но Виола заявила решительно:"
    cs "Успокойся.{w=1.5} Никуда он не денется, и ничего с ним на территории лагеря не случится, это я тебе обещаю!"
    "Выудив откуда-то пару судков солидных размеров и сетчатую сумку-авоську, она всучила всё это мне и подтолкнула к выходу."
    cs "Давай-ка, пионер, быстренько. Одна нога здесь, а другая уже в столовой.{w} И да, по дороге можешь не торопиться!"
    "Старательно делая вид, что не замечаю отчаянного взгляда Лены, я кивнул и поспешил освободить помещение."
    # сцена - медпункт вечером снаружи
    "Оказавшись снаружи, я перевёл дух."
    th "\"Быстренько и можешь не торопиться\". Ясное дело, хочет пообщаться с Леной в спокойной обстановке."
    th "Не представляю себе, как они будут с ней объясняться!{w} \"Знаешь, Лена, тебе всё показалось! Вовсе ты ни в кого не влюблена, а просто подверглась воздействию визуализации с хвостом. Не переживай, дело-то житейское!\""
    "Я попытался поставить себя на место бедной девочки и меня передёрнуло."
    dreamgirl "Если уж ты ей так сочувствуешь - вернись и прими участие в беседе!"
    th "Нет уж, спасибо. Виола с Ольгой специалисты - им и карты в руки.{w} Я и в мирной-то жизни обясниться с девушками толком не мог никогда, а тут..."
    "Я решительно повернулся спиной к двери."
    th "Но Олька! Как она это лекарство залихватски тяпнула!"
    "Я захихикал было, но вдруг осёкся.{w} Вспомнил, почему запах показался мне знакомым."
    # текст на весь экран
    $ set_mode_nvl()
    "Поздний вечер, на улице темно."
    "Родители снова поругались."
    "Я, глупый мальчишка, ничего тогда толком понимал и не мог знать того, что глиняные ноги колосса уже подмыла вода, что Советскому Союзу остался год или два до краха.{w} Да и мало кто из взрослых что-то понимал, я думаю."
    "Вот слово \"дефицит\" я знал. И что слипшаяся в бесформенный буроватый ком масса в бумажном кульке называется \"клюквенная пастила\" - тоже. А стоять в очереди лучше вместе с кем-нибудь, потому что - одно кило в одни руки."
    "И что если {i}добытая{/i} в двухчасовой очереди курица окажется {i}с душком{/i}, то можно её так приготовить, что ничего не будет заметно. Ну почти ничего."
    "Вот про то, что на нескольких сотках земли можно самим вырастить картошку, и потом практически одну только эту самую картошку и есть весь год - до следующего урожая - я тогда ещё не знал."
    "И ещё не знал, что скоро двухсотграммовый кусок сыра или пачка масла станет отличным подарком на день рожденья. А вот талоны на продукты тогда уже начали появляться, кажется. Серые, напечатанные на обёрточной бумаге."
    "Но вот про то, что купить что-то всё сложнее и сложнее, а родителям всё чаще задерживают зарплату - про это я знал."
    "Родители, когда ссорились, про это часто... говорили.{w} Наверное, поэтому они и ссорились всё чаще."
    nvl clear
    "Поздний вечер, на улице темно."
    "Родители снова поругались."
    "Отец хлопнул входной дверью и теперь, наверное, курит внизу у подъезда."
    "Мама, с покрасневшими глазами, всё ещё всхлипывая, слегка дрожащей рукой капает себе в маленький  дымчатого стекла стаканчик \"валокордин\"."
    "Сквозь узорный цветной плафон просвечивает лампочка, отбрасывая на стены причудливые тени. По кухне плывёт щекочущий ноздри запах.{w} Я тихонько сижу в уголке."
    nvl clear
    "Мне вдруг стало как-то не по себе."
    th "А я ведь как попал сюда, в этот лагерь, так ни разу про родителей и не вспомнил. Из автобуса тогда попытался до них дозвониться - и всё."
    dreamgirl "{i}Посему оставит человек отца своего и мать свою и прилепится к{/i}...{w=1.5} Слушай, а к кому бы тебе прилепиться? Несолидно как-то!"
    th "Ты мне ещё из Корана процитируй что-нибудь. Для солидности."
    "Огрызнулся я."
    dreamgirl "Из Корана я не могу, ты же его не читал. А память-то у нас общая, к моему огромному сожалению."
    "Я промолчал. Можно было продолжить ругаться с Шизой, но это не могло изменить главного."
    "Я вдруг понял, что про \"оставит человек\" всё уже решено.{w} Решено бесконечное количество раз бессчётным множеством людей."
    # текст внизу экрана
    $ set_mode_adv()
    # горн к приёму пищи
    "Горн напомнил мне, что быстро или медленно, но за едой идти всё-таки придётся. Сунув судки в авоську и постаравшись выкинуть из головы лишние мысли, я поплёлся в столовую."
    dreamgirl "Кстати сказать, на дворе 89-й год, если нам не соврали. Вдруг и здешнему Союзу осталось пару лет доживать? Только ты обживёшься, а оно всё р-р-раз, и пополам!{w} Что ты тогда делать будешь?"
    "Стесняясь собственного малодушия, я робко предположил:"
    th "Ну... Может быть, ещё и обойдётся как-нибудь? Мелких-то различий хватает, может и крупные найдутся?"
    if alt_uvao_D6_CS_vetrov: #ЛБ: может быть, и какой-то другой флаг поставить. Или убрать нерешительную вилку совсем
        th "Хотя... пожалуй, мне-то как раз легче будет выкрутиться, чем им. Это они здесь дети тепличного социализма, а я..."
        dreamgirl "...А ты матёрая акула дикого капитализма, ага!"
        th "Ничего, прорвёмся!"
        "Решительно отрезал я. Внутренний голос хмыкнул, но промолчал."
    else:
        "Внутренний голос скептически хмыкнул, но ничего не сказал."
    #
    # TODO Алиса беспокоится о судьбе Лены - очень уж та резво убежала. ГГ успокаивает, как может
    # сцена - столовая снаружи вблизи вечером
    # show dv sad
    # "На входе в столовую меня перехватила выскочившая откуда-то Алиса. Секунду поколебавшись, она спросила:"
    # dv "С Леной... с Леной всё в порядке?"
    # me "Ну... да"
    # show dv shy
    # /TODO
    #
    # сцена - столовая изнутри вечером
    "В столовой было людно, как и за обедом. Порадовавшись мимоходом, что хотя бы место за столами мне искать сейчас не придётся, я собрался было пробиться на раздачу без очереди, прикрываясь больничными судками, но потом вспомнил, что меня ждёт по возвращении в медпункт."
    "Торопиться разом расхотелось, и я смирно пристроился в хвост очереди за каким-то пионером из второго отряда.{w} Или третьего - кто их разберёт."
    # проверить, как у Автора в дежурстве в столовой отображается voice поварихи
    if alt_day3_duty:
        "Впрочем, через несколько минут я предстал перед знакомой уже по дежурству в столовой поварихой."
        "Увидев меня, она заулыбалась:"
        voice "А, помощничек! А чтой-то ты с судками? В медпункт, да? А поднос где? Сам-то есть не будешь разве?" #ЛБ: напоминаю на всякий случай, что данная гражданка имеет своеобразный говор
        "Услышав, что мне нужны четыре порции ужина в медпункт, она кивнула."
        voice "Тебе, сынок, из какого бачка? Со вкусным или с невкусным?"
        "Посмотрев на мою упавшую челюсть, она гулко захохотала, заколыхавшись всем своим дородным телом."
        "Отсмеявшись и утирая слёзы, она сжалилась наконец надо мной:"
        voice "Тебе общий стол надо, или доктор диету какую велела?"
        me "Ага... общий, да."
        "На ужин оказались тефтели и какая-то сомнительного вида сероватая каша - не то перловая, не то овсяная, не разобрать. Щедро наполнив судки, повариха выудила откуда-то из-за спины четыре тарелки и вилки-ложки."
        voice "На, держи. У доктора тарелок-то нет, я знаю."
    else:
        "Впрочем, через несколько минут я уже предстал перед дородной тёткой в белом поварском костюме."
        "Услышав, что мне нужны четыре порции ужина в медпункт, она с подозрением окинула меня взглядом с ног до головы, но больничные судки в моих руках, похоже, убедили её."
        "Недовольно осведомившись у меня, обычную мне еду надо, или диетическую какую-нибудь, она плюхнула в один судок какую-то сомнительного вида кашу - не то перловую, не то овсяную, не разобрать даже, а в другой - вполне симпатичные на вид тефтели."
        "Поколебавшись немного, повариха сунула мне несколько тарелок и вилки, проворчав:"
        voice "На вот... У доктора-то тарелок нет, я знаю."
    voice "Только смотри, до завтрака чтоб принёс тарелки назад! Вы завтра съедете отсюда, а посуду помыть ещё надо!"
    "Покорно кивнув, я сгрёб всё в авоську и заторопился на выход."
    # сцена - медпункт снаружи вечером
    "Как ни старался я оттянуть момент своего возвращения в медпункт, но чему быть, того не миновать.{w} Потоптавшись немного на крыльце, я наконец постучал и заглянул внутрь."
    # сцена - медпункт вечером изнутри
    # поиграться с освещением - как в scene expression Noir("bg int_dining_hall_people_sunset", brightness = -0.4, saturation = -0.4) at zentercenter
    #  un sad, cs neutral, mt sad
    cs "Заходи, Семён, заходи."
    "Обстановка в медпункте была, мягко говоря, напряжённой.{w} Лена сидела всё там же, на кушетке, с лицом белым, как алебастр."
    "Когда я вошёл, она на долю секунды подняла на меня глаза и тут же уставилась на руки, сцепленные на коленях."
    "Напротив неё вполоборота расположилась на стуле Виолетта Церновна. Ольга примостилась на краешке стола с таким угрюмым выражением лица, словно ей сообщили о разжаловании в октябрята."
    "Пауза затягивалась. Кашлянув, я промямлил наконец:"
    me "Вот я здесь... Ужин принёс."
    "Я не нашёл ничего лучшего, чем в подтверждение своих слов продемонстрировать авоську с судками."
    cs "Что же, давайте ужинать."
    "Поднявшись и согнав со стола Ольгу, она принялась освобождать на нём место для судков и тарелок."
    "При виде каши Виола слегка скривилась, но всё-таки вылоложила понемногу на тарелки и всучила одну из них Лене, всё так же упорно не поднимающей головы. Девочка покорно взяла тарелку и ложку, но не сделала ни малейшей попытки притронуться к еде, целиком сосредоточившись теперь, судя по всему, на разглядывании содержимого тарелки."
    "Со стоическим выражением на лице Виола взяла свою порцию, жестом приглашая нас с Ольгой последовать её примеру и вновь уселась на стул."
    "Раздался звон. Обернувшись, я увидел, как Лена поспешно подобрала с пола ложку и вновь замерла неподвижно."
    dreamgirl "Упавший нож - к визиту мужчины, вилка - женщины. Интересно, а упавшая ложка к чему?"
    "Впрочем, даже обычно самоуверенный голос Шизы прозвучал в голове как-то натужно. Отвечать что-либо я не стал."
    "Чувствуя, что при одном взгляде на еду меня начинает мутить, я распахнул дальнее окно, и уселся на подоконник, прижавшись затылком к стеклу открытой створки и отставив тарелку подальше от себя."
    # звук - вечерний лагерь
    "Большого облегчения, однако, это не принесло. Воздух в кабинете казался словно бы наэлектризованным - кажется ещё чуть-чуть, и с лёгким потрескиванием волосы встанут дыбом. Начинающиися сумерки ещё больше усиливали ощущение наваливающейся тяжести, заставляющей сутулить плечи и не дающей вздохнуть."
    # сцена - медпункт изнутри ночью
    # возможно, подыскать гул люминесцентного светильника в фон.
    "Пробормотав что-то Виолетта встала и щёлкнула выключателем. Под потолком с показавшимися мне оглушительными гулкими ударами и жужжанием ожили светильники и залили медпункт ярким белым светом. Сумрак на улице тут же словно бы сгустился, и разглядеть что-либо за оконными стёклами стало невозможно."
    th "Весело, как в покойницкой."
    "Подумал я, наблюдая за Ольгой, которая меланхолически помешивала кашу в своей тарелке, не делая, впрочем, никаких попыток её попробовать. Аппетита у неё явно было не больше, чем у меня."
    $ meet('uv','Голос')
    # возможно, здесь страшный звук. или нет.
    with vpunch
    uv "Вот ты где!"
    # hide cs, un, mt
    # show uv sad
    "Чуть не свалившись от неожиданности с подоконника, я обернулся. С улицы на меня практически в упор смотрела Юля. Как она подошла я не слышал - впрочем, чего ещё ожидать от кошки?"
    $ meet('uv','Юля')
    uv "Я тебя везде ищу..."
    "Начала было она недовольно и вдруг замолчала, принюхиваясь."
    uv "А что это у тебя?"
    "При виде тарелки глаза её восхищённо раскрылись."
    # show uv laugh
    uv "Котлета?!"
    "Через мгновенье лежавший там одинокий тефтель исчез у неё во рту."
    uv "М-м-м! А у тебя там ещё есть котлеты, я чую!"
    "Прежде, чем я успел вымолвить хотя бы слово, она легко перемахнула через подоконник и спрыгнула на пол медпункта."
    # show mt, un, cs surprise (или shocked) at left
    # show uv shocked at fright
    "Для Юли наличие у меня компании явно стало полнейшей неожиданностью. Широко раскрыв шлаза, она замерла на месте."
    "Впрочем, Виолетта с вожатой и Леной тоже не были готовы к повлению перед ними чуда с кошачьими ушами и хвостом. Остолбенев, они во все глаза таращились на Юлю."
    "Несколько секунд наступившую тишину нарушали только гудение ламп под потолком и доносящийся из окна отдалённый шум лагеря."
    "Однако сладкие запахи манили, а моё присутствие придало Юле смелости. Прижав уши и косясь на меня, она, тем не менее, бочком-бочком двинулась по направлению к столу."
    # mt scared, cs normal
    "Тихо ойкнув, Ольга осела на кушетку рядом с Леной и почему-то поджала под себя ноги, словно по полу вдруг пробежала мышь. Виолетта медленно поднялась со стула и так же медленно сделала шаг назад, загораживая собой Лену. Та не двинулась с места, лишь выпрямилась, всё так же завороженно глядя на Юлю. Кажется, она даже забыла на время о своих переживаниях."
    "Подобравшись к столу, Юля ещё раз оглянулась на меня и протянула руку к судку с тефтелями{w}... Но замерла внезапно, пристально глядя Виолетте в лицо."
    "Пару секунд они смотрели друг на друга.{w=2} Потом Юля вдруг кивнула, что-то пробормотала и, осторжно пододвинув к себе стул, уселась за столом подальше от людей."
    "Посмотрев ещё раз на Виолу, она неуверенно взяла со стола вилку и, зажав её в кулаке, неловко попыталась подцепить ей тефтель.{w} Со второго или третьего раза ей это удалось."
    "Открыв рот, я смотрел, как ушастая уплетает тефтели, периодически поглядывая на Виолу - Ольгу с Леной она игнорировала напрочь. В какой-то момент я заметил, что Юля уже не зажимает вилку в кулаке, а довольно уверенно держит её \"по-культурному\"."
    th "Обалдеть можно... Ещё пять минут, и она салфетку потребует, не иначе!"
    "На Виолетту было любо-дорого посмотреть. Лицом её сейчас выражало безмятежное спокойствие, и лишь цепкий взгляд слегка прищуренных глаз подсказал мне, что она {i}работает{/i}, пристально наблюдая за происходящим, не упуская ничего, ни малейшей детали."
    "Впрочем, одного взгляда на Ольгу хватило, чтобы понять - она-то в любую секунду может грохнуться в обморок. {w}Чувствуя, что Виолетта не собирается пока вмешиваться в происходящее, я решил хоть как-нибудь разрядить обстановку и осторожно прочистил горло:"
    me "Кхм... Вот... Познакомьтесь, пожалуйста, это Юля."
    "Все четверо на секунду взглянули на меня. Потом Юля вернулась к тефтелям, а остальные вновь уставились на неё."
    "Чувствуя себя полным идиотом, я, тем не менее, попытался закончить церемонию знакомства:"
    me "Юля, это Виолетта Церновна, Ольга..."
    uv "Ням знавю!"
    "Перебила меня Юля, не переставая жевать."
    uv "Я всех вдесь зням."
    "Прикончив тефтели, она брезгливо потыкала вилкой в кашу на ближайшей тарелке и со вздохом облизнулась."
    uv "Жалко, что котлеты кончились. Вкусные!"
    "Посмотрев ещё раз Виолу, она поёрзала на стуле и вдруг добавила:"
    uv "Спасибо!"
    cs "Пожалуйста."
    "Ответила Виолетта так непринуждённо, словно к ней каждый день на ужин заходят девочки с кошачьим хвостом."
    "С улицы вдруг грянула музыка."
    th "Ну да, дискотека же, наверное! Ужин-то давно уже закончился."
    # show uv laugh
    "Юля вскочила со стула, заставив всех вздрогнуть и подбежала ко мне."
    uv "Ой, Семён, там опять музыка! Там опять коне... концерт, да?"
    me "Нет, это дискотека. Ну, танцы, знаешь?"
    uv "Знаю! Пойдём скорее, я хочу послушать! И посмотреть!"
    # show uv dontlike
    uv "А то здесь все такие грустные! Мне не нравится! Совсем-совсем не нравится!"
    "Заявила она вдруг обвиняющим тоном, обернувшись к остальным.{w} Схватив за руку, она потащила меня к окну."
    uv "Пойдём же, ну!"
    # show un neutral
    # show uv, mt, cs surprise
    un "Я тебя знаю!"
    "Тихо сказала вдруг Лена, всё это время сидевшая словно в каком-то ступоре. Она встала и сделала шаг вперёд."
    un "Я тебя видела там, на площади...{w} Нет, я не видела, но ты там была, я помню! Вечером, когда Семён ко мне подошёл!"
    "Лицо Лены вдруг пошло красными пятнами. Уже громче она продолжила:"
    un "Я сидела, читала книку, а он подошёл и заговорил со мной, а потом... потом..."
    "Виолета попыталась было удержать девушку, но та резко дернула плечами, сбрасывая её руки." #ЛБ: как бы это по-людски выразить...
    # show un angry
    extend " Лицо Лены вдруг исказила гримаса гнева, и она закричала, уже не сдерживаясь:"
    un "Это ты со мной сделала! Ты! Я знаю!!!"
    # show uv fear
    # show un rage
    "Она шагнула к Юле, сжимая кулачки."
    un "Это всё ты!!!"
    # show cs fear
    # show uv angry
    cs "Лена, стой!"
    menu:
        "Не мешать Виоле.": # катапульта.
            # текст на весь экран
            $ set_mode_nvl()
            # спрятать все спрайты
            "Не в силах больше выносить это безумие, я отвернулся и закрыл глаза, с силой прижавшись лбом к оконному стеклу."
            cs "Лена, стой! Ольга, да помоги же мне!"
            un "Пустите! Пустите меня!!!"
            cs "Да помоги же!!!"
            un "Это всё ты!!!"
            uv "Семён! Семён, я боюсь!"
            "Кто-то - наверное, Юля - принялся трясти меня за плечо, но я лишь крепче прижался к стеклу."
            th "Как же я устал от всего этого! Не могу больше!"
            "На меня вдруг дунуло свежим ветром и я с наслаждением подставил ему лицо, чувствуя, как он уносит с собой и яростные крики Лены, и Юлино нытьё...{w} Ухватившиеся за моё плечо настырные пальцы разжались, и я полностью отдался всё крепчающему бризу."
            "По лицу вдруг хлестнуло ледяными брызгами и от неожиданности я открыл глаза."
            # сцена - в тонущем автобусе
            $ set_mode_adv()
            # TODO - посмотреть катапульты в реку у Автора. М.б. позаимствовать.
            "Тело обожгло нестерпимым холодом. Скорчившись в судороге, я ещё успел почувствовать, как ледяная вода - куда уж там умывальникам в лагере - заливает лицо, расплавленным свинцом проникает в нос и горло..."
            # jump куда-то или return... Уходим в небытие, короче.
        "Вмешаться.":
            pass
    "Плохо понимая, что делаю, я шагнул навстречу девушке и обхватил её руками, крепко прижимая к себе."
    dreamgirl "Эй, ты что творишь, псих!"
    # всех прячем, show un shocked close
    me "Тише, Лена, тише!"
    "Она забилась в моих руках, словно вытащенная из воды рыба."
    un "П-пусти.{w=1.0} П-пусти!{w=0.8} Отпусти меня, с-слышишь!"
    "Последние слова она выкрикнула она мне в лицо и вдруг, разом перестав вырываться, обняла, прижавшись всем телом, дрожа и  всхлипывая."
    $ set_mode_nvl()
    un "Отпусти-и, слышишь... Пож-жалуйста, отпусти."
    "Краем глаза я видел, как рядом молча и деловито двигается Виола. Блеснул металл в свете лампы, что-то звякнуло, пару раз хрустнуло стекло вскрываемых ампул."
    "Всё, что мне оставалось, это ещё крепче прижимать к себе вздрагивающую девочку, чуть поглаживая её по спине и шептать негромко на ухо:"
    me "Тише, хорошая, тише... Всё в порядке. Всё уладится, тише."
    nvl clear
    "Запахло спиртом и раздался негромкий голос Виолы:"
    cs "Лена, девочка, дай мне руку, пожалуйста."
    "Лена взрогнула, но помедлив секунду, не глядя протянула левую руку."
    cs "Хорошо. Семён, покрепче."
    "Снова краем глаза я увидел, как блеснул шприц. Не делая ни малейшей попытки вырваться, Лена лишь до боли прижала меня к себе свободной рукой, словно пытаясь слиться со мной воедино, и уткнулась лицом мне в плечо."
    cs "Потерпи, девочка, сейчас всё пройдёт, сейчас."
    "Мне показалось, что прошла целая вечность, прежде чем звякнул пустой шприц, и я услышал:"
    cs "Ну вот и всё, девочка. Теперь всё будет хорошо, две минуты потепеть ещё - и всё."
    nvl clear
    "Вновь обняв меня обеими руками, Лена едва заметно кивнула. Она больше не всхлипывала, но я чувствовал её неровное прерывистое дыхание."
    "Только дыхание и выдавало, что она всё ещё плачет. Дыхание, и то, что рубашка у меня на плече была мокрой и горячей."
    # pause 5
    "Виола не обманула - через пару минут девушка задышала ровнее и глубже, бившая её дрожь ослабла."
    $ set_mode_adv()
    # show un cry close
    "Сковывавшие меня объятья ослабли и разжались.{w} Она с трудом подняла голову. Черты её лица словно бы сгладились, глаза были полузакрыты."
    un "Семён..."
    # hide un
    "Прошептала она непослушными губами и вновь уронила голову мне на плечо. Тело в моих руках безвольно обмякло, став вдруг пугающе тяжёлым."
    cs "Семён, сюда её. Сможешь?"
    show cs neutral, mt sad, uv sad
    "Оглядевшись, я обнаружил, что Виолетта уже успела застелить кушетку - ту же самую, куда вчера вечером мы с Элом сгружали пленного Шурика. Молча подхватив Лену на руки, я перенёс её на несколько шагов и как мог бережно уложил на белоснежную простыню."
    "Пока Виола хлопотала над девушкой, ослабляя ворот рубашки, проверяя пульс, зрачки и укрывая её, я вспомнил, как вчера мы с Шизой переругивались - мол, намного приятнее было бы нести на руках Лену, а не Шурика."
    dreamgirl "Наверное, сейчас стоило бы сострить что-нибудь на тему моей правоты, но что-то настроения нет, так что извини."
    # кстати, Юля всё ещё здесь.
