# Д6-посещение пляжа после допроса Шурика на тру-ветке
#
# используется флаг попадания мячом в голову Ульянке в Д1 alt_headshot
#
label alt_day6_true_beach:
# Приходим на пляж, там уже все пионеры, у кого есть спрайты в купальниках/плавках (Голого Эла не пускать)!
# С тоской мечтаем искупаться (шесть дней не мылся!), но без плавок это затруднительно. Выслушиваем шуточки Шизы.
# Внезапно обретаем плавки. Откуда - хер его знает. Может быть, МТ утром выдаст после побудки?
# Радостно купаемся и вылезаем на берег. Блестя чистым телом, усаживаемся в тени навеса, опершись спиной о столбик с целью обдумать умные вещи, услышанные в медпункте.
# Думать не получается. Во-первых, ГГ вообще хорошо, а во-вторых всё время отвлекают попадающиеся на глаза девочки с соблазнительными формами.
# play sound sfx_soccer_ball_kick
# Мяч, пущенный Ульяной, прилетает прямо в голову. Разумеется, нечаянно. Искры из глаз.
if alt_headshot
    # В Д1 обидели Ульяну мячиком. Она мстит, и мстя её страшна!
else:
    # Абидна, слушай!
# Присутствующие реагируют по большей части без особого сочувствия.
# На девочек смотреть больше не хочется. Умные мысли тоже все из головы повыбивало.
# Одеваемся и понуро бредём прочь, куда глаза глядят. Вскоре высняется, что глаза глядели на пристань. Не успеваем устроиться в гордом одиночестве и посокрушаться о горькой судьбе, как звучит горн.
# Идём обедать.