# Д6-левая ветка, карьер.
# План-набросок-черновик
#
label alt_day6_uvao_left_UN_sandpit:

# сцена - карьер.
# концовка предыдущего фрагмента:
    # "...и вдруг очутился на открытом пространстве, большую часть которого занимал солидных размеров песчаный карьер."
    # "Лес с этой стороны подходил почти вплотную к карьеру. Некоторые особо неудачливые деревья, накренившись, балансировали на самом краю, отчаянно хватаясь обнажёнными корнями, как растопыренными пальцами, за ненадёжный воздух. {w}Чувствовалось, что участь их предопределена - пройдут год или два, дожди ещё немного подмоют непрочную песчаную стену..."
    # "Лена была здесь, куда-то пробираясь по-над краем. Прячась за деревом, я наблюдал, как она подошла к группе особняком стоящих сосен и замерла перед ними неподвижно."
    
### возможно, здесь фоном пустить memories_piano
    "Потом медленно подошла ближе к деревьям, переходя от одного к другому и зачем-то осматривая стволы. {w} Перед некоторыми она останавливалась, касаясь их рукой."
    "Наконец она остановилась перед одним и вдруг воровато огляделась по сторонам."
    "Я вжался в шершавую кору ствола, разом вспотев от мысли, что теперь-то она меня точно заметит..."
    th "Уф, пронесло!"
    "Немного повозившись, Лена достала из кармана что-то, блеснувшее на солнце, и близоруко наклонилась к стволу."
    th "Что она там делает?"
    "Не в силах устоять перед любопытством, я выбрался из своего укрытия и понемногу начал подбираться поближе к полностью сосредоточившейся на своём занятии пионерке."
    th "Точно, вырезает что-то на стволе."
    "Осмелев, я подошёл совсем близко."
    # сцена - рощица с сердечками.
    "Отсюда мне уже были видны характерной формы разнокалиберные метки на других стволах."
    th "Неужто эта нелюдимка тоже решила свой вклад внести?"
    stop music fadeout 1 #или 0. Чтобы резко
    # притушить ambience до 60%
    #show un scared pioneer far
    with hpunch
    "...Оглушительно треснула под ногой сухая ветка, и Лена испуганно обернулась."
    "Ойкнув, она поспешно спрятала за спину вновь блеснувший на солнце перочинный ножик и попятилась."
#    dreamgirl "Поздравляю, Шерлок, нас заметили. Что делать будешь?"
    me "Э-э-э... да... {w}Привет."
    "Не сводя с меня широко раскрытых глаз, девочка сделала ещё шаг назад."
    me "Я вот... {w=1.0}кхм... {w=1.5}как раз шёл... Случайно шёл мимо..."
    "Ещё пара шагов назад."
    me "А тут как раз ты, так удачно... {w=1.5}Я хочу сказать, как раз хотел поговорить с тобой... ну, знаешь..."
    "Я понимал, что несу какую-то чушь, но не мог остановиться."
    "Тем временем Лена, словно зачарованная, не отводила от меня взгляда и понемногу продолжала пятиться..."
    "Меня вдруг прошиб холодный пот - я понял, что до края обрыва ей осталась пара шагов."
    me "Лена! Осторо..."
    "Словно кто-то ударил наотмашь огромным иззубренным лезвием - землю прямо перед носками сандалий девочки рассекла чёрная рваная трещина."
    "С нарастающим шуршанием край обрыва обманчиво плавно двинулся вниз, всё быстрее и быстрее, Лена ахнула, взмахнула руками, пытаясь удержать равновесие..."
    #hide un easeoutdown
    "Вскрик девочки вывел меня из секундного ступора. {w}Рванувшись, я одним прыжком покрыл разделявшее нас расстояние - как раз, чтобы упав на колени, успеть поймать слепо хватающуюся за траву руку."
    "Всегда такая надёжная земля вдруг мягко дрогнула подо мной, подалась вниз, заставляя сердце пропустить удар."
    "Свободной рукой я, точь-в-точь как Лена секунду назад, зашарил позади себя в тщетной попытке найти несуществующую опору."
    "Я ещё успел ощутить, как сильные тонкие пальцы оплели вдруг моё запястье."
    #ЛБ: поиграться с blink-unblink и vpunch. Возможно - разом двинуть вверх весь фон, заменяя снизу чёрным.
    #ЛБ: поиграться со звуками - на секунду-другую приглушить в ноль одновременно с затемнением.
    # сцена - нечто желтоватое не в фокусе
    "Падение закончилось как-то внезапно - вот только что я летел, не разбирая где верх, а где низ, и вот уже отплёвываюсь, пытаясь понять, все ли части моего полузасыпанного песком тела на месте."
    dreamgirl "И стоило так психовать? Можно подумать, никогда с пацанами с верхотуры в песок не прыгал."
    dreamgirl "Ладно, докладываю: посадка прошла успешно, серьёзных травм нет. Полагаю, с обеими твоими попутчицами тоже всё в порядке."
    th "Почему обеими? Что за... {w}Ох, чёрт!"
    "Я сел, освобождаясь от остатков засыпавшего меня песка."
    # сцена - карьер снизу
    show un surprise pioneer at right with dissolve2
    "Справа от меня невнятно всхлипывала Лена, пытаясь протереть глаза. Слева..."
    show uv sad at left with dissolve2
    "Слева на куче песка сидела очень недовольная Юля, отчаянно трясущая головой."
    uv "Песок в уши набился. Терпеть не могу."
    "Пояснила она брезгливо, встретив мой взгляд."
    show un surprise pioneer with dissolve
    "Лена наконец справилась с попавшим в глаза песком, да так и замерла, уставившись на Юлю с открытым ртом."
    "Тем временем хвостатая принялась деловито вытряхивать песок из своих пышных каштановых волос."
    me "Юля, ты-то здесь откуда?"
    uv "Оттуда. Ты же падал. Я помочь хотела."
    "Она обвиняюще ткнула в меня пальцем."
    uv "Ты зачем упал?"
    th "Зачем, зачем! Нарочно, блин, для удовольствия!"
    "Я передёрнул плечами, поднимаясь на ноги."
    me "Ну так я тоже помочь хотел. {w}Вот ей, Лене, она первая падать начала."
    "Я кивнул на продолжавшую молча таращить глаза Лену."
    "Юля исподлобья глянула на неё и надула губки."
    show uv dontlike with dissolve
    uv "От тебя одни неприятности! То мне мешаешь, то Семён из-за тебя падает!"
    show un normal pioneer with dissolve
    un "Я тебя знаю."
    "Подала вдруг голос девочка. Она резко встала и сделала шаг ко мне, не сводя глаз с Юли."
    un "Я тебя знаю!"
    "Повторила она звонко."
    th "Вот! Точно! Где-то они успели пересечься!"
    show un angry pioneer with dissolve
    un "Ты... Ты плохая!"
    "Взвизгнула Лена."
    "Она вдруг схватила меня за руку так резко, что я едва не упал."
    un "Семён, она плохая, она опасна!"
#    show uv angry with dspr
    "Юля упруго полуприсела, оскалившись, и по-кошачьи зашипела."
    #возможно, быстрый визуальный эффект при попытке воздействия. Например, быстрое забеление экрана и обратно. Сопроводить загадочным (но не тем, который страшный!) звуком.
    "Словно на мгновенье приоткрылось невидимое окно прямо в жгучую зимнюю стужу, и ледяное дуновение скользнуло мимо моего лица."
    "Лена вхлипнула, пошатнувшись, на секунду хватка её пальцев ослабла..."
    "...но прежде, чем я успел что-нибудь понять, она уже стояла прямо передо мной, загораживая от Юли."
    un "Уходи! {b}Не отдам!{/b}."
    "Волосы на голове Юли встали дыбом."
    uv "Неправильная!"
    "Прошипела она и, оскалившись ещё сильнее, прыгнула на Лену."
    # with hpunch
    "В доли секунды Лена отскочила в сторону, резко оттолкнув меня в другую."
    # with vpunch
    # звук bodyfall
    "Не ожидая от тихой хрупкой девочки такой прыти, я не удержал равновесия и мешком повалился на песок."
    "Для Юли случившееся тоже стало неожиданностью."
    "С разгону проскочив между нами, она резко остановилась, взметнув облако песка, и развернулась к сопернице."
    "Противницы напряжённо замерли друг напротив друга на пару секунд, потом Юля медлено двинулась боком по широкой дуге. {w}Лена зеркально повторила её манёвр, сохраняя дистанцию."
    me "Эй, вы что?"
    "Мой собственный голос прозвучал неожиданно жалко. Неудивительно, что дамы и ухом не повели, продолжая сверлить друг друга взглядом."
    th "Да что это со мной? Тварь я дрожащая, что ли?"
    "Возмутился я, резко вставая и делая шаг вперёд."
    me "А ну..."
    # Визуальные эффекты на тему "мир кувыркнулся." Наверное, rotate сделать вокруг нижней части экрана
    # звуковым эффектом пустить затихающий звон-свист в ушах. кажется, что-то в библиотеке есть
    # сцена - нечто желтоватое не в фокусе
    "Пришёл я в себя от того, что меня настойчиво тормошили и причитали на два голоса."
    "И опять - лицом в песок."
    th "Кажется, меня снова приложили по голове. {w}Правда, на этот раз не мячом."
    un "Сенечка, ты живой?"
    "Спросил дрожащий голос Лены. Меня в четыре руки перевернули и помогли сесть."
    # сцена - всё тот же карьер снизу, испуганные uv и un
    me "Пополам..."
    "Невнятно произнёс кто-то моим голосом."
    # show uv удивлённая
    # show un удивлённая
    uv "Чего?"
    me "Как хорошо, что пополам..."
    "Упорно повторил мой голос."
    # show un испуганная
    un "Что? Что пополам?! {w}Сенечка, где у тебя болит?"
    me "Эм-Вэ-квадрат пополам."
    dreamgirl "Знаешь, если подумать, то ведь движущихся масс ведь две участвовало в столкновении, так что делитель сокращается. {w}Кстати, а с какого перепугу тебя вообще на физику потянуло?"
    me "Тьфу!"
    "Я наконец выплюнул в который раз за день набившийся в рот песок и попытался произвести подсчёт потерь."
    "В принципе, ничего особенного. Кружилась ушибленная в очередной раз голова, да кожа на плече была как следует расцарапана от рукава до локтя чьими-то не в меру изящными ногтями."
    th "Чем это они меня по голове так приложили? Коленом, что ли, да с двух сторон?"
    "Я с некоторой опаской посмотрел на продолжающих меня бережно поддерживать девушек."
    "Те зверски косились друг на друга, но драться пока больше не собирались, вроде бы."
    "Хвала рандому, кажется, и для них недолгая схватка обошлась без серьёзных травм, разве что обе были изрядно растрёпаны, да у Лены на щеке блеснула алыми бусинками крови тонкая царапина."
    un "Семён, прости меня, прости, я нечаянно! Я бы никогда!"
    "Простонала Лена со слезами на глазах."
    uv "Семён, я нечаянно! Это всё из-за неё!"
    # show un позлее (нет, не evil!)
    un "Что? Да если бы не ты..."
    me "ТИХО!"
    # show un, uv испуганные или удивлённые
    "Заорал я что было мочи, увидев, что Юля вновь обнажила зубы, а глаза её опасно блеснули."
    me "Кровопролития не допущу!"
    "Рявкнул я уже потише - от крика заныла сильнее голова."
# Вилка, где всех запутываем с выбором
    menu:
        "Лена, прекрати!":
            "Юля мне зла не желает! И тебе тоже!"
            "А ты, Юля, зачем бросаешься? Что тебе Лена плохого сделала?"
        "Юля, остановись!"
            "Лена, ты достала уже! Что, совсем с катушек съехала?!"
        # Окончательно обижаем Лену, далее на катапульту
        # как вариант выхода - уходит с Юлей, а Лена остаётся с отчаянием в глазах.
        # Через некоторое время Юля вдруг проявляет сильное беспокойство, демонстрирует болезненное состояние и т.п.
        # Возможно, Шиза ещё успевает сказать про "говорили же тебе про эмоциональный фон!", после чего следует катапульта в тонущий автобус.
        # Эдакий толстый намёк для внимательных, что Лена с горя испортила-таки фон настолько, что прокол схлопнулся.
        #
        # Словом, здесь jump в тонущий автобус
        # КАТАПУЛЬТА

    "Кажется, мой окрик смутил девушек. Обе обиженно надули губки и синхронно уставились в землю."
    th "Ничего, сами виноваты. Устроили тут гладиаторский поединок, понимаешь."
    dreamgirl "А что тебе не нравится? Ты посмотри, какой антураж!"
    dreamgirl "Ну же, вспоминай, на что это похоже? Песчаная арена, зверь и воин. {w}У тебя тоги нет с собой?"
    dreamgirl "Под жарким солнцем прекрасные амазонки сходятся на арене Колизея в смертельной схватке, победителем из которой выйдет выжившая. {w}Она-то и заберёт себе в единоличное пользование драгоценный приз."
    dreamgirl "Ну про приз ты и сам догадался, не маленький."
    th "Некоторые вещи не меняются. И ты из их числа."
    me "Ну что вы, в самом деле! Неужели обязательно надо было{w}... Ай!"
    "Не удержался я от оха, ощупывая новую шишку на своей многострадальной голове."
    un "Сенечка!"
    "Немедленно встрепенулась Лена."
    dreamgirl "Ах, голова! {w=2.0}Голова! Оторвали! {w=2.0}Я умира...кха-кха! Отдайте всё..."
    un "Сенечка, у тебя кровь! Тебе больно?"
    "Продолжала тем временем волноваться Лена."
    un "Тебе к врачу надо!"
    dreamgirl "Единственное, что может спасти смертельно раненного кота, — это глоток бензина."
    "От неожиданности я невнятно хрюкнул, с трудом удержавшись от смеха, и смущённо покосился на Лену, но та восприняла всё по-своему."
    un "Сенечка, тебе плохо?!"
    "Схватила она меня за плечи, чуть не плача."
    un "Пожалуйста, не молчи!"
    th "Стоп. {w}Это же очевидно."
    th "Во-первых, надо увести отсюда Лену, пока они снова не подрались."
    th "Во-вторых, надо Лену отвести в лагерь, к Виоле, и сдать ей с рук на руки. {w}Виолетта наша Церновна явно не какая-то там простая медсестра, а человек с {i}образованием{/i}, разберётся получше меня, как быть дальше."
    me "Кха... Ох-х..."
    "Простонал я, снова хватаясь за голову."
    me "Я в порядке..."
    "Продолжал я слабым голосом, скорчив страдальческую гримасу."
    me "Лена, давай... просто тихонечко дойдём до медпункта. {w}Что-то голова кружится..."
    me "Юля, ты не волнуйся, меня никто не обидит, и вообще, ты меня спасла. {w}Я только к доктору схожу, голову вот ушиб немножко. {w}Давай завтра увидимся, ладно?"
    "Сказал я Юле, которая смотрела на меня с явным недоумением, если не сказать - с подозрением."
    th "Чёрт, неужели она меня раскусила? Почувствовала, что я симулирую?"
    "Впрочем, Юля, секунду помявшись, подтвердила неохотно:"
    uv "Да, это плохо, когда голова болит."
    uv "Ты отведёшь его к этой, в белом халате? К Виоле, вот!"
    "Непринуждённо обратилась она к Лене без малейших следов враждебности в голосе."
    uv "Она всех лечит, я знаю."
    "Дождавшись неохотного кивка головой, Юля забавно дернула ушами и неожиданно улыбнулась."
    uv "Ну тогда я пойду!"
    "Пара секунд, и её хвост мелькнул где-то на дальнем конце карьера."
    "С исчезновением Юли Лена с видимым облегчением перевела дух и вытащила из кармана тщательно отглаженный носовой платочек."
    un "Дай я тебе царапину сначала от грязи очищу немного, а то мало ли, что туда могло попасть."
    me "Подожди, ты ведь тоже поцарапалась!"
    "Запротестовал было я, но Лена только отмахнулась."
    dreamgirl "Вот это я понимаю, забота! Цени!"
    # сцена - ближняя тропинка в лесу, хотя должна быть грунтовая дорога
    "Выбравшись из карьера по полуразмытой дождями насыпи для техники, мы побрели по грунтовой дороге куда-то в сторону лагеря."
    "Лена вела себя неожиданно деловито. Аккуратно поддерживала меня под локоть, пару раз спрашивала, не слишком ли быстро мы идём, сильно ли у меня голова кружится, не надо ли передохнуть, но всё это без назойливости."
    "Обращали на себя внимание разве что её бледность, да то, что она старательно избегала смотреть мне в глаза."
    "Я в меру способностей изображал раненого - плёлся нога за ногу, страдальчески полузакрыв глаза и слегка пошатываясь время от времени."
    "Мне, если честно, было немного неловко морочить девочке голову - кажется, она искренне за меня беспокоилась."
    "Мысль эта меня неожиданно озадачила."
    th "Уж не заболел ли я часом? Мне, сетевомму троллю восьмидесятого уровня - и стыдно оттого, что я немного обманул эту девочку?"
    th "Даже не обманул, а так... преувеличил слегка."
    th "Причём, что характерно, сделал это не ради своей выгоды или развлечения, а для её же пользы - и всё равно мне не по себе."
    dreamgirl "Ну во-первых, это тебе не на форумах хомячков троллить. Здесь нельзя укрыться за иллюзию иллюзорности происходящего, уж прости мне тавтологию."
    dreamgirl "Прямой контакт, лицом к лицу. Сделай человеку больно, обидь его - и отдачей по тебе же ударит, когда увидишь его глаза."
    dreamgirl "Так что твоей минутной слабости могут быть разные объяснения, но в конечном итоге все они сводятся к одному - возможно, ты не такая уж циничная скотина, какой стараешься сам себе казаться?"
    #ещё буквы про ГГ - не совсем скотина, маска, отгородиться проще всего
    "Мы миновали облупившиеся железные ворота в ограде лагеря, когда Лена вдруг нерешительно остановилась."
    # un смущённая
    un "Семён, ты как всё-таки себя чувствуешь?"
    dreamgirl "Ах, похороните меня за плинтусом!"
    me "Нормально. {w1.5}Всё... ох... хорошо."
    "Пробормотал я."
    un "Я хочу сказать, здесь уже недалеко, но... как ты думаешь, сможешь сам дойти до медпункта?"
    un "Если не уверен, давай я за подмогой сбегаю, я быстро!"
    me "Да нормально со мной всё, говорю же."
    "Отрезал я. Нелепая комедия с больным мной в главной роли начинала уже надоедать."
    "Я давно бы уже бросил всё и свалил подобру-поздорову, если бы мог придумать, как иначе доставить девочку к Виоле."
    me "Мне уже лучше, и голова меньше болит. Дойду я своим ходом, не волнуйся. {w}Просто подстрахуй меня на всякий случай - и всё, ладно?"
    "Лена покорно кивнула, но, помявшись немного, всё-таки добавила:"
    un "И ещё... Ты весь грязный, а нам через пол-лагеря идти."
    un "Может быть... давай почистимся немного?"
    "Я бросил взгляд на свою одежду и невольно скривился."
    "Видок у меня определённо был тот ещё. Создавалось впечатление, что я провёл в злополучном карьере не меньше недели, причём всё это время передвигался исключительно ползком."
    th "И ведь что удивительно, сама-то Лена и не испачкалась совсем, хотя в песке мы поровну барахтались. Как только сумела. {w}Одно слово, девчонка."
    me "Да, ты права, в таком виде я по лагерю недалеко уйду."
    "Я наклонился, попытавшись отряхнуть шорты, но Лена остановила меня."
    un "Подожди, я помогу. Ты вот всё храбришься, а случись что, я тебя не дотащу ведь, так что стой спокойно."
    "Решив, что чем меньше мы будем спорить, тем быстрее доберёмся до медпункта, я послушно выпрямился и кивнул."
    "По-прежнему упорно не глядя мне в глаза, девочка принялась отряхивать от песка мою рубашку, мгновенно зардевшись от смущения."
    th "Ну-ну, это ещё что. Посмотрим, как ты мне шорты чистить будешь."
    "Попытался я сыграть циника, чувствуя, что смущение девочки мгновенно перекинулось на меня."
    dreamgirl "Эй, это была моя реплика!"
    "Впрочем, до шортов дело не дошло."
    play music music_list["confession_oboe"] fadein 5
    "Лена вдруг громко всхлипнула, и не успел я опомниться, как она уже вовсю ревела, уткнувшись лбом мне в плечо."
    th "Ох, блин! Теперь что ещё?"
    "Преодолевая острое желание бросить всё и сбежать, я осторожно погладил девочку по спине."
    me "Ну-ну, всё хорошо, ну что ты, в самом деле..."
    "Бормотал я ей на ухо, безуспешно пытаясь сообразить, что делать дальше."
    "Впрочем, Лене довольно быстро удалось взять себя в руки - во всяком случае, наводнение лагерю больше не грозило."
    "Всхлипнув ещё разок напоследок, она подняла ко мне мокрое от слёз лицо."
    un "Из-звини. Я так испугалась, что ты... что с тобой... когда ты упал..."
    "Она беспомощно прикусила нижнюю губу, словно боясь расплакаться снова."
    dreamgirl "Вот это я понимаю, забота!"
    dreamgirl "Конечно, за тебя она испугалась, а что сама с обрыва вверх тормашками летела впереди всех - уже и неважно."
    "Тут вдруг до меня дошёл простой, совершенно недусмысленный факт - мы с Леной стоим в обнимку."
    "Вернее, я-то лишь неуклюже пытался поглаживать её по спине правой рукой..."
    dreamgirl "Кстати, у тебя две руки. Обрати внимание на левую."
    th "Так, окей, левая рука лежит у девушки на плече, хотя в упор не помню, когда... Впрочем, неважно."
    th "Что прикажешь делать с тем, что она-то меня обнимает самым недвусмысленным образом?"
    dreamgirl "Она тебя обняла сразу же, как расплакалась. И ещё она к тебе прижимается, не замечаешь?"
    "Я попытался было отстраниться хоть немного, но тело словно онемело."
    dreamgirl "Да ладно, неужели тебе неприятно?"
    dreamgirl "Впрочем, не обольщайся слишком на этот счёт. Сдаётся мне, что обняла она тебя неосознанно, сама этого не заметив."
    # show un shocked или как-то так
    dreamgirl "А вот теперь - заметила!"
    "Впрочем, по широко распахнувшимся вдруг глазам и разом одеревеневшей под моей рукой спине девушки догадаться об этом было нетрудно."
    "В каком-то ступоре я наблюдал, как бледное лицо, замершее прямо перед моим, заливает краска - сначала щёки, потом лоб, виски, даже кончик носа."
    "Кажется, я вовсе не дышал в этот момент, но мне вдруг показалось, что от волос Лены пахнуло еле различимым терпковатым запахом дёгтя."
    "Терпковатый запах мгновенно потянул за собой странные, едва уловимые образы - какой-то парк, осенняя листва под ногами, звонок трамвая - да это же мой Питер!"
    #смена музыки без перехода!
    play music music_list["that_s_our_madhouse"] #или i_want_to_play
    # show us grin pioneer far at fleft with easeinleft
    # show un scared pioneer 
    us "А!!! Вот ты где!!!"
    # show un ### pioneer at right with dspr
    "Лена моментально очутилась в метре от меня."
    us "Я везде бегаю, ищу его, чтобы мяч вместе погонять, а он тут ОБНИМАЕТСЯ!"
    "Фыркнув, Ульяна бросила взгляд на нашу одежду и авторитетно констатировала:"
    # show us нейтральное или недовольное
    us "Ещё и в карьер прыгали. {w}БЕЗ МЕНЯ!"
    "Ульяна возмущённо топнула ногой, но тут же сменила гнев на милость."
    # show us восхищённое
    us "А я-то думала, у вас со Славкой ширли-мырли, а тут такое!"
    us "Так оказывается, у тебя с Ленкой тили-тесто!"
    "Она восхищённо тряхнула головой и вдруг ткнула в меня пальцем."
    # show us # фейс в стиле дядюшки Сэма с плаката
    us "Или наш пострел везде поспел, а? Признавайся, донжуан несчастный!"
    menu:
        "Ульяна, да ты посмотри на меня!":
            pass
        "Глупее ничего придумать не могла?":
            "Да что здесь, с ума все посходили?!"
            # show испуганных девочек
            "Рявкнул я, не выдержав."
            # В припадке раздражения ГГ обижает Ульяну, потом до кучи - Лену. Мечтает оказаться где угодно, лишь бы его оставили в покое.
            # По щучьему велению катапультируемся на нейтрал ("всего лишь сон")
            # КАТАПУЛЬТА
            
    me "Какие ширли, какие тили?! Хорош донжуан, нечего сказать!"
    "Я демонстративно развёл руками, давая полюбоваться на перепачканный в песке наряд."
    me "Вовсе мы не обнимались, а просто... {w}И при чём вообще здесь Славя, если на то пошло?"
    # show us dontlike
    us "Ну как же, активистка тебя полдня ищет везде по всему лагерю, всех уже замотала расспросами, не видел ли кто-нибудь её драгоценного Семёна. {w}Хотя..."
    "Она посмотрела на меня с прищуром."
    us "Ну-ка, повернись!"
    me "Что? Это ещё зачем?"
    us "Повернись, кому говорю!"
    "Видя, что я не трогаюсь с места, Ульяна снова фыркнула и обошла меня по кругу, скептически хмурясь. Я завертел головой, на всякий случай стараясь не выпускать её из поля зрения."
    # show us #скептическое
    us "Да-а-а, ты прав. Вряд ли ты такой кому-то можешь понравиться."
    "Обречённо резюмировала она наконец со вздохом."
    "Покосившись на Лену, которая всё это время молча стояла в стороне, она покачала головой."
    us "Ох, неужели через пару лет я тоже дурой стану?"
    "Припечатав словом, как печатью, она хмыкнула и была такова."
    hide us with easeoutleft
    un "Каждому своё. Мне вот понравился."
    "Не поднимая глаз, произнесла Лена негромко, но совершенно отчётливо."
    dreamgirl "Протяни руку."
    th "Что?"
    dreamgirl "Протяни руку и возьми."
    dreamgirl "Ты понял меня, не притворяйся. {w}Давай же, ну!"
    "Лена, которая словно прислушивалась к чему-то ей одной слышному, негромко вздохнула, по-прежнему глядя в землю."
    un "Ладно, пойдём."
    "Чудесным образом на её лице уже не было и следа недавних слёз, разве что покрасневшие глаза её выдавали, да слегка припухшие веки."
    "Лена вновь было принялась отряхивать рубашку, но почти сразу махнула рукой."
    un "Знаешь, я сдаюсь. Без щётки здесь не обойтись никак, а по-хорошему - лучше в стирку сразу."
    me "Ничего страшного, доберёмся огородами, только-то и всего."
    "Заторопился я, стараясь не думать о том, чего сейчас должны стоить этой девочке нейтрально-отстранённое лицо и спокойный голос."
    me "Я себя гораздо лучше чувствую, честное слово!"
    me "Здесь ведь наверняка есть какие-нибудь потайные тропы, где можно обойти людные места, да?"
    "Лена слегка кивнула."
    un "Пойдём."
    "Повторила она и, опустив плечи, сама пошла вперёд."
    "По дороге, глядя в обречённо ссутулившуюся спину, я несколько раз пытался заставить себя заговорить с девочкой, но так и не решился."
    "Умом я понимал, что надо попытаться расспросить её, получить хоть какую-то информацию о том, откуда они с Юлей знают друг друга. {w}Но не мог себя заставить после того, что она сказала."
    "Просто не мог."
    "Лена тоже шла молча. Она то и дело оборачивалась, проверяя, всё ли со мной в порядке, но при этом упорно старалась не встречаться со мной взглядом."
    # сцена - медпункт снаружи вечером
    "Уже вечерело, когда мы, так никого и не встретив больше по дороге, кустами вырулили к медпункту."
    "В дверях я замешкался было, пропуская Лену, но та решительно подтолкнула меня вперёд."
    # сцена - медпункт изнутри вечером
    "Виолетта оторвалась от экрана компьютера, на котором красовался полузаполненный стакан \"Тетриса\" и несколько секунд с интересом изучала нас с Леной поверх очков."
    cs "И чем же, {i}пионеры{/i}, вы таким экзотическим занимались {i}вместе{/i}, что теперь вам двоим понадобилась медицинская помощь?"
    "Наконец промурлыкала она сладким голосом. Потом продолжила, растягивая гласные:"
    cs "Хотя, судя по вашему виду... Но вы уже и сами поняли, что песок - для {i}этого{/i} не лучшее место, да?"
    cs "Впрочем, если вы не слишком затянули с визитом..."
    un "Ч-что?{w} Н-не-е... М-мы не... {w=2.0}Н-не то, что Вы п-п..."
    "Лена жарко покраснела и уставилась на носки своих сандалий, несомненно мечтая сейчас об одном - провалиться сквозь землю."
    "В другое время я и сам вволю посмущался бы в такой ситуации, но сейчас мне было не до шуточек Виолы."
    me "Ой, Виолетта Церновна, ну что Вы такое говорите! Просто мы упали с обрыва и немного поцарапались, вот и всё!"
    "Поспешил я перехватить инициативу, ухватив окончательно отморозившуюся девочку под локоток и увлекая её к кушетке."
    "Одновременно я корчил Виоле дикие рожи и закатывал глаза в надежде, что это её наведёт на мысли о проблемах с головой{w}, причём - не только у меня."
    me "Мы, понимаете, упали втроём в карьер - Лена, я и Юля - и поцарапались. {w}Очень может быть, что Лену именно Юля и поцарапала, когда они подрались."
    un "Ч-что?.."
    cs "Как?.."
    "Но я продолжал тараторить, не давая никому и слова вставить, одновременно усаживая Лену и сам садясь рядом на всякий случай."
    me "Я уверен, ничего серьёзного, но мало ли что там у неё на ногтях могло быть, рук-то она не моет."
    me "Вполне могло получиться, как вчера, с тем пионером. {w}Я даже уверен, что так и вышло."
    "Выпалив всё это без остановки, я развёл руками."
    me "Вооот."
    un "Семён головой ударился, у него сотрясение, наверное..."
    "Пролепетала Лена слабым голосом, не поднимая глаз."
    cs "Так, ну что же, всё ясно."
    "Кивнула Виолетта и внезапно пришла в движение."
    cs "Вот только столбняка ещё нам не хватало!"
    "Заявила она решительно, извлекая из стола металлическую корбочку стерилизатора и какие-то ампулы."
    cs "Со всем остальным мы тоже разберёмся, но столбняк, чтобы вы знали, относится к тем самым болезням, которые совсем нетрудно предупредить, но чрезвычайно трудно излечить, если время упущено!"
    "Солидно продолжала Виола, натягивая невесть откуда появившиеся перчатки и доставая из стерилизатора два стеклянных шприца."
    cs "В данном случае промедление воистину смерти может быть подобно!"
    "Сообщила Виола внушительно, обращаясь непосредственно к Лене. Та робко кивнула."
    cs "Вот и славно! Давай руку."
    "С нарастающим недоумением я смотрел, как медсестра протирает девочке сгиб локтя и точным уверенным движением вонзает иглу в вену."
    th "Что за ерунда? Было дело, кололи противостолбнячную - так её же подкожно полагается, вроде бы?"
    "Впрочем, я счёл за лучшее помалкивать в тряпочку. Свою роль я уже сыграл и теперь от меня мало что зависело. Оставалось надеяться, что Виола сделала правильные выводы из моей пантомимы."
    "Безропотно подставив руку, я получил свои три кубика какой-то прозрачной жидкости в вену и клочок марли - прижимать к месту укола."
    cs "Сиди-сиди! Это новейшая противостолбнячная вакцина, но даже ей требуется некоторое время, чтобы подействовать."
    "Приказала Виола заёрзавшей было девочке. Та неслышно шевельнула губами и замерла на месте, ссутулившись и теребя подол юбки."
    cs "Организмы у вас молодые, неокрепшие, а погода жаркая, недалеко и до беды! Давайте я пока ваши ссадины обработаю."
    "Вещала Виолетта, суетясь вокруг нас с перекисью водорода."
    #текст на весь экран
    "На этот раз она работала неторопливо, не пропуская ни царапинки, и говорила, говорила, говорила..."
    "За следующие пару минут я узнал массу важных и абсолютно мне неинтересных сведений о микроорганизмах, угрожающих здоровью и жизни несчастного, допустившего повреждение кожных покровов."
    "Потом слуховой центр мозга милосердно отключился, так что доносилось только монотонное \"бу-бу-бу\""
    "Лена, судя по слегка остекленевшему взгляду, тоже ощущала нечто подобное."
    th "Интересно, что за спектакль Виола разыгрывает? Явно ведь что-то затеяла."
    "Лениво думал я, вяло наблюдая, как тампон с перекисью водорода в третий уже раз проходится по одной и той же ссадине."
    "Что-то мягко ткнулось мне в плечо. Обернувшись к Лене я обнаружил, что она дремлет, привалившись ко мне."
    "Ещё минута - и девочка тихонько засопела, уютно устроившись у меня на плече."
    "Виолетта, монотонно бубнившая что-то про устойчивость синегнойной палочки к антибиотикам, прервалась на полуслове."
    #долой полноэкранный.
    cs "Кажется, подействовало."
    "Сказала она негромко уже нормальным голосом."
    cs "Помоги-ка мне."
    "Вместе мы уложили Лену всё на той же кушетке. Та пробормотала что-то, но не проснулась."
    "Пока Виола проверяла девочке пульс, ослабляла галстук и укрывала её, я прислушался к своим ощущениям."
    "Сейчас, когда медсестра прервала свою импровизированную лекцию, сна у меня не было больше ни в одном глазу."
    cs "Тебе я ввела физраствор, только-то и всего."
    "Ответила Виола на мой молчаливый вопрос, усаживаясь за столом и кивнув на свободную кушетку."
    cs "А теперь, {i}пионер{/i}, садись, будь так любезен, и рассказывай очень подробно. Надеюсь, я не зря потратила на эту пионерку дозу препарата - за который мне потом придётся отчитываться, между прочим!"
    
# Здесь микровилки по флагам от утра Д7 на общую тему "Я рассказал о произошедшем на карьере и заодно поделился своими подозрениями насчёт Лены."
# Здесь микровилки по тем же флагам на тему "ВЦ задумчиво покивала головой." "Ну да, ну да, очень похоже, что..."
# ВЦ говорит ГГ, что тот в итоге всё правильно сделал, но упрекает, что тот не пошёл сразу к ней, поделиться своими подозрениями.
# "Перед концертом, говоришь, с Юлей общался? Вот и пошёл бы сразу ко мне. Привели бы потихоньку Лену в медпункт, поговорили бы спокойненько..." - "Хорошо, в следующий раз так и сделаю"
# Одним словом, обыгрываем развитие сюжета в левом медпункте, если бы всё прошло тихо-гладко, без беготни и без Юли с котлетами.
# ВЦ: "А не пойти ли тебе куда-нибудь отсюда? За Леной я присмотрю, молодец что привёл, а сам иди. На дискотеку иди, вот! Штаны почисти только, и иди."
# Возможно, прикажет заодно найти и прислать ОД - надо её с дискотеки нейтрализовать.
# ГГ с нашлёпкой пластыря на руке (возможно, слегка раздосадованный, что прогнали, но всё-таки довольный, что сбагрил Лену с рук долой), идёт умываться, потом в домик - чиститься, потом как раз и дискотека начинается, где уже рыщет Славя.
# ### Весьма вероятно, что почистившийся Сэм зависнет где-нибудь в одиночестве на какое-то время, чтобы убить время. Услышав звуки дискоткеи, слегка опоздает на неё для унификации текста с выходом из левого медпункта.
