label alt_day6_uvao_prufung_sl:
    scene bg ext_stage_big_day
    "Со сцены ещё издалека доносилось странное копошение - последние приготовления к концерту были в самом разгаре."
    "Какая-то малышня толпилась у первого ряда скамеек, разодетая в старые жёлтые костюмы, повидавшие не одну смену. Кажется, изображали они утят."
    "Мимо меня прошагал с крайне озадаченным видом взмыленный Электроник со странной тяжеленной бандуриной в руках, завёрнутой в плотную тряпку."
    th "Он что? Тоже в этом священнодействии собрался участвовать? Или как дармового переносчика тяжестей привлекли?"
    "Проводив его взглядом до самой сцены и прикинув, что же именно он мог так бережно нести, я наконец увидел и того, за кем пришёл сюда."
    scene bg ext_stage_near_clear
    "Славя с явно недовольным видом о чём-то активно спорила с Мику."
    show mi upset voca far at cleft with dissolve
    show sl angry pioneer far with dissolve
    sl "Ты ведь понимаешь, что Ольга Дмитриевна это так не оставит. Делай как знаешь - но я тебя предупредила."
    mi "Славичка, ну дай мне хоть раз за три недели одеться, как я хочу!"
    "Я недоумённо пригляделся и, наконец, обратил внимание на сине-зелёное обтягивающее платье Мику."
    "Конечно, для моего времени в нём нет ничего необычного, но сейчас оно смотрелось явным перебором по местным пуританским нравам."
    show mi dontlike voca far at cleft with dissolve
    mi "Это же специальное, сценическое. Нельзя же выступать как клуша!"
    "Взгляд Мику был по-детски обиженным: что-что, а свои экстравагантные наряды, она, похоже, очень любила."
    "Чувствуя, что этот балаган может быть бесконечным, как и все споры о морали, я всё-таки решил подать голос:"
    me "Славя. Можно тебя?"
    "Лицо блондинки словно просияло. Она в два шага подлетела ко мне и возбуждённо затараторила."
    show sl laugh pioneer with dissolve
    sl "Ты что-то хотел, Сёмушка?"
    show mi normal voca far at cleft with dissolve
    sl "Что-то случилось или тебе что-то нужно? Ты говори скорее."
    me "Славя, я это..."
    show sl smile2 pioneer with dissolve
    sl "Или ты не знаешь где сесть? Я уже нам заняла места - там хорошо видно. Хочешь, провожу?"
    dreamgirl "Опять двадцать пять. Заткни её и как можно быстрее."
    dreamgirl "Сил моих нет этих «Сёёёёмушек» слушать."
    "Набрав побольше воздуха в грудь, я медленно произнёс, чеканя каждое слово:"
    me "Славя, прекрати. Нам нужно серьёзно поговорить. Отойдём."
    show sl sad pioneer with dissolve
    "Славя растерянно тряхнула своими длиннющими косами и недоумённо спросила:"
    sl "К-куда?"
    sl "Ты видишь - я же занята сейчас, Сёмушка."
    show sl smile pioneer with dissolve
    "Впрочем, она тут же вернула свою фирменную улыбочку на место."
    sl "Давай после концерта. Ты ведь помнишь про наш разговор?"
    sl "Погуляем потом вместе и поговорим, о чём только захочешь."
    show sl smile2 pioneer with dissolve
    sl "Может и чем-то {i}важным{/i} займёмся..."
    #феффект 
    #который из? - Ленофаг
    me "Да прекратишь ты, наконец, или нет?!"
    show sl sad pioneer with dissolve
    me "Что сегодня с тобой такое?!"
    "Не дав сказать Славе и слова, я схватил её за руку и приказным тоном рявкнул:"
    me "Пошли, живее."
    show mi laugh voca far at cleft with dissolve
    mi "Какой нетерпеливый у тебя сегодня кавалер, Славичка."
    me "Мику, у тебя там концерт? Вот и занимайся."
    show mi sad voca far at cleft with dissolve
    "Я с ненавистью глянул на замолчавшую вдруг японку, отчего та сделала пару шагов назад, развернулся и потащил ничего не понимавшую Славю прочь от сцены."
    dreamgirl "А хорошо ты их уделал. Наконец-то ведёшь себя как мужик, а не половая тряпка!"
    dreamgirl "Встречайте - впервые на арене: типичный альфач, Семён «буйный психопат» Персунов."
    "В этой ситуации только этой проклятой шизофрении и могло быть весело."
    hide mi with dissolve
    scene bg ext_stage_big_day
    show sl sad pioneer with dissolve
    "Когда мы отошли уже на почтительное расстояние от сцены активисточка вырвала руку и взволнованно выпалила:"
    sl "Что происходит, Сёмушка?! Куда ты меня тащишь?!"
    sl "Да объясни ты хоть что-то уже!"
    me "Нет. Это ты прекрати Славя."
    me "Что это ещё за выходки? Что ты задумала?! Признавайся!"
    "Моё негодование, как снежный ком, сорвалось с вершины и, набирая силу с каждым словом, было способно раздавить любого кто попадётся ему на пути."
    show sl surprise pioneer with dissolve
    sl "К-какие в-выходки? О чём ты?"
    me "Не прикидывайся! Ты же не собака, чтобы бегать за мной, радостно виляя хвостом. Чего тебе от меня нужно?"
    sl "К-каким хвостом?"
    me "А как мне всё это понимать, по-твоему? Или ты сбрендила тут невзначай?"
    me "Почему это ты плакала вчера на пляже, а потом стала туман наводить своими вопросами?"
    if alt_uvao_true:
        if not alt_uvao_D6_CS_vetrov:
            me "А на кормёжке с чего вдруг такая приветливая была?"
        me "Я уже молчу про все эти похабные намёки на пляже про купание голышом."
    me "Ну и главный твой номер, прима балерина. Все эти «Сёёёёмушки» и «важные дела» за обедом."
    me "Не верю я тебе."
    me "Что ты со мной задумала сделать?! Чем я прогневал твоё кардинальское величество?!"
    "Сказать что Славя стояла ошарашенной - значит ничего не сказать. Её всю потряхивало, глаза уставились в пол, и чувствовалось, что ещё немного, и она будет готова разрыдаться."
    show sl tender pioneer with dissolve
    sl "Сёмушка, миленький мой, ты мне очень нравишься. Что мне сделать, чтобы ты мне поверил?"
    sl "У нас ведь так мало времени осталось. Вот я и решила..."
    "Она не закончила мысль. Было видно, что каждое слово даётся ей с большим трудом."
    "Настала теперь и моя очередь впадать в ступор. Не каждый ведь день услышишь такие признания от весьма привлекательной девушки."
    th "А вдруг я ошибся?... Может, она и не врёт?"
    dreamgirl "Да ты посмотри на неё! У неё же зрачки по пять копеек, как после здоровой дозы метамфетамина."
    dreamgirl "Сомневаюсь, что она вообще хоть как-то соображает, что говорит."
    sl "Сёмушка, вчера я поняла, что ты особенный. Что только ты мне и нужен, только с тобой я смогу всё..."
    sl "Но как нам быть вместе, если завтра уже расстанемся? Ты ведь такой замкнутый - сам и не сделаешь первый шаг."
    sl "А я ведь девушка. За что ты так со мной?"
    sl "Я ведь ничего плохого тебе не сделала, а ты меня {i}величеством{/i} называешь..."
    "Сказать ничего вразумительного из-за накатившего столбняка не получалось, а Славя смотрела на меня умоляющими глазами и всё продолжала:"
    sl "Почему ты меня боишься? Я ведь обычная девушка."
    sl "И у меня тоже есть свои чувства."
    sl "Давай хотя бы попробуем, Сёмушка. Ну, пожалуйста."
    "С мольбой она посмотрела мне прямо в глаза."
    sl "Возьми меня с собой. Я готова ради этого отправиться куда угодно, только бы рядом с тобою быть."
    "Её взгляд был туманным - казалось, что для неё теперь это вопрос жизни и смерти. Не было больше той уверенной в себе паладинши: каждое её действие выражало только бесконечное отчаяние."
    me "Ты... ты это серьёзно?"
    sl "Да, Сёмушка."
    "Отступать было уже слишком поздно, да и способен ли я был к другому решению?"
    "Я никогда и никому не доверял прежде, а Славя в моих глазах была всегда слишком самодостаточной, слишком независимой, чтобы ей ни с того ни с сего понадобился кто-то близкий."
    th "Делай, что хочешь, но сейчас мне мозги запудрить у тебя точно не получится."
    me "Зачем ты мне врёшь?"
    "Негромко и с явными нотками злобы начал я."
    me "Меня уже достала эта чушь, Славя!"
    me "Сейчас разве весна? Или ты на всех как мартовская кошка кидаешься? Нет, это не про тебя."
    me "Посмотри на меня: конченый неудачник, который шарахается от любого шороха и бежит от близких контактов с людьми."
    me "Такая как ты ни за что на свете не станет марать честь своего блестящего мундира об это серое и унылое убожество."
    sl "Неправда, ты не такой! Ты хороший!"
    me "Как бы ни так, Славя! Я падаль рода человеческого - обычная дешёвка, об которую более успешные только вытирают ноги."
    me "Чего тебе от меня надо?! Хватит со мной в игры играть!"
    "Славя стояла с мертвенно-бледным лицом, а по её щекам тонкой струйкой потекли слёзы."
    show sl cry pioneer with dspr
    th "Театр одного актёра продолжается..."
    "У меня так и не было ни единого основания верить в искренность её чувств."
    "Немного помявшись и не прекращая рыдать, словно выдавливая из себя что-то она произнесла:"
    sl "Я не могу без тебя жить, Семён. Ты мне очень нужен."
    me "Опять свою шарманку про любовь заводишь? Надоело, Славя! Давай, что-нибудь пооригинальнее, наконец."
    "Наскоро вытерев слёзы, Славя тихо ответила:"
    sl "Помоги мне, Семён. Я не понимаю, что со мной..."
    dreamgirl "Ну неужели?! Подсекай её срочно!"
    "Я решил тоже несколько умерить свой пыл и попытался успокоиться – диалог в кои-то веки начал отдавать конструктивом."
    me "Хорошо, Славя. И чем же я могу быть тебе полезен?"
    "Было видно, как на её руках пробегают мурашки, а саму активисточку заметно потряхивает от волнения, но она всё же продолжила:"
    sl "Я не знаю, кто я и откуда..."
    dreamgirl "Станция «Жёлтый дом». Конечная. Поезд дальше не идёт: просьба освободить вагоны."
    me "Что ты опять несёшь, милая? Как это ты не знаешь кто ты? Что за бред!"
    "От этих слов на её лице горе сменилось искренним раздражением - ещё пара глупых фраз и на меня набросятся с кулаками."
    show sl serious pioneer with dspr
    sl "Послушай меня, пожалуйста, и не перебивай."
    sl "Бред, говоришь? Я не помню ничего, что было до этого проклятого лагеря - ясно это тебе?"
    sl "Я вечная помощница нашей ленивой вожатой - девочка-метла, у которой нет ни чувств, ни воспоминаний."
    sl "Шурх-шурх, Семён. «Шурх-шурх» - это и есть вся я!"
    sl "А вокруг пустота, понимаешь? Как будто ничего и никогда не существовало. Я даже дома своего родного не помню!"
    me "А я здесь причём, Славя?"
    me "Тебе к доктору нужно. А лучше сразу в дурку. Сходи к Виоле - она-то тебя точно пристроит, куда следует."
    show sl angry pioneer with dspr
    "Славя с неприкрытой злобой сжала кулаки."
    sl "Я же просила не перебивать. Быть может я ничего и не помню, но точно знаю, что клеймо больной на голову мне ни к чему."
    sl "Я хочу делать что-то хорошее в этом мире, Семён - оставить после себя след. Зачем мне отталкивать людей от себя репутацией сумасшедшей дуры?!"
    dreamgirl "Ты посмотри-ка: и впрямь паладинша. И откуда столько идеалов в голову себе запихнула? Сектантша коммунистического покроя, прям."
    me "Так при чём тут я, Славя? Объясни мне, наконец."
    sl "Я подслушала вчера разговор Виолы и вожатой о тебе."
    sl "Они так странно говорили: про аномалию какую-то, про параллельные миры, про эсеров каких-то."
    sl "И тогда всё встало на свои места. Этот мир, этот лагерь - всё фальшивка."
    sl "Не было никогда никакого лагеря, не было нашей страны, не было ни Ленина, ни товарища Генды, ни Гагарина, ни Курчатова… Всё ненастоящее."
    $renpy.pause (3.0, hard=True)
    sl "{b}И Я НЕНАСТОЯЩАЯ!{/b}"
    "Она перешла почти на крик и снова заплакала."
    show sl cry pioneer with dspr
    sl "Это твой, твой мир, Семён. Ты создал его таким. Ты - Создатель!"
    dreamgirl "Без доктора тут не обойтись. «Подумала» она и «решила» - смешно."
    dreamgirl "Даже Союз, оказывается, ненастоящий. Доказательства, интересно, будут?"
    sl "Я не хочу быть пустышкой, слышишь?! Не хочу быть куклой или картонкой!"
    sl "Сделай же меня настоящей, Сёмушка! Я жить хочу, понимаешь? По-настоящему жить!"
    sl "Ты же особенный! Ты можешь! Это ведь ты меня придумал такой."
    sl "Возьми меня с собой! Дай мне шанс не быть игрушкой в чьём-то воображении!"
    "Славя закрыла лицо руками и громко зарыдала. Сил сдерживаться, похоже, у неё совсем не осталось."
    th "Большего я от неё теперь точно не добьюсь."
    dreamgirl "А тебе разве мало сказанных слов? Совсем мыслей собственных нет?"
    menu:
        "А, может быть, она права?":
            "До сих пор я не принимал в расчёт этой такой простой и в то же время логичной теории."
            "Все эти проколы, попаданцы, параллельные миры, и правда, выглядят слишком уж запутанными и непохожими на реальность."
            "Почему история этого мира частично совпадает с моим, но только с определённого момента начинаются расхождения?"
            "Почему здесь говорят со мной на том же самом русском языке, без каких бы то ни было отличий от моего родного дома?"
            dreamgirl "Глубоко копаешь. А разве мелочи тебя не смущают?"
            th "Да взять хотя бы этого истукана на площади - уж слишком он кажется мне подозрительно знакомым."
            th "А сами девочки... Какому всемогущему рандому стоит помолиться, чтобы тебя окружали школьницы с внешностью фотомоделей?"
            dreamgirl "Если хорошо вспомнить все их округлости..."
            th "Вот именно. Не знаю, сколько белка нужно есть, чтобы такое отрастить и нигде лишнего при этом не отложилось."
            "Я огляделся по сторонам."
            th "Да даже природа. Я всё понимаю - образцовый пионерский лагерь, зона отдыха и всё такое." 
            th "Но тут даже сирень - обычная самая сирень - цветёт отчего-то в середине июля. И это ещё учитывая, что мы явно сильно южнее моего промозглого края."
            dreamgirl "Забавный ты. Получается, хвостатая твоя подружка тебя и не смущает, что ли?"
            th "Я до сих пор толком не понимаю, что она такое... А после фотографии совсем в догадках теряюсь."
            if alt_uvao_D5_hentai:
                dreamgirl "Не понимаешь, но за хвостик подёргать её совсем не испугался."
            else:
                dreamgirl "Не понимаешь, но лезть с ней в странные катакомбы не испугался."
            th "Ты мне это до конца жизни вспоминать будешь?"
            dreamgirl "Почему нет, раз уж ты себе титул местного демиурга решился примерить."
            th "Но ведь так похоже! Как будто я во сне каком-то своём - где всё идеальное."
            dreamgirl "Идеальное, говоришь? Так что же ты бежишь от этого идеального, поджав хвост, когда тебе всё на блюдечке несут да с голубой каёмочкой?"
            dreamgirl "В своём мире был не пойми кем и даже тут в роли самоназначенного божка - чуть что прячешь голову в песок."
            th "Да потому что я не понимаю, как оказался здесь!"
            dreamgirl "Но создал этот мир всё равно ты?"
            "Я окончательно запутался и закрыл глаза от напряжения."
            "В голове прокручивались снова и снова все события последних дней..."
            window hide
            scene bg int_bus
            show prologue_dream
            with fade
            "Моё пробуждение в автобусе..."
            window hide
            scene bg int_house_of_mt_day
            show mt normal pioneer at center
            show sl normal at right
            show prologue_dream
            with fade
            "... обморок в домике вожатой..."
             window hide
            scene bg ext_dining_hall_away_night_uvao1
            show prologue_dream
            with fade
            "... Юля около столовой..."
            window hide
            scene bg int_catacombs_door_light2
            show prologue_dream
            with fade
            "... мой поход в бункер..."
            window hide
            scene bg ext_stage_big_day
            #сюда спрайт Слави - сами решайте насчёт эмоции
            show prologue_dream
            with fade
            "... и наконец, эта истерика Слави."
            "Голова была уже готова взорваться от новой попытки найти хоть сколько-то правдоподобный ответ. В конце концов, я не выдержал."
            me "Ааа! Как я устал от этих проклятых загадок!"
            "От моего крика Славя пришла в себя и бросилась со всех ног ко мне."
            show sl scared pioneer close
            sl "Сёмушка!"
            "Всё это происходило как будто уже и не со мной."
            me "Я понимаю только одно - я здесь лишн..."
            "Мой возглас прервался на полуслове. Какая-то большая вспышка мелькнула на долю секунды перед глазами. Я почувствовал, как что-то больно схватило меня за руку, и сознание тут же отключилось."
            if alt_uvao_D5_hentai:
                jump alt_uvao_ending_neutral_bad
            else:
                jump alt_uvao_ending_neutral
        "Слишком всё это странно.":
            "Мне всегда было тяжело смотреть, как рядом кто-то плачет - это что-то на уровне инстинктов, которые мне так и не удалось изжить за годы отчуждения от общества."
            "Но версия Слави выглядела слишком бредовой, чтобы в неё поверить."
            th "Быть может она и не врёт, что ничего не помнит, но оставлять её в таком состоянии опасно. Мало ли какую глупость ещё себе выдумает?"
            dreamgirl "Ты её с кем-то другим не попутал? Когда человека прижмут, каким бы он не был, он очень на многое способен."
            dreamgirl "С этой буйнопомешанной нужно что-то делать и быстро. Пока она за тобой с дубиной в поисках виноватого во всех грехах гоняться не начала."
            th "Думаешь, и до такого дойдёт?"
            dreamgirl "Это вряд ли. Но решать что-то нужно и побыстрее."
            if alt_uvao_D6_CS_vetrov:
                menu:
                    "Мне поможет Виола.":
                        th "Уж кто-кто, а медсестра, скорее всего, сможет найти нормальное объяснение всем этим славиным причудам и провалам в памяти."
                        th "На худой конец таблеточками успокоительными накормит да спать уложит."
                        dreamgirl "Как ты эту, психическую, дотащишь туда? Она же сказала, что к врачам ни ногой."
                        th "Придётся подыграть ей, а дальше пусть Виола сама разбирается."
                        "Славя по-прежнему плакала навзрыд рядом со мной: даже удивительно, что это нисколько не мешало моим рассуждениям."
                        "Привести её хоть сколько-то в чувства сейчас было главной задачей - я взял её за локти и, привлекая внимание, начал медленно говорить:"
                        me "Славя, успокойся. Ничего страшного не случилось пока."
                        "Она наконец убрала руки и показала мне свои красные зарёванные глаза."
                        sl "Ч-что?"
                        me "Я хочу тебе помочь."
                        "Её по-прежнему заметно трясло, но слёзы прекратились."
                        sl "Ты сделаешь м-меня настоящей?"
                        me "Я не знаю, как это работает, Славя, но знаю, кто нам сможет помочь и всё объяснить."
                        me "Ты говорила, что подслушала вчера Виолетту, так?"
                        sl "Д-да."
                        me "Значит, она хорошо понимает, что нужно делать, чтобы ты стала настоящей. Ты же хочешь этого?"
                        sl "Конечно. М-мы пойдём сейчас к ней?"
                        "Я изобразил на лице самую добрую улыбку, какую только мог."
                        th "Не хватало только, чтобы сейчас она опять сбежала."
                        "Моих познаний в психологии едва хватало, чтобы понять простую вещь - говорить с ней сейчас нужно предельно понятными и короткими фразами."
                        me "Мы пойдём, и она поможет. Ты ведь веришь мне?"
                        sl "Верю..."
                        "Я аккуратно обхватил её за плечи, прижал к себе и неспешно повёл в сторону медпункта."
                        jump alt_day6_uvao_interrogation_sl_cs
                        #Далее проводим Славю к Виоле, где Виола найдёт в Славя-версии нестыковки (а именно, прокол с попаданцем и тем, что Славя напрочь забыла инструктаж о них). Прибежит ОД перепуганная, т.к. Мику ей рассказала что Семён куда-то увёл Славю и понеслось...                                    
                    "Попытаться успокоить Славю.":
                        pass
            else:
                pass
            "От её плача мне в голову не приходило ни одной стоящей мысли, потому мне ничего не оставалось, кроме как несколько помявшись, неуверенно подойти и обнять Славю."
            dreamgirl "А ты неплох. Сейчас лучшим успокоительным будет пара хороших развратно-поступательных."
            dreamgirl "Погладь ее, где нужно, пообещай исполнения всех желаний, и она твоя!"
            "Я смутился - Славя была так близко, её кожа была горячей, а от учащенного дыхания так соблазнительно вздымалась её грудь."
            th "Нужно успокоиться... Нужно успокоиться..."
            "Несмотря на всю опасность, что могла таить Славя, я почувствовал какой-то прилив сил и осторожно погладил её по голове."
            me "Славя, Славичка. Ты меня слышишь?"
            "Не ответив, она доверительно уткнулась носом в мою грудь и прижалась чуть плотнее."
            me "Успокойся. Я никуда не сбегу и ничего плохого тебе не сделаю."
            me "Я не знаю, почему ты так решила, но для меня ты самая настоящая."
            sl "Но я ведь ничего не помню."
            "Тихим успокаивающим тоном я продолжил:"
            me "Расскажи мне про то, что помнишь. Ты ведь уже третью неделю здесь?"
            sl "Д-да."
            "Подняв наконец голову, она непонимающе посмотрела на меня своими зарёванными раскрасневшимися глазами."
            sl "Я помню, к-как мы выходили из автобуса."
            me "Расскажи мне об этом. Там было что-то забавное?"
            sl "Ты же в-видел сегодняшнее платье Мику?"
            me "Видел."
            sl "Она в нём приехала и не хотела сменить на пионерскую форму... Ольга тогда её в домик даже запереть грозилась... пока не переоделась..."
            sl "Смешно было..."
            "Славя опять замолчала. Пусть медленно, но она всё-таки успокаивалась."
            sl "Я ведь выступать сейчас на концерте должна... Плохо подводить Ольгу."
            "Оказалось, что наша активисточка могла отличиться даже здесь. Хотя чего-то подобного и следовало ожидать."
            me "У тебя был номер?"
            sl "Да... Я песню должна была петь."
            me "А какую?"
            sl "Русскую, народную... Мне мама на родительский день костюм привезла, жалко не надену такую красоту."
            dreamgirl "Что-то показания трещат по швам. Она ведь говорила, что ничего не помнит кроме лагеря."
            me "Мама?"
            "Славя удивлённо посмотрела на меня."
            sl "Д-да. А ч-что?"
            me "Ты же не помнишь..."
            sl "Ой..."
            "Всё с таким трудом обретённое спокойствие вновь было потеряно, и Славя снова громко зарыдала."
            #феффект ...феффкту рознь - имя в студию
            sl "Да что я за дура-то такая... Истеричка сумасшедш-шая... бешеная..."
            me "Славя, прекрати... Не плачь..."
            me "Ну забегалась - работаешь ведь много - голову напекло пока подметала. С кем не бывает..."
            me "Славя?.."
            "Она вновь ушла в себя и прекратила обращать внимание на внешние раздражители."
            dreamgirl "Молодец, эффективно успокоил. Теперь её до вечера из этого состояния не вытащишь."
            dreamgirl "Ты её даже до медпункта за успокоительным не доведёшь - она же последние силы сейчас потеряет."
            th "Опять что-то решать. Как же я устал."
            dreamgirl "Жить овощем у двадцатичетырёхдюймовика было куда интереснее, да?"
            dreamgirl "Сам довёл человека - сам и расхлёбывай."
            menu:
                    "Мне поможет Ольга.":
                        "Ленивовна, конечно, не была лучшим советчиком во всей этой ситуации, но она хотя бы была в курсе всех моих подозрений касательно Слави."
                        "Предсказать в точности её реакцию на подобные известия было затруднительно, но и бросить Славю здесь в таком состоянии я просто не мог."
                        th "Сейчас любая помощь будет уместна, а один я нашу активисточку не отважусь тащить в медпункт - мало ли чего ей опять по дороге в голову придёт."
                        sl "Подожди здесь. Я сейчас вернусь - хорошо?"
                        "Не дожидаясь ответа, я побежал прямиком к сцене. Концерт уже вот-вот должен был начаться, а пропускать такое мероприятие Ольга точно не имела право."
                        scene bg ext_stage_near_clear
                        play sound breath fadein 3
                        "Совершенно естественно, что нашёл я нашу вожатую именно там, где и ожидал встретить - в первому ряду, рассаживающей сорванцов из младших отрядов."
                        show mt angry pioneer far with dissolve
                        "Немного переведя дух, я осторожно подошёл к ней и тихо сказал на ухо:"
                        me "Ольга Дмитриевна, можно вас?"
                        show mt rage pioneer with dissolve
                        mt "Ерохин! Ну-ка быстро отсел от Сидоровой."
                        "Похоже она меня не услышала."
                        me "Ольга Дмитриевна..."
                        "Полушепотом и не удостоив даже взгляда, вожатая ответила мне:"
                        show mt angry pioneer with dissolve
                        mt "Слышу я тебя, Семён, слышу. Видишь, я занята?"
                        me "Ольга Дмитриевна. Там со Славей это..."
                        show mt sad pioneer with dissolve
                        mt "Чего ты опять про Славю придумал? Опять наговаривать на неё будешь?"
                        me "Ей... плохо. Говорит, память частично потеряла."
                        #Кто там ставил mt serious? Такого спрайта нет в природе
                        show mt #doubt уже есть в коде?
                        "На её лице пробежала целая гамма эмоций, и схватив меня за руку, она одёрнула меня в сторону."
                        mt "Что с ней случилось? Где она?"
                        me "Т-там у задних скамеек."
                        mt "Чего там у неё с памятью?"
                        me "Рассказывала, что не помнит ничего кроме лагеря, а потом вдруг про мать и родительский день вспомнила."
                        mt "И ты её там одну оставил? В таком состоянии?"
                        me "Вы понимаете... В общем, у неё истерика."
                        th "И откуда у меня это патологическое желание оправдываться?"
                        me "Вы поможете мне её до медпункта довести?"
                        mt "Помогу. Но сначала ты объяснишь, что с ней произошло."
                        me "Ольга Дмитриевна, человеку помощь нужна, а вы тут..."
                        "Какой бы безоветственной не казалась мне Ольга, обвинить её в безучастности к судьбе своих пионеров было всё же нельзя. Она потупила глаза и немного остыла."
                        show mt normal pioneer with dissolve
                        mt "Твоя правда. Пойдём скорее."
                        "Уже сделав пару шагов вожатая вдруг остановилась и окликнула проходящего мимо физрука."
                        mt "Борис, подожди."
                        show ba normal uniform
                        ba "Чего тебе, Олька?"
                        mt "Я уйду сейчас: с пионеркой что-то случилось. Присмотри за ребятами, пожалуйста."
                        ba "Ладно."
                        scene bg ext_stage_big_day
                        "Славя всё также сидела на поребрике и плакала, обхватив лицо руками."
                        "Вожатая вновь одёрнула меня и сквозь зубы сказала:"
                        show mt angry pioneer with dissolve
                        mt "Если это всё твоих рук дело, ты у меня до конца смены будешь под домашним арестом, понял?"
                        "Впрочем, не став терять времени на выяснение отношений, она подошла к Славе и осторожно подняла её на ноги."
                        show mt normal pioneer with dissolve
                        mt "Славя, сейчас всё будет хорошо."
                        #красноглазые спрайты в студию
                        sl "А?.."
                        "Блондинка по-прежнему не до конца понимала что же происходит. Всё-таки возраст ещё нежный, да и истерики были для неё явно в новинку."
                        mt "Отведём тебя к доктору, поспишь и всё пройдёт."
                        sl "Я не... не хочу к д-доктору..."
                        "От упоминания карательной медицины Славя начала быстро приходить в себя."
                        mt "Не бойся. Виолетта тебя быстро на ноги поставит."
                        #место для недовольного спрайта Слави от Драуга
                        sl "Я не хочу к доктору. Со мной всё в порядке."
                        mt "Славяна. У тебя истерика. Пойдём, выпьешь успокоительного."
                        mt "От дискотеки и общественных работ я тебя освобождаю."
                        #место для рахе-спрайта Слави от Драуга
                        sl "Со мной всё в порядке. Пустите."
                        #феффект который опять-таки?
                        "Неожиданно Славя попыталась вырваться, но Ольга крепко схватила её за руку."
                        mt "Семён, держи её! Быстрее!"
                        "Уцепившись со всей силы за локти, вдвоём мы удержали нашу активистку."
                        "В отчаянии она сделала несколько попыток дёрнуться и нам пришлось очень несладко, чтобы не дать ей вырваться."
                        th "Не зря она каждое утро кроссы мотает. Атлетка, чтоб её."
                        #место для расстроенного спрайта Слави от Драуга
                        "Поняв безвыходность своего положения, она вновь обмякла, заплакала и тихо начала шептать:"
                        sl "Не хочу! Не надо!"
                        mt "Славя, мы тебя вылечим. Вот увидишь."
                        "Не встречая больше серьёзного сопротивления, мы с Ольгой медленно повели Славю в сторону медпункта."
                        jump alt_day6_uvao_aidpost_sl_concert
                        #Приводим Славю к Виоле. ОД куражится, что всё закрыть к чертям и прочее, т.к. второй случай помешательства за 2 дня и т.д.
                    "Лучше сбежать, пока не очухалась.":
                        "Мне никогда не удавалось нормально сопереживать человеку, несмотря на всю мою бесконфликтность."
                        "Всю свою жизнь я был и оставался чёрствым сухарём, которого мало волнуют проблемы кого-то другого кроме самого себя."
                        "Сбежать от этой истерички сейчас – значит, поступить как всегда, как привычно. Ведь можно во всём разобраться и поодаль от неё?"
                        "Почему-то особых сомнений и угрызений совести это решение у меня не вызвало."
                        me "Ну вот видишь, всё же хорошо."
                        "Я немного потряс Славю за плечо и препохабно улыбнулся. Казалось, она немного пришла в себя."
                        me "Ты нормальная, настоящая. Отдохнёшь и всё будет замечательно."
                        me "А сейчас тебе пора идти на концерт. Тебя ведь Ольга Дмитриевна наверняка ищет. Ты же не хочешь её подводить?"
                        "Всё ещё не понимая что происходит, она тихо произнесла:"
                        sl "Н-нет. Надо идти."
                        me "Иди-иди. Увидимся на ужине."
                        dreamgirl "Каком ещё ужине? Тебе с ней вообще лучше не пересекаться до конца смены!"
                        th "Спокойно. Просто улыбаемся и машем. Это ничего не значит."
                        "Блондинка тихо поплелась в строну последних рядов. И хвала рандому, что никаких лишних вопросов обо мне задавать не стала."
                        "Я же, воспользовавшись ситуацией и не привлекая лишнее внимание, поспешил поскорее отчалить от вселагерного сабантуя туда, где можно было спокойно подумать."
                        scene bg кусты #поверх бг сцены?
                        th "День ото дня всё веселей живём мы и чудесней... Я уже даже боюсь представить, что ещё вечером сегодня может стрястись."
                        dreamgirl "Зачем особо что-то представлять? Ну упадёт лишний кирпич на голову, что тут такого?"
                        th "Тебе бы всё шутки шутить, а у меня уже полдня голова кругом идёт от безудержного веселья в исполнении Слави."
                        dreamgirl "И чего ты смылся от неё тогда?"
                        dreamgirl "Иди утешай. Глядишь, и расскажет какая муха це-це её укусила до временной амнезии."
                        th "Из неё сейчас не вытянешь ничего существенного, ежу же понятно."
                        th "Здесь хотя бы подумать спокойно можно, подальше от всех любопытных глаз."
                        "Думать, однако, было особо не над чем: приём психотропных препаратов я отмёл сразу - слишком непохоже на Славю."
                        "Кормили нас в последние дни нормально, и у меня никаких интересных эффектов не наблюдалось. Хотя все остальные всё равно вели себя крайне странно."
                        "Пришельцы и влияние внешних сил тоже не добавили чёткости логическим построениям."
                        dreamgirl "Ты совершенно не наблюдательный, друг мой ситный." # не забываем обезличивать Шизу
                        th "Давай, без намёков, а? Есть идеи - выкладывай. У меня уже мозги пухнут."
                        dreamgirl "Вчерашнего Шурика после прогулок по бомбоубежищу помнишь?"
                        th "Допустим."
                        if alt_uvao_D5_hentai:
                            dreamgirl "А что с ним Юля сотворила уже и забыл?"
                            "Удивительно, но сегодня этот пошляк был крайне полезен в критические моменты."
                            "Вот и сейчас его предположение сразу встроилось ключевой деталькой в мой паззл."
                            th "То есть, она теоретически могла как-то повлиять и на сознание Слави. Но не просто же так. Юля ведь безобидная."
                            dreamgirl "Твердили-твердили тебе всё утро, что кошкодевочки опасны, а ты опять? Всё брачные игры совместные покоя не дают?"
                            "Пропустив вновь мимо ушей комментарий карманной шизофрении, я задумался: не стоило ли узнать всю эту историю?"
                            th "В любом случае, Юля что-то знает обо всём этом. Даже если это и не она виновна во всех сегодняшних странностях Слави, то вполне возможно знает истинный их источник."
                            dreamgirl "Она ведь говорила, что не любит ту, что с косами."
                            th "Тем более. Осталось только найти её и расспросить обо всём."
                            jump alt_day6_uvao_seek_uv
                        else:
                            dreamgirl "Что ведь с ним там произошло. И не факт, что наша кошечка не имеет к этому никакого отношения."
                            "Странностей вокруг неё и правда было предостаточно, потому версию моей шизофрении пришлось принять как рабочую."
                            th "Одна проблема - совершенно непонятно, что со всем этим делать."
                            th "Уж слишком разные случаи у Шурика и Слави: один бегал по лесу как угорелый с арматуриной, вторая одержима какой-то идеей фикс про своё существование."
                            dreamgirl "Мне откуда это знать - я же всего-то голос внутри чьей-то головы, а не Виола или сама Юля."
                            dreamgirl "Нужны подробности - у них и спрашивай."
                            if alt_uvao_D6_CS_vetrov:
                                menu:
                                    "Пойти к Виоле.":
                                        "Приключений для меня сегодня было более чем достаточно."
                                        "Потому общаться лишний раз с тем, кому даже не можешь дать название, и вдобавок потенциальным источником проблем с рассудком у пары пионеров не хотелось от слова совсем."
                                        th "Виола хоть что-то знает про аномалию. Говорить прямым текстом ей всё конечно не стоит, но расспросить о симптомах воздействия вполне можно."
                                        "Решив больше не терять драгоценного времени, я поспешил к медпункту."
                                        jump alt_day6_uvao_enquiry_cs
                                        #Приходим к Виоле и намёками-намёками пытаемся прознать о влиянии Кошочки. Виола бесится и требует выкладывать правду. Приводим Славю вместе с ОД.
                                    "Искать Юлю.":
                                        "Видеть лишний раз нашу медсестру мне совершенно не хотелось, да и её познания о влиянии Юли на людей выглядели крайне сомнительно."
                                        th "Ничего кроме теории она не знает, а поражённых по её же рассказам никогда и не встречала."
                                        th "Выясню-ка я лучше всё из первых уст. Осталось только найти Юлю."
                                        jump alt_day6_uvao_seek_uv
                                        #Шарашимся по лагерю до дискотеки и ищем Юлю. Встречаем Ульяну, которая пытается затащить на дискотеку, но отнекиваемся.
                            else:
                                pass
                            "Видеть лишний раз нашу медсестру мне совершенно не хотелось - того и гляди опять сведёт весь разговор к пионерам да сеансам обтираний."
                            th "Из двух зол стоит выбирать меньшее. А по отношению ко мне Юля выглядит куда более безобидным существом, чем наша скабрезная Виолетта Церновна."
                            th "Выясню-ка я лучше всё из первых уст. Осталось только найти Юлю."
                            jump alt_day6_uvao_seek_uv                                  
