# Д6-левая ветка, карьер.
# План-набросок-черновик
#
label alt_day6_uvao_left_UN_sandpit:

# сцена - карьер.
# концовка предыдущего фрагмента:
    # "...и вдруг очутился на открытом пространстве, большую часть которого занимал солидных размеров песчаный карьер."
    # "Лес с этой стороны подходил почти вплотную к карьеру. Некоторые особо неудачливые деревья, накренившись, балансировали на самом краю, отчаянно хватаясь обнажёнными корнями, как растопыренными пальцами, за ненадёжный воздух. {w}Чувствовалось, что участь их предопределена - пройдут год или два, дожди ещё немного подмоют непрочную песчаную стену..."
    # "Лена была здесь, куда-то пробираясь по-над краем. Прячась за деревом, я наблюдал, как она подошла к группе особняком стоящих сосен и замерла перед ними неподвижно."
    
### возможно, здесь фоном пустить memories_piano
    "Потом медленно подошла ближе к деревьям, переходя от одного к другому и зачем-то осматривая стволы. {w} Перед некоторыми она останавливалась, касаясь их рукой."
    "Наконец она остановилась перед одним и вдруг воровато огляделась по сторонам."
    "Я вжался в шершавую кору ствола, разом вспотев от мысли, что теперь-то она меня точно заметит..."# {w}Но, как ни странно, этого не произошло."
    th "Уф, пронесло!"
    "Немного повозившись, Лена достала из кармана что-то, блеснувшее на солнце, и близоруко наклонилась к стволу."
    th "Что она там делает?"
    "Не в силах устоять перед любопытством, я выбрался из своего укрытия и понемногу начал подбираться поближе к полностью сосредоточившейся на своём занятии пионерке."
    th "Точно, вырезает что-то на стволе."
    "Осмелев, я подошёл совсем близко."
    # сцена - рощица с сердечками.
    "Отсюда мне уже были видны характерной формы разнокалиберные метки на других стволах."
    th "Неужто эта нелюдимка тоже решила свой вклад внести?"
    stop music fadeout 1 #или 0. Чтобы резко
    # притушить ambience до 60%
    #show un scared pioneer far
    with hpunch
    "...Оглушительно треснула под ногой сухая ветка, и Лена испуганно обернулась."
    "Ойкнув, она поспешно спрятала за спину вновь блеснувший на солнце перочинный ножик и попятилась."
#    dreamgirl "Поздравляю, Шерлок, нас заметили. Что делать будешь?"
    me "Э-э-э... да... {w}Привет."
    "Не сводя с меня широко раскрытых глаз, девочка сделала ещё шаг назад."
    me "Я вот... {w=1.0}кхм... {w=1.5}как раз шёл... Случайно шёл мимо..."
    "Ещё пара шагов назад."
    me "А тут как раз ты, так удачно... {w=1.5}Я хочу сказать, как раз хотел поговорить с тобой... ну, знаешь..."
    "Я понимал, что несу какую-то чушь, но не мог остановиться."
    "Тем временем Лена, словно зачарованная, не отводила от меня взгляда и понемногу продолжала пятиться..."
    "Меня вдруг прошиб холодный пот - я понял, что до края обрыва ей осталась пара шагов."
    me "Лена! Осторо..."
    "Словно кто-то ударил наотмашь огромным иззубренным лезвием - землю прямо перед носками сандалий девочки рассекла чёрная рваная трещина."
    "С нарастающим шуршанием край обрыва обманчиво плавно двинулся вниз, всё быстрее и быстрее, Лена ахнула, взмахнула руками, пытаясь удержать равновесие..."
    #hide un easeoutdown
    "Вскрик девочки вывел меня из секундного ступора. {w}Рванувшись, я одним прыжком покрыл разделявшее нас расстояние - как раз, чтобы упав на колени, успеть поймать слепо хватающуюся за траву руку."
    "Всегда такая надёжная земля мягко дрогнула подо мной, качнулась вниз, заставляя сердце пропустить удар."
    "Свободной рукой я, точь-в-точь как Лена секунду назад, зашарил позади себя в тщетной попытке найти несуществующую опору."
    "Я ещё успел ощутить, как сильные тонкие пальцы оплели вдруг моё запястье."
    #ЛБ: поиграться с blink-unblink и vpunch. Возможно - разом двинуть вверх весь фон, заменяя снизу чёрным.
    #ЛБ: поиграться со звуками - на секунду-другую приглушить в ноль одновременно с затемнением.
    "Падение закончилось как-то внезапно - вот только что я летел, не разбирая где верх, а где низ, и вот уже отплёвываюсь, пытаясь понять, все ли части моего полузасыпанного песком тела на месте."
    dreamgirl "И стоило так психовать? Можно подумать, никогда с пацанами с верхотуры в песок не прыгал."
    dreamgirl "Ладно, докладываю: посадка прошла успешно, серьёзных травм нет. Полагаю, с обеими твоими попутчицами тоже всё в порядке."
    th "Почему обеими? Что за... {w}Ох, чёрт!"
    "Я сел, освобождаясь от остатков засыпавшего меня песка."
    show un surprise pioneer at right with dissolve2
    "Справа от меня невнятно всхлипывала Лена, пытаясь протереть глаза. Слева..."
    show uv sad at left with dissolve2
    "Слева на куче песка сидела очень недовольная Юля, отчаянно трясущая головой."
    uv "Песок в уши набился. Терпеть не могу."
    "Пояснила она брезгливо, встретив мой взгляд."
    show un surprise pioneer with dissolve
    "Лена наконец справилась с попавшим в глаза песком, да так и замерла, уставившись на Юлю с открытым ртом."
    "Тем временем хвостатая принялась деловито вытряхивать песок из своих пышных каштановых волос."
    me "Юля, ты-то здесь откуда?"
    uv "Оттуда... Ты же падал. Я помочь хотела."
    "Она обвиняюще ткнула в меня пальцем."
    uv "Ты зачем упал?"
    "Я растерянно пожал плечами, поднимаясь на ноги."
    me "Ну так я тоже помочь хотел. {w}Вот ей, Лене, она первая падать начала."
    "Я кивнул на продолжавшую молча таращить глаза Лену."
    "Юля исподлобья глянула на неё и надула губки."
    show uv dontlike with dissolve
    uv "От тебя одни неприятности! То мне мешаешь, то Семён из-за тебя падает!"
    show un normal pioneer with dissolve
    un "Я тебя знаю."
    "Подала вдруг голос девочка. Она резко встала и сделала шаг ко мне, не сводя глаз с Юли."
    un "Я тебя знаю!"
    "Повторила она звонко."
    th "Вот! Точно! Где-то они успели пересечься!"
    show un angry pioneer with dissolve

# Лена тоже вызверивается на Юлю - "Я тебя знаю, ты... ты плохая!"
# ГГ успевает мысленно "Вот! Точно они пересеклись где-то!"
# Лена взвизгивает "Семён", резко хватает ГГ за руку, так что тот пошатывается.
# Юля пытается использовать _умение_ (возможно, ГГ нечто ощущает странное). Лена в итоге вопит что-то трогательное и закрывает собой ГГ.
# Юля кричит что-то невразумительное наподобие "Неправильная!".
# Юля дыбит волосы и бросается на Лену. ГГ отброшен хрупкой Леночкой в сторону, Юля промахивается мимо извернувшейся Лены.
# Юля с Леной медлят секунду в боевых стойках, ГГ как раз успевает вскочить и броситься между ними, слегка наклонившись (чтобы ему как раз по балде прилетело)... "Мир кувыркнулся."
# ГГ снова мордой в песок. "Кажется, меня опять приложили по голове. Правда, на этот раз не мячом."
# Его со слезами поднимают - едва ли не хором "Сенечка, ты живой?"
# Производим подсчёт потерь - ушиблена и кружится голова, разодрана кожа на плече от рукава и до локтя (кровушка проступает на глазах).
# Дамы зверски друг на друга косятся, но больше пока что не дерутся. Обе взъерошены, но без видимых травм. Слёзно просят прощения у ГГ, одновременно тянут его каждая к себе. ("прости меня, это всё она! я бы никогда!")
# Быстро начинают скатываться в агрессивную истерику, ГГ орёт "Тихо!"
# Вилка, где всех запутываем с выбором
    # - "Лена, остановись!"
        # "Юля мне зла не желает! И тебе тоже!"
        # "А ты, Юля, зачем бросаешься? что она тебе сделала?"
    # - "Юля, остановись!"
        # "Лена, ты достала уже! Что, совсем с катушек съехала?!"
        # Окончательно обижаем Лену, далее на катапульту
        # как вариант выхода - уходит с Юлей, а Лена остаётся с отчаянием в глазах.
        # Через некоторое время Юля вдруг проявляет сильное беспокойство, демонстрирует болезненное состояние и т.п.
        # Возможно, Шиза ещё успевает сказать про "говорили же тебе про эмоциональный фон!", после чего следует катапульта в тонущий автобус.
        # Эдакий толстый намёк для внимательных, что Лена с горя испортила-таки фон настолько, что прокол схлопнулся.
        #
        # Словом, здесь jump в тонущий автобус

# Дамы смущены. ГГ судорожно прикидывает, что делать дальше. Ура, идея! - Лену отвести в лагерь и сдать медицине.
# Одновременно машинально ощупывает голову.
# dreamgirl "Ах, голова! Голова! Оторвали! Я умира...кха-кха!"
# Лена со слезами: "Сенечка, у тебя кровь! Тебе больно?" переживает за ГГ. "Тебе к врачу надо!"
# dreamgirl "Единственное, что может спасти смертельно раненного кота, — это глоток бензина."
# ГГ от неожиданности невнятно хрюкает, давясь смешком. Лена: "Сенечка, тебе плохо?!"
# ГГ радостно симулирует головокружение и прочее сотрясение мозга. "Я в порядке... Лена, давай... тихонечко дойдём до медпункта. Юля, ты не волнуйся, меня никто не обидит, и вообще, ты меня спасла, я только к доктору схожу, голову ушиб немножко. Давай завтра увидимся, ладно?"
# Юля смотрит на ГГ с сомнением ("неужели раскусила, что притворяюсь?"), но потом сообщает, что да, это плохо, когда голова болит, и сваливает понемногу.

# ГГ даёт Лене очистить ранку на руке носовым платочком. ГГ замечает, что у Лены тоже слегка поцарапана рука, но та отмахивается.
# ГГ позволяет вести себя в медпункт.
# Лена по дороге держится поначалу молодцом. Ведёт себя деловито, без намёка на эротику. Заботится без назойливости, не быстро ли идут, сильно ли голова кружится, не надо ли передохнуть.
# На подходах к обитаемой территории спохватывается, что у Сэма вся одежда в песке ("Интересно, сама-то и не испачкалась совсем. Как только сумела?") и принимается его отряхивать, на чём неожиданно срывается в слёзы, уткнувшись ГГ в плечо.
# ГГ что-то лопочет растерянное, неловко поглаживает Лену по спине.
# Лена быстро берёт себя в руки. "Из-звини. Я так испугалась, что ты... что с тобой... когда ты упал...". ГГ или Шиза отмечают, что "конечно, за ГГ она испугалась, а что сама с обрыва вверх тормашками летела - уже и неважно". Лена утирает слёзы, заканчивает чистить ГГ и идут дальше. ГГ намекает, что ему уже лучше, и неплохо бы идти обходными путями, чтобы публику не нервировать.
# По дороге ГГ несколько раз порывается было завести Выведывательный Разговор насчёт отношения к нему Лены и давно ли это с ней, но так и не решается.
# Понемногу вечереет.
# Лена уже не так деловита, молчит, сама по себе непрерывно смущается, краснеет, потупляет глазки и вздрагивает, но Сэма держит крепко, хотя временами уже и за него - у неё умеренный отходняк.
# Кустами выруливают к медпункту, входят.

    "В дверях я замешкался было, пропуская Лену, но та решительно подтолкнула меня вперёд."
    # сцена - медпункт изнутри вечером
    "Виолетта оторвалась от экрана компьютера, на котором красовался полузаполненный стакан \"Тетриса\" и несколько секунд с интересом изучала нас с Леной поверх очков."
    cs "И чем же, {i}пионеры{/i}, вы таким экзотическим занимались {i}вместе{/i}, что теперь вам двоим понадобилась медицинская помощь?"
    "Наконец промурлыкала она сладким голосом. Потом продолжила, растягивая гласные:"
    cs "Впрочем, если вы не слишком затянули с визитом..."
    un "Ч-что?{w} Н-не-е... М-мы не... Н-не то, что Вы п-п..."
    "Лена жарко покраснела и уставилась на носки своих сандалий, несомненно мечтая сейчас об одном - провалиться сквозь пол."
    "В другое время я и сам вволю посмущался бы в такой ситуации, но сейчас мне было не до того."
    me "Ой, Виолетта Церновна, ну что Вы такое говорите! Просто мы упали с обрыва и немного поцарапались, вот и всё!"
    "Поспешил я перехватить инициативу, ухватив окончательно отморозившуюся девочку под локоток и увлекая её к кушетке."
    "Одновременно я корчил Виоле дикие рожи и закатывал глаза в надежде, что это её наведёт на мысли о проблемах с головой{w}, причём - не только у меня."
    me "Мы, понимаете, упали втроём в карьер - Лена, я и Юля - и поцарапались. {w}Очень может быть, что Лену именно Юля и поцарапала, когда они подрались."
    un "Ч-что?.."
    cs "Как?.."
    "Но я продолжал тараторить, не давая никому и слова вставить, одновременно усаживая Лену и сам садясь рядом на всякий случай."
    me "Я уверен, ничего серьёзного, но мало ли что там у неё на ногтях могло быть, рук-то она не моет."
    me "Вполне могло получиться, как вчера, с тем пионером. {w}Я даже уверен, что так и вышло."
    "Выпалив всё это без остановки, я развёл руками."
    me "Вооот."
    un "Семён головой ударился, у него сотрясение, наверное..."
    "Пролепетала Лена несчастным голосом, стараясь не смотреть мне в глаза."
    "Внезапно ВЦ пришла в движение."
    cs "Так, вот только столбняка ещё нам не хватало!"
    "Заявила она решительно, извлекая из стола металлический стерилизатор и какие-то ампулы."
    cs "Со всем остальным мы тоже разберёмся, но столбняк, чтобы вы знали, относится к тем самым болезням, которые очень легко предупредить, но чрезвычайно трудно излечить!"
    "Солидно продолжала Виола, натягивая невесть откуда появившиеся перчатки и доставая из стерилизатора два стеклянных шприца."
    cs "В данном случае промедление воистину смерти может быть подобно!"
    "Сообщила Виола внушительно, обращаясь непосредственно к Лене. Та робко кивнула."
    cs "Вот и славно! Давай руку."
    "С нарастающим недоумением я смотрел, как медсестра протирает девочке сгиб локтя и точным уверенным движением вонзает иглу в вену."
    th "Что за ерунда? Было дело, кололи противостолбнячную - так её же подкожно полагается, вроде бы?"
    "Впрочем, я счёл за лучшее помалкивать в тряпочку. Свою роль я уже сыграл и теперь уже от меня мало что зависело."
    "Безропотно подставив руку, я получил свои три кубика какой-то прозрачной жидкости в вену и клочок марли - зажимать место укола."
    cs "Сиди-сиди! Это новейшая противостолбнячная вакцина, но даже ей требуется некоторое время, чтобы подействовать."
    "Приказала Виола заёрзавшей было девочке. Та неслышно шевельнула губами и замерла на месте, ссутулившись и теребя подол."
    cs "Организмы у вас молодые, неокрепшие, а погода жаркая, недалеко и до беды! Давайте я пока ваши ссадины обработаю."
    "Вещала Виолетта, суетясь вокруг нас с перекисью водорода."
    #текст на весь экран
    "На этот раз она работала неторопливо, не пропуская ни царапинки, и говорила, говорила, говорила..."
    "За следующие пару минут я узнал массу важных и абсолютно мне неинтересных сведений о микроорганизмах, угрожающих здоровью и жизни несчастного, допустившего повреждение кожных покровов."
    "Потом слуховой центр мозга милосердно отключился, так что доносилось только монотонное \"бу-бу-бу\""
    "Лена, судя по слегка остекленевшему взгляду, ощущала нечто подобное."
    th "Интересно, что за спектакль Виола разыгрывает? Явно ведь что-то затеяла."
    "Лениво думал я, вяло наблюдая, как тампон с перекисью водорода в третий уже раз проходится по одной и той же ссадине."
    "Что-то мягко ткнулось мне в плечо. Обернувшись к Лене я обнаружил, что она дремлет, привалившись ко мне."
    "Ещё минута - и она тихонько засопела, уютно устроившись у меня на плече."
    "Виолетта, бубнившая что-то про устойчивость синегнойной палочки к антибиотикам, прервалась на полуслове."
    #долой полноэкранный.
    cs "Кажется, подействовало."
    "Сказала она негромко уже нормальным голосом."
    cs "Помоги-ка мне."
    "Вместе мы уложили Лену всё на той же кушетке. Та пробормотала что-то, но не проснулась."
    "Пока Виола измеряла девочке пульс, ослабляла галстук и укрывала её, я прислушался к своим ощущениям."
    "Сейчас, когда медсестра прервала свою импровизированную лекцию, сна не было больше ни в одном глазу."
    cs "Тебе я ввела физраствор, только-то и всего."
    "Ответила Виола на мой молчаливый вопрос, усаживаясь за столом и кивнув на свободную кушетку."
    cs "А теперь, {i}пионер{/i}, садись, будь так любезен, и рассказывай очень подробно. Надеюсь, я не зря потратила на эту пионерку дозу препарата - за который мне потом придётся отчитываться, между прочим!"
    
# Здесь микровилки по флагам от утра Д7 на общую тему "Я рассказал о произошедшем на карьере и заодно поделился своими подозрениями насчёт Лены."
# Здесь микровилки по тем же флагам на тему "ВЦ задумчиво покивала головой." "Ну да, ну да, очень похоже, что..."
# ВЦ говорит ГГ, что тот в итоге всё правильно сделал, но упрекает, что тот не пошёл сразу к ней, поделиться своими подозрениями.
# "Перед концертом, говоришь, с Юлей общался? Вот и пошёл бы сразу ко мне. Привели бы потихоньку Лену в медпункт, поговорили бы спокойненько..." - "Хорошо, в следующий раз так и сделаю"
# Одним словом, обыгрываем развитие сюжета в левом медпункте, если бы всё прошло тихо-гладко, без беготни и без Юли с котлетами.
# ВЦ: "А не пойти ли тебе куда-нибудь отсюда? За Леной я присмотрю, молодец что привёл, а сам иди. На дискотеку иди, вот! Штаны почисти только, и иди."
# Возможно, прикажет заодно найти и прислать ОД - надо её с дискотеки нейтрализовать.
# ГГ с нашлёпкой пластыря на руке (возможно, слегка раздосадованный, что прогнали, но всё-таки довольный, что сбагрил Лену с рук долой), идёт умываться, потом в домик - чиститься, потом как раз и дискотека начинается, где уже рыщет Славя.
# ### Весьма вероятно, что почистившийся Сэм зависнет где-нибудь в одиночестве на какое-то время, чтобы убить время. Услышав звуки дискоткеи, слегка опоздает на неё для унификации текста с выходом из левого медпункта.
