label alt_day5_uvao_ev_beach_event:
    # Заглянули на пляж, чтоб искупаться
    # Видим Славю в раздрае чувств
    # Славя на вопросы не отвечает, но внезапно предлагает искупаться вместе
    
    # <---строки ниже удалить при сборке!>
    $ night_time()
    $ persistent.sprite_time = "night"
    scene bg ext_beach_night with dissolve
    play music music_list["trapped_in_dreams"] fadein 5
    # <---строки выше удалить при сборке!>

    "После такого напряжённого дня мысль искупаться казалась весьма здравой."
    "Я не спеша дошёл до вотчины Ольги Дмитриевны - хвала рандому, сейчас её тут не было, и некому было устроить мне внеочередную выволочку за… да за что угодно!"
    "Я нашёл подходящий пятачок земли и уже начал развязывать осточертевший галстук, как вдруг заметил кого-то в дальнем углу пляжа."
    "Она сидела, уткнувшись лицом в колени, косы безвольно стелились по земле."
    show sl sad pioneer far at fleft with dissolve
    "Такой Славю я еще не видел. Она что, плачет?"
    # обрывки фраз - что-нибудь про "последний день" "сплошная выдумка"?
    dreamgirl "И ты, как рыцарь на белом коне, должен немедленно утешить печальную деву. Преисполненная благодарности, она падёт тебе на широкую грудь и доверит все свои тайные секреты."
    th "А почему бы и нет? Не проходить же мимо. Я от неё ничего, кроме хорошего, не видел, может, смогу помочь чем-то?"
    show sl sad pioneer far at cleft with dissolve
    "Чувствуя себя донельзя неловко, я направился к ней, старательно шурша ногами по песку - чтобы она не подумала, что я подкрадываюсь."
    show sl sad pioneer at center with dissolve
    me "Эм… Славя?"
    sl "Семён. Что тебе?"
    "Она так и не подняла голову, голос её звучал глухо и неприветливо."
    me "Да в общем-то ничего… Я просто искупаться собирался…"
    sl "Одному нельзя. Не положено. Надо, чтоб кто-то из вожатых присматривал."
    me "Вот как… Жаль…"
    hide sl with dissolve
    "Я сел рядом. Не зная чем занять руки, я сорвал какую-то травинку и стал обрывать с неё семена. Славя так и сидела спиной ко мне, не шевелясь."
    dreamgirl "Кажется, с утешением и падением на грудь возникли проблемы. Может быть, она сценарий не читала?"
    me "Славя… У тебя все в порядке?"
    sl "Нет. Но это неважно."
    "Что-то мне подсказывает, что я тут нежеланный гость."
    me "Ты извини, что я навязываюсь… но… может, я смогу помочь?"
    sl "Вряд ли…"
    "Да, так и есть. Наверное, сейчас стоит встать и уйти… Да, вот сейчас… Сейчас встану, извинюсь и пойду… "
    "Славя подняла голову, провела ладонями по лицу, стирая слезы… "
    th "Действительно плакала!"
    show sl normal pioneer close at center with dissolve
    "…потом повернулась ко мне, нацепив своё обычное оптимистичное выражение лица."
    sl "Не волнуйся, все в порядке. Ну, почти.{w} А у тебя?"
    me "Э-э-э… Да вроде тоже неплохо."
    "За исключением таинственных подземелий, психованных пионеров, кошкодевочек и прочего вороха тайн."
    sl "Теперь тебе здесь больше нравится?"
    th "О чем это она вообще?"
    me "Ну… да, нравится. Здесь хорошо."
    sl "А у тебя никогда не было чувства, будто весь этот лагерь придуман специально для тебя?{w} Как будто он - исполнение твоей мечты? Будто ты всегда хотел попасть сюда, но не мог?"
    me "Знаешь, я как-то не задумывался на эту тему."
    sl "А если задуматься? Похоже?"
    "Да что ей надо-то от меня? От Шурика бешенство подхватила, что ли?"
    me "Ну… э-э… наверное… да."
    sl "Правда?"
    "Она вперилась в меня взглядом, ожидая моего ответа, и от этого взгляда мне стало как-то неуютно."
    me "Ээ… да. Правда. Так и думаю. Очень похоже."
    th "Лучше во всем с ней соглашаться."
    "Славя как-то обречённо вздохнула, но больше вопросов не задавала. Просто сидела, уставясь на воду."
    me "Ладно, я, наверное, пойду… Пока…"
    hide sl with dissolve
    "Я постарался удалиться как можно незаметнее. По крайней мере, Славя никак не отреагировала на мой уход."
    th "Странная она сегодня какая-то…"
    "Не-е-ет, все, хватит на сегодня тайн. Пора в кроватку, утро вечера мудренее."
