# Д6 средняя левая ветка (спалившийся ГГ), завтрак с Шуриком.
# План-набросок-черновик
#
# Используется флаг alt_day2_lib_done посещения библиотеки в Д2 (общение с Шуриком в стенгазете)
# Используется флаг alt_day2_club_done посещения клуба кибернетики в Д2
#
label alt_day6_uvao_spoiled_breakfast_sh
    "Отстояв в очереди и получив положенную мне пайку, я для очистки совести оглядел столовую в поисках Шурика."
    "Будущего светила советской науки науки видно не было, зато я заприметил пару свободных мест у окна - туда я и направился с чувством выполненного долга."
    th "Я же не обещал за этим гением бегать по всему лагерю. Попадётся под руку - тогда и поговорю. Наверное."
    "Пока же меня полностью устраивала перспектива спокойно посидеть и хорошенько подумать - поводов Виола дала мне предостаточно."
    "Очень быстро выяснилось, что мои намерениям было не суждено сбыться."
    "Не успел я усесться, как заприметил Славю, стоящую с подносом посреди столовой и явно кого-то высматривающую."
    "Увидев меня, она радостно заулыбалась и устремилась к свободному месту напротив."
    "Мне оставалось лишь горестно вздохнуть - кажется, завтрак наедине с умными мыслями отменялся."
    "Впрочем, прежде, чем девочка успела подойти, откуда-то сбоку, как чёртик из табакерки, выскочил Шурик."
    "Рванувшись по прямой к моему столику, он едва не сбил Славю с ног, но, кажется, даже не заметил этого."
    "Не утруждая себя пустыми формальностями вроде приветствий, он плюхнул свой поднос рядом с моим, уселся за стол на против меня и сказал - нет, {i}объявил{/i}:"
    sh "Надо поговорить."
    if alt_day2_lib_done or alt_day2_club_done # в Д2 болтали с Шуриком в стенгазете или клубе
        "Я откинулся на спинку стула. {w}Шурик мне с первого дня не слишком-то понравился, так что подобная бесцеремонность должна была бы разозлить меня, вывести из себя, но вместо этого скорее позабавила и даже заинтриговала."
    else:
        "Я откинулся на спинку стула. {w}Подобная бесцеремонность должна была бы разозлить меня, вывести из себя, но вместо этого скорее позабавила и даже заинтриговала."
    th "Интересно, это у него отголоски вчерашнего, или и впрямь ну очень пообщаться приспичило?"
    "Тем временем Славя, выглядевшая так, словно вот-вот расплачется, прикусила губу и зарулила вбок, усевшись с Мику, котрая тут же принялась ей что-то щебетать, восторженно подпрыгивая на месте."
    th "Странно. Что, Славе настолько хотелось со мной позавтракать, или она на Шурика обиделась?"
    th "Впрочем, не суть. Что же, юноша бледный со взором горящим, посмотрим, с чем ты к нам пожаловал."
    me "Ну давай поговорим, раз надо. И приятного аппетита, кстати."
    "Ответил я наконец беспокойно ёрзавшему Шурику, приступая к завтраку."
    me "Так я весь внимание. Какова тема нашей сегодняшней беседы?"
    "Не удержался я от небольшой подколки."
    "Впрочем, мой потенциальный собеседник никак не отреагировал, молча разглядывая овсянку в моей тарелке, так что я понемногу начал беспокоиться."
    th "А ну, как опять на меня набросится, что тогда?"
    sh "Я вчера был в туннелях под старым лагерем."
    "Сообщил наконец мой визави."
    "Я неопределённо пожал плечами, решив пока что ничего не отвечать, а подождать продолжения."
    sh "Скажи, а тебя я там не мог встретить?"
    "От неожиданности я чуть кашей не подавился."
# ГГ сообщает, что да, мог видеть и даже видел. И даже дрался с ГГ, засранец.
# Шурик смущённо принимается извиняться, но бросает на полуслове. "Скажи, а там больше никого не было"
# ГГ отрицает присутствие третьих лиц. "А... с ушами?" "И с ушами тоже. Ты о чём вообще?"
# Шурик признаётся, что полез искать кошкодевочку - "Только ты не смейся, я знаю, что это антинаучно, но сам видел её в лагере, а мне никто не верит!"
# ГГ кошкодевочку не видел, но слышал о ней. Стоит ли так волноваться из-за какой-то легенды.
# Шурик "Наверное... Зря я туда полез, да ещё и..." Мнётся и смущается того, что псих :)
# "Ладно, не бери в голову". ГГ сваливает, оставляя Шурика медитировать над овсянкой. "Какой-то он странный сегодня. Наверное, Виола его вкусными таблетками перекормила."
    
    # сцена - крыльцо столовой.
    "Выйдя из столовой, я первым делом наткнулся на Славю."
    sl "Ой, Сенечка, а я тебя жду!"
    "Заулыбалась она."
    sl "Я тебя попросить хотела немного мне помочь, если ты не занят, конечно!"
    me "Понимаешь, у меня тут уже есть поручение одно..."
    "Замялся было я. Носить круглое, равно как и катать квадратное, мне вовсе не хотелось."
    #show mt серьёзная или недовольная far
    me "...Но что только не сделаешь для товарища!"
    "Моментально передумал я, стоило мне увидеть Ольгу, направлявшуюся ко мне с самым серьёзным видом."
    th "Как пить дать, эта или припашет до самого обеда, или опять примется мозги промывать."
    me "Я готов! Что делать надо?"
    sl "Семён, ты просто прелесть!"
    "Девочка немедленно схватила меня за руку и деловито потащила куда-то мимо удивлённой вожатой."
    #На хозработы со Славей.
    jump alt_day6_uvao_left_dutywork
