План-набросок на левые ветки Д6 (тру и фальш через медпункт или карьер)
"Почти успешное соблазнение"

Медпункт:
Закончилась разборка в медпункте, Лена засыпает/спит, время уже заметно после ужина. Слышно, что началась дискотека.
ГГ отправлен приобщаться к общественной жизни. 

Карьер:
Не знаю пока, как там оно в карьере закончится, но ГГ оказывается на территории лагеря, возможно - даже попадает на ужин.
Отловлен превосходящими силами ОД и направлен танцевать.

Идёт неохотно, но постепенно меняет мнение, приходит уже с намерением поучаствовать.
Практически сразу по прибытии отловлен Славей и вдруг уже оказывается, что они танцуют.
Шиза во время танцев помалкивает или необидно подшучивает-подстрекает.
Славя как будто слегка смущена чем-то. Добрая-ласковая в рамках разумного, откровенно-соблазнительна, но не развратна. Сэма от себя мягко, но решительно не отпускает.
ГГ сначала несколько удивлён, но всё больше поддаётся романтическому настрою. Возможно позаимствовать с купюрами у Автора парочку танцевально-подростковых воспоминаний из _той_ жизни.
После двух-трёх-нескольких танцев зовёт ГГ поговорить наедине и уводит с площади. ГГ чувствует было неловкость, но уже поплыл на гормональном юношеском фоне и не вполне соображает - на этом заостряем внимание.
ГГ за руку уведён в какое-то Укромное Место (темно, так что непонятно, куда именно, да и наплевать уже).

============
Далее, например, такой вариант - это если Славя пускается во все тяжкие.
============

(Шиза далее молчит до оговоренного момента)
Усаживаются на скамеечку, Славя прижимается-обнимает и без особых предисловий начинает сеанс "взрослых" поцелуев.
У ГГ на периферии сознания проносятся какие-то мысли, но мыслительный центр уже сместился к геометрическому центру тела - на этом заостряем внимание.

Через пару минут Славя резко оказывается верхом на коленях ГГ, лицом к нему.
Полный комплекс ощущений ГГ от прильнувшего молодого крепкого соблазнительного девичьего тела в летнем платье со свободным подолом (кажется, про платье и тело, хотя и в более скромных положениях, у Автора было кое-что полезное после дискотеки в Д3).

На фоне упомянутого комплекса ощущений и всё более смелого поведения Слави (на достигнутом останавливаться не собирается, дело явно имеет все шансы закончиться "обменом жидкостями"), у ГГ вновь, помимо ощущений, начинают появляться в голове мысли.
Вероятно, что-то про "неправильно...", "не могу же я вот так вот, запросто...".
Кроме того, Шиза внезапно начинает вбрасывать тревожные фразы про "подозрительно", на которые ГГ огрызается, но тоже начинает тревожиться.

Славя (чувствуя колебания ГГ) переходит в атаку.
ГГ, хотя сперма всё ещё и давит на уши, всё больше теряет настроение и начинает сопротивляться всё активнее, вплоть до попыток оттолкнуть девушку.
В итоге ГГ спихивает Славю с себя на скамейку рядом, но та продолжает держаться мёртвой хваткой, так что они заваливаются на скамейку и уже ГГ оказывается несколько сверху.
Шум возни дополняет пара сдавленных реплик двоякого толкования наподобие "Славя, да подожди ты..." - "Семён, пожалуйста, нет, не надо, ты не понимаешь..." и на сцене немедленно появляется Саныч.
Сделав правильные выводы, он хватает и оттаскивает ГГ за шкирку "Ах гадёныш, ты что делаешь!".

Славя вскакивает и внезапно меняется в лице: "Как я не подумала, это же... Значит, никак не вывернуться, ты же всё равно придумаешь!..". Начинает плакать.
Саныч в ярости рычит и трясёт ГГ. Славя, давясь слезами: "Нет... пожалуйста... отпустите его, это я... это я его сюда... нарочно... это я его... он не... не виноват... я нарочно... я хотела... не виноват... Я НАРОЧНО!!!".

Славя оседает на скамейку в истерике, Саныч обалдевает и отпускает ГГ.
Пауза на полминуты, Славя зашлась уже по-полной, ревёт, прижимая руки к лицу, и раскачивается.
ГГ, проверяя, все ли кости целы: "Борис...э-э-э... Александрович, надо бы её в медпункт, наверное...".
Саныч, разинув рот, смотрит на ГГ.
ГГ: "Я правда не... Ну, в общем...".

Саныч закрывает рот, угрожающе, хотя и неуверенно, бросает: "С тобой потом разберёмся!".
Берёт Славю в охапку и утаскивает в ночь. Наверное, в медпункт.

ГГ садится обратно на лавочку, в голове тепло и гулко.
Сидит некоторое время, потом логическим путём приходит к мысли что "...то ли все бабы дуры, то ли... на этом мысль останавливается." (с)

Придя к универсальному утешительному выводу, снимается с места и наощупь выбирается на дорожку (разумеется, собирая по дороге все ветки, корни, камни и проч.).
Вероятно, оказывается где-то у пристани (или куда там ОД водит ГГ на допрос в другой ветке?).
Настроение отнюдь не паническое после произошедшего - очень уж всё это странно было - а усталое, скорее. Никаких катапульт - заостряем внимание на настроении.

===============
Если решится, что Славе не следует пускаться во все тяжкие, то натыкаются на Саныча в процессе удаления от площади.
Саныч издевается "Куда это вы вдвоём собрались на ночь глядя? Танцы во-о-он в той стороне."
ГГ в злобе и смущении.
Далее Славя внезапно меняется в лице и т.д., см. выше, разве что ревёт без реплик, а ГГ уже и так, оглядевшись, обнаруживает себя возле пристани.
===============

ГГ топчется на месте, но в итоге благоразумно решает пойти и лечь спать, пока ещё какая-нибудь фигня неведомая не приключилась.

Возможно, по дороге слышит местами в кустах любовные шорохи, издали замечает Ульянку, деловито крадущуюся с пожарным ведром, но благоразумно ни во что не лезет, скромненько добирается до домика вожатой и ложится спать.