    #
    # Самая левая ветка, полный набор флагов для выхода к тру-гуду, включая разговор с Мику.
    # После разговора с Мику замечаем недалеко от сцены препирающихся ОД и Алису.
    # Поговорили с Юлей в кустах возле сцены, она косвенно подтвердила воздействие на Лену вечером Д1.
    # ГГ к этому моменту совсем уже заволновался и ищет возможности поднять панику среди старших.
    #
    # сцена - какие-нибудь кусты
    play music music_list["May_There_Always_Be_Sunshine_minus"] fadein 1 #минусовка "Солнечный круг, небо вокруг"
    "Тут со стороны сцены внезапно грянула музыка, разом заглушив шум, производимый десятками пионеров, и несколько детских голосов, вступив невпопад, затянули про \"солнечный круг, небо вокруг\"."
    "Юля подпрыгнула и, задрав хвост, бросилась к крайнему ряду кустов, пытаясь между ветками рассмотреть происходящее на сцене."
    "Поколебавшись, я осторожно спросил у обращённой ко мне части её тела:"
    me "Ну... я пойду тогда?"
    "Юля не соизволила ответить на мой вопрос, лишь нетерпеливо дёрнув хвостом."
    "Я счёл это за знак окончания аудиенции и, рассудив, что всё население лагеря собралось сейчас перед сценой, подался туда."
    # сцена - сцена вечером :)
    "Тихонько выбравшись из кустов за спинами слушателей, я остановился, высматривая Виолетту или Ольгу и стараясь не морщиться от доносящихся их колонок жизнерадостных воплей певцов."
    "Вожатой нигде не было видно, зато белый халат медсестры обнаружился совсем недалеко от меня - Виола в гордом одиночестве восседала на скамейке в последнем ряду."
    "Перебравшись через спинку, я устроился рядом. Как ни странно, Виола никак не отреагировала на моё появление."
    "Даже после того, как я пару раз негромко окликнул её по имени, она не шелохнулась, всё так же пристально глядя куда-то поверх сцены."
    "Мне пришлось помахать у неё перед лицом ладонью, только тогда она вздрогнула и обернулась ко мне."
    me "Виолетта, извините, что отвлекаю, но похоже, у нас возникла проблема..."
    "Тут я заметил, что сидящих перед нами пионеров мой разговор с Виолой явно интересует больше происходящего на сцене и вспомнил о конспирации:"
    me "Понимаете... Мне неловко говорить... Дело в том, что у меня..."
    "Я наклонился к уху медсетры и торопливым шепётом принялся излагать свои подозрения насчёт Лены."
    "Рассказ получился на удивление коротким. Хуже того, произнесённая вслух, вся эта история начала казаться мне самому довольно нелепой - мало ли кто в кого влюбляется по вполне естественным причинам? Так что, заканчивая, я чувствовал себя довольно глупо."
    "Однако Виола слушала меня очень внимательно, ни разу не перебив. Даже когда я упомянул о разговоре с Юлей, она нахмурилась, но промолчала."
    "Выслушав меня, она неподвижно сидела несколько секунд."
    cs "Так."
    "Ни слова больше не говоря, Виола встала и, жестом велев следовать за ней, направилась к дорожке, ведущей к центру лагеря, не обращая внимания на любопытные взгляды.{w} Слегка озадаченный, я поплёлся за ней."
    #Дорожку бы какую-нибудь между кустов. На худой конец сойдёт _та самая_ тропинка в негустом лесу
    $ volume(0.5, 'music') #Проверить fade
    "Лишь пройдя по дорожке пару десятков шагов, так что нас уже не могли видеть собравшиеся перед сценой, она повернулась ко мне и спокойно сообщила:"
    cs "Вообще-то я опасалась чего-нибудь в этом роде."
    me "Что?! Но..."
    cs "Ну а чего ещё можно ожидать, если незадолго до твоего... гм... прибытия энергетический уровень аномалии..."
    "Тут она прервалась и досадливо махнула рукой:"
    cs "Ох, да о чём это я! Сейчас всё это неважно.{w} Вот что: надо чтобы ты как можно скорее нашёл мне Ольгу."
    "Вспомнив, что вожатой среди слушателей концерта заметно не было, я открыл было рот:"
    me "А где..."
    cs "Я думаю, что искать её надо где-нибудь в направлении спортплощадки. Во всяком случае, пять минут назад именно в ту сторону со скандалом убежала Двачевская, а Ольга побежала её догонять."
    cs "Пусть всё бросает и бежит ко мне, в медпункт."
    me "А..."
    cs "Да, и постарайся найти Лену!"
    me "Но как..."
    cs "Да, и потом ещё... Впрочем нет, этим я сама займусь."
    me "Но..."
    cs "Семён, ну чего ты стоишь?! Мне что, самой бежать? В конце концов, кому из нас семнадцать лет, мне или тебе?"
    stop music fadeout 5
    "Уловив намёк, я послушно проглотил все свои незаданные вопросы и, прикинув направление, опрометью бросился туда, преследуемый доносящимися со сцены финальными аккордами песни."
    play music music_list["that_s_our_madhouse"] fadein 1
    $ volume(1.0, 'music') #Проверить fade
    # сцена - библиотека вечером, хорошо бы изобразить тряску
    # фоном - дыхание
    "На полной скорости я пронёсся мимо библиотеки и с ходу вломился в растущий позади неё кустарник."
    # хорошо бы сценой поставить какие-нибудь сплошные ветки, если есть. Тряска
    "Здесь дружно встретившие меня тонкие, но очень цепкие ветки заставили немедленно сбавить темп, да и в лёгких как-то очень быстро начало колоть."
    th "Всё-таки, хилое какое-то тело мне здесь подсунули, мог бы ещё вчера это понять."
    dreamgirl "Ой, можно подумать, {i}там{/i} ты в семнадцать лет был мастером спорта по лёгкой атлетике! Скажи спасибо, что хоть руки-ноги на месте и пальцев полный комплект!" #Или таких Дрищей не берут в космонавты? Уточнить с предисловием и новой версией Д1-3
    me "Спасибо!"
    "Мрачно пропыхтел я вслух, прикрывая лицо от хлещущих ветвей и пытаясь понять, зачем вообще я, как лось, ломлюсь через эти проклятые кусты вместо того, чтобы сделав небольшой крюк, добраться до сплортплощадки по дорожке?"
    "К счастью, прежде чем я успел перейти к мыслям о том, что меня снова запрягли на общественно-полезные работы, ккусты внезапно кончились и я вывалился из них на задворки волейбольной площадки."
    # сцена - спортплощадка днём/вечером или что там есть
    "Остановившись и утирая пот с лица, я окинул взглядом спортплощадку."
    "Очень хотелось надеяться, что мои усилия были не напрасны, и Ольга действительно окажется где-нибудь здесь, а не свернула на полдороги к клубам, например."
    "Мне повезло - на дальнем конце футбольного поля я заметил две жестикулирующие фигуры. Я облегчённо перевёл дух и затрусил к ним."
    "Это действительно были Ольга Дмитриевна и Алиса. Похоже, светская беседа была у них в самом разгаре, но, заметив моё приближение, они обе разом замолчали и уставились на меня."
    # убираем дыхание fadeout 7
    me "Ольга... Дмитриевна!"
    "Выдавил я, остановившись перед ними и безуспешно пытаясь восстановить дыхание."
    me "Вас Виолетта срочно... просила придти к ней в медпункт."
    # surprise у обеих
    "Видя, что вожатая не очень торопится куда-то бежать, я добавил:"
    me "Кажется, ещё один случай, вроде вчерашнего."
    # show mt fear
    "При Алисе большего говорить явно не стоило, но этого и не потребовалось - Ольга разве что не подпрыгнула."
    mt "Чтооо?! Кто... С кем?.."
    me "Давайте я Вам по дороге всё расскажу."
    "Алиса тем временем развернулась и, вздёрнув голову, пошла прочь."
    # hide dv
    "Ольга рванулась было за ней, но тут же остановилась."
    # show mt sad
    mt "Ладно. Пойдём, Семён."
    "И тут меня осенило."
    me "Ольга Дмитриевна, если Вы позволите, то я догоню Вас буквально через пару секунд - если Вы не возражаете, конечно!" #ЛБ: возможно, слишком сильная стилизация под разговорный торопливый преувеличенно вежливый.
    "Вожатая растерянно посмотрела на меня, открыла было рот, чтобы что-то спросить, но потом махнула рукой:"
    mt "Только быстро."
    "Развернувшись, она зашагала к центру лагеря, а я бросился вдогонку за Алисой."
    "Догнав Двачевскую в три прыжка, я схватил её за плечо. Та волчком крутанулась на месте и закричала в полный голос:"
    # show dv rage
    dv "Да не пойду я на ваш дурацкий концерт, понял?!!{w=1} Отвали, придурок!!!"
    with vpunch
    "Сжатые кулаки, тяжёлое дыхание и налившееся кровью лицо не оставляли сомнений, что одно моё неверное слово или дввижение - и она ударит."
    "Слегка опешив, я отступил на шаг назад."
    me "Эй, полегче! Ты чего бесиься? Да плевать мне на все концерты вместе взятые!"
    me "Ты должна как можно скорее найти Лену."
    dv "Да иди ты! Никому я ничего не должна!{w} Тоже мне, нашёл девочку на побегушках! Тебе надо - ты сам и ищи!"
    "Она резко повернулась, явно намереваясь уйти, но отступать так просто я не собирался."
    "Пытаться ещё раз её удержать на месте я не рискнул, а вместо этого бросился за ней."
    me "Алиса, послушай пожалуйста! Это очень важно!"
    "Мне удалось опередить девушку и ей пришлось остановиться, чтобы не налететь на меня."
    "Стараясь не обращать внимания на её сжатые кулаки, я выпалил:"
    me "Это очень важно для Лены, честное слово!"
    # show dv angry
    "Она стояла передо мной, по-прежнему тяжело дыша, но вспышка ярости, похоже, миновала."
    "Глядя на меня исподлобья, она бросила сквозь зубы:"
    dv "И зачем тебе вдруг понадобилась наша распрекрасная Леночка?"
    "Ощущая себя рыбаком, который чувствует по движению поплавка, что рыба осторожно пробует наживку на вкус, я сказал как можно спокойнее:"
    me "Понимаешь, я думаю... да нет, я уверен, что Лена влипла в крупные неприятности."
    me "Рассказать я всё не могу - тем более, что это длинная история - а врать тебе тоже не хочу."
    me "Просто поверь мне на слово - для Лены лучше всего будет как можно скорее оказаться в медпункте."
    "Двачевская посмотрела на меня с подозрением:"
    dv "Ты сам-то понимаешь, что несёшь? В медпункт-то ей зачем?{w}"
    # surprise
    dv "Или это ты сейчас с Олькой про неё говорил?"
    me "Послушай, Двачевская, ты твёрдо уверена, что мне следует тебе лапши на уши навешать, или всё-таки обойдёмся без этого?"
    # angry
    me "Тем более, ты потом сможешь всё у самой Лены узнать."
    dreamgirl "Ну вот, а говорил, что врать не будешь!"
    th "Тихо ты! Я же про прошлое обещал не врать, не про будущее."
    # sad
    "По лицу Алисы было видно, что она ещё колеблется, но уже готова сдаться."
    dv "Ну хорошо, допустим я тебе поверю, но почему именно я должна за Ленкой-то бегать?"
    dreamgirl "Подсекай!"
    "Я широко улыбнулся."
    me "Так кому же ещё, как не тебе? Сама подумай, если я начну Лену искать, то когда я её найду? К Новому году?"
    me "А ты мало того, что лагерь лучше всех знаешь, так наверняка ещё и знаешь, где Лена может быть. Вместо того, чтобы носиться туда-сюда, просто пойдёшь и приведёшь её."
    "Алиса проглотила лесть, не поморщившись. По губам её скользнула самодовольная улыбка."
    dv "Вообще-то, я и в самом деле догадываюсь, где её искать. Есть здесь рядом..."
    "Она оборвала себя на полуслове."
    dv "Неважно. У тебя свои секреты, у меня свои."
    dv "В общем, найти-то я её найду, но с чего ты взял, что она сразу всё бросит и прибежит?"
    dv "Лена каждый год в последний день смены прячется до самой ночи, с чего бы ей в этот раз поступать по-другому?"
    "На это у меня был готов железный ответ:"
    me "А вот это как раз самое простое, тебе даже выдумывать ничего не придётся.{w} Скажи ей, что это {i}я{/i} её ищу.{w} Чистая правда, между прочим."
    "Алиса скептически покачала головой, но спорить больше не стала."
    dv "Ладно, так и быть. Найду я Ленку и передам, что ты просил. Послушает она тебя, или нет - не моя забота, но за тобой всё равно должок будет, {i}новичок{/i}!"
    "Я театральным жестом прижал руки к груди:"
    me "Моя признательность не будет знать границ в пределах разумного!"
    "Двачевская хмыкнула и направилась к обступившим футбольное поле деревьям."
    dreamgirl "А ты не так прост. Кажется, это называется делегированием обязанностей? Далеко пойдёшь."
    "Я устало вздохнул и бросился догонять вожатую."
    #столовая издали днём или вечером
    "Нагнал я её возле столовой. Услышав мой топот, она остановилась и, дождавшись пока я подбегу, с подозрением спросила:"
    mt "И о чём ты с Двачевской говорил?"
    "Держась за бок, в котором от всей этой беготни нещадно кололо, я тем не менее не смог удержаться, чтобы не похвастаться:"
    me "Надо было поскорее Лену найти, вот я Алису и подрядил на это."
    # surprise
    mt "Подожди, а при чём здесь Лена?"
    # fear
    mt "Или... Так это она, что ли, под воздействие попала?"
    # медпункт вечером
    "К тому времени, как мы добрались до медпункта, я успел наконец отдышаться."
    "Выслувшая мой сбивчивый рассказ Ольга, наоборот, раскраснелась и пыхтела как паровоз."
    "Взбежав на крыльцо, она рывком распахнула дверь и вбежала вовнутрь."
    # медпункт изнутри (вечером, если есть, но не ночью)
    # CS недовольная поверх очков, MT angry
    "Слегка притормозив, я вошёл следом за ней и, прикрыв входную дверь, деликатно прислонился к стене возле неё."
    cs "Вообще-то, принято стучать, когда..."
    "Вожатая не дала ей закончить."
    mt "Вообще-то, я с самого начала говорила тебе, что это добром не кончится! Скажи, говорила?!"
    mt "Вот вам, пожалуйста, ещё одно ЧП! Сначала один пионер попал под воздействие, теперь вот ещё Тихонова!"
    "Виолетта окинула её холодным взглядом с ног до головы."
    cs "Да, говорила. А я тебе тогда ещё ответила, чтобы ты не путала обычный пионерский лагерь и полевой спецобъект."
    cs "У нас имеет место активная фаза эксперимента, ради которого всё это и затевалось, между прочим. Ситуация находится под контролем, серьёзно пострадавших нет."
    "Ольга всплеснула руками, но Виола остановила её резким взмахом руки."
    # CS zhi
    cs "А ЧП, моя дорогая, это когда вожатую с физруком застанут на пляже за эээ... аморальными действиями. Вот тогда это, несомненно, ЧП."
    # if (спалились на стоянке в Д5 и за ужином заложили ОД)
        "Я смущённо опустил глаза."
        th "Впрочем, сама виновата! Незачем было на меня наезжать за аморалку!"
    # else
        "Я удивлённо заморгал."
        th "Вот это номер! Но откуда она узнала? Получается, кто-то ещё, кроме Юли, их видел и Виоле заложил?"
    "На слова Виолы вожатая ничего не ответила, только дёрнула головой, словно ей вдруг стал тесен воротник."
    "Помолчав несколько секунд, она произнесла напряжённым голосом, ни на кого не глядя:"
    mt "Да, Виолетта, ты совершенно права. Извини пожалуйста."
    cs "Ничего страшного, нервное напряжение, я всё понимаю. Ты присядь."
    "Она махнула в сторону кушетки и Ольга послушно уселась на неё, всё так же ни на кого не глядя."
    "Виола наконец обратила внимание на меня."
    cs "Очень хорошо, Семён, что ты ввёл Ольгу в курс дела. Это съэкономит нам кучу времени."
    # какой-нибудь страшный грохот, hpunch
    "Дверь с грохотом распахнулась, чуть не пришибив меня, и в медпункт ворвалась Лена."
    "Споткнувшись о порог, она едва не растянулась на полу, но каким-то чудом удержала равновесие."
    "Похоже, весь путь до медпункта, и путь немалый, она проделала бегом. Прижимая руки к груди и полусогнувшись, она выдохнула:"
    un "Где... Где он?!"
    "Виола и вскочившая на ноги вожатая уставились на неё в изумлении."
    mt "Лена, что случилось? О ком ты говоришь?"
    un "Где... Семён?.. Что... с ним?"
    me "Э-э-э... Лена?"
    "Девочка обернулась и наконец заметила меня. Судорожно всхлипнув, она на нетвёрдых ногах сделала шаг ко мне. Я почувствовал, что невольно вжимаюсь в стену."
    un "Ты... Ты не ранен?"
    "Окончательно сбитый с толку, я только и смог выдавить:"
    me "Н-нет...{w=1.0} Что случилось?"
    "Тут ноги у Лены подкосились, и она бы упала, наверное, если бы её не подхватила вожатая и не усадила слабо всхлипывающую девочку на кушетку."
    "Я наконец сумел отклеиться от стенки."
    me "Лена, послушай меня. Почему ты решила, будто со мной что-то случилось?"