# Д6-левая ветка, поиски и расспросы Юли о Лене перед концертом
# Черновик текста
#
# Используется флаг разговора с Мику о Лене alt_uvao_D6_left_MI_talk
#
label alt_day6_uvao_left_ask_UV_about_UN:
    if alt_uvao_D6_left_MI_talk: # Пришли с допроса Мику
    # сцена - сцена издали за кустами
        play ambience ambience_camp_entrance_day fadein 3
        scene bg ext_stage_big_day:
            xalign .48 yalign .48 zoom 0.75
        show bush_frame at truecenter
        with fade 
        "Впрочем, отбежав достаточно далеко, чтобы от сцены меня уже не было видно, я немного сбавил темп, переходя на вялую рысцу."
        dreamgirl "Так где всё-таки ты собираешься искать Юлю? Она же где угодно может оказаться - разумеется, если не умеет вообще в воздухе растворяться и появляться по своему желанию."
        th "Ну... Попытка не пытка. Пробегусь до старого корпуса - может, она там где-нибудь ошивается. Кстати, на стоянку загляну, пожалуй."
        "Я взял немного правее, рассчитывая обойти стороной жилые домики и пробраться к главным воротам позади здания клубов."
    else: # пришли прямо с обеда
        dreamgirl "И где, интересно, ты собираешься искать Юлю? Она же где угодно может оказаться - разумеется, если не умеет вообще в воздухе растворяться и появляться по своему желанию."
        th "Ну... Попытка не пытка. Пробегусь до старого корпуса - может, она там где-нибудь ошивается. Кстати, на стоянку для начала загляну, пожалуй."
        "После обеда мне слишком лень было искать какие-то обходные тропы, поэтому я неспешно направился прямо к главным воротам лагеря."
        # сцена - площадь
    "Пока мне везло - по дороге я никого не встретил. Наверное, одни обитатели лагеря отдыхали после обеда, вторые были заняты подготовкой к концерту или дискотеке, а третьи контролировали первых и вторых."
# сцена - вероятно, здание клубов - ничего ближе к воротам ведь нет?
    "У ворот также вполне ожидаемо никого не оказалось, и я, оглянувшись напоследок ещё раз, протиснулся между полуоткрытыми створками."
# сцена - вид на ворота снаружи
    "Вполголоса позвав неколько раз Юлю и на всякий случай пошарившись немного по кустам, я убедился, что здесь её нет."
    th "Ничего удивительного - еды здесь нет, интересного тоже ровным счётом ничего."
    "Соваться на территорию лагеря не хотелось - не ровен час, кто-нибудь заметит - так что я решил добраться до тропинки к старому корпусу, двигаясь вдоль наружней стороны забора."
# сцена - кусты. Много кустов.    
    "Почти сразу я понял, что идея идти в обход была не самой удачной - густые заросли каких-то кустов вперемешку с молодыми деревцами подступали во многих местах вплотную к забору, так довольно скоро мои руки и ноги украсились свежими царапинами."
    "Наконец через четверть часа мучений, пару раз чудом не разорвав рубашку, я добрался до знакомой уже калитки в заборе."
# сцена - тропинка в ближнем лесу
    "Отдышавшись немного, я затрусил по знакомой уже тропинке."
# сцена - тропинка в густом лесу
    "В лесу со вчерашнего дня мало что изменилось - успевший разогреться воздух с трудом удавалось проталкивать в лёгкие, глаза заливал пот, а за ноги то и дело цепляли корни."
# сцена - СК снаружи днём
    "Добравшись наконец до заросшей бурьяном поляны перед знакомым уже обветшавшим зданием, я пару минут отдыхал, ухватившись за ржавый поручень карусели."
    play sound sfx_carousel_squeak
    "Отдышавшись немного, я сложил ладони рупором."
    me "Юля! {w=1.0}Юля-а-а! {w=1.5}ЮЛЯ!!!"
    "Я замолчал, прислушиваясь. {w=2.0}Никого."
    dreamgirl "И тут из кустов снова вылезает Шурик со своей железякой и, бешено вращая глазами, прёт на тебя!"
    "Вздрогнув, я невольно покосился на обступившие поляну заросли и пошёл ко входу в здание."
# сцена - СК изнутри днём
    dreamgirl "Ты что, собираешься снова обшаривать этот барак? Всерьёз думаешь, что Юля могла не услышать, как ты только что горло драл?"
    th "Так это смотря где она была в этот момент."
    "Добравшись до кабинета начальника, я кое-как подцепил стальную ручку люка и потянул."
    play sound sfx_carousel_squeak
    "Свесившись в темноту открывшейся шахты, я крикнул изо всех сил:"
    me "ЮЛЯ-А-А!"
    "Ответом мне была могильная тишина - даже эхо моего крика умерло, не родившись."
# страшный звук    
    dreamgirl "Сзади!"
    "Я волчком крутанулся на месте, чудом не свалившись в люк. {w} В голове у меня радостно заржали."
    me "Чтоб ты... чтоб тебя..."
    "Сердце отчаянно билось под самым кадыком, в глазах пульсировали красные круги."
    dreamgirl "Прости... Но прямо-таки невозможно было удержаться. {w}Ну не злись, ладно тебе."
    play sound sfx_carousel_squeak
    "Я молча захлопнул люк и, выйдя на улицу, побежал обратно в лагерь."
# сцена - тропинка в густом лесу
    "По дороге я ещё несколько раз звал Юлю - впрочем, совершенно безрезультатно."
# сцена - тропинка в ближнем лесу
    "Добравшись до забора, я решил плюнуть на осторожность и вошёл на территорию как белый человек, через калитку. Ещё одного путешествия вокруг забора я бы сейчас попросту не выдержал."
# scene bg ext_houses_day
    "За то время, пока я бегал по лесу, тихий час давным-давно уже закончился. Впрочем, в лагере почему-то всё равно было пустынно, если не считать нескольких малышей, тотчас же резво умчавшихся, впрочем, куда-то к центру лагеря."
# бурчание в животе
    dreamgirl "Вот тебе и ответ - все сейчас в столовой, на полднике. А ведь там булочки, наверное, опять дают. Или пряники."
    "Голос моего альтер эго, молчавшего всю дорогу к лагерю, звучал немного виновато. В общем-то сейчас и я уже готов был согласиться, что шутка вышла пусть и дурацкая, но довольно смешная - если бы только подшутили не надо мной."
    dreamgirl "Ладно, признаю, идея пугать тебя была неудачной, особенно на раскрытым люком. Если бы ты сверзился-таки в ту шахту и свернул себе шею... В конце-концов, я всего лишь часть тебя."
    th "Вот и постарайся в будущем не забывать про это."
# сцена - площадь днём.
    "Дойдя до площади, я остановился в нерешительности. Юлю найти мне так и не удалось и где её искать дальше - непонятно, да и сил, если честно, уже на это не было."
    th "Нечего делать, пойду в столовую - может, пионеры не всё ещё смолотили."
    "Я решительно повернул направо, к местному храму чревоугодия по-советски."
    uv "Эй! Семён!"
    "Не веря своим ушам, я заозирался вокруг."
    uv "Сюда!"
# вероятно, зум на одну из скамеек и смещённый вниз Юлин спрайт far
    "Юля высунулась из-за скамейки и помахала рукой."
# вероятно, более сильный зум на ту же скамейку и смещённый вниз Юлин спрайт close
    me "Тебя же увидят!"
    "Ахнул я, подбегая и озираясь по сторонам в поисках нежелательных свидетелей. Юля в ответ только легкомысленно отмахнулась."
    uv "Не, не увидят. Ваши все в столовой, едят."
# show uv grin    
    uv "Сегодня пряники дают!"
    "Подтвердила она догадку Шизы, с вожделением облизываясь."
# show uv smile
    uv "А у тебя нет с собой пряников?"
    me "Нет, пряников у меня нет."
# show uv guilty
    uv "Жалко... Я люблю пряники! Даже больше, чем булочки!"
    me "У меня пряников нет, потому что я на полдник не ходил. А на полдник я не попал, потому что искал тебя."
# show uv surprise
    uv "Меня искал? А зачем?"
    me "Понимаешь, я тебя хотел спросить кое о чём..."
# show uv laugh
    uv "Ой, я тебя тоже хотела спросить!"
    "Она схватила меня за руку и потянула за собой."
    uv "Пойдём скорее, я покажу!"
    # сцена, вид из-за кустов
    scene bg ext_stage_big_day:
        xalign .48 yalign .48 zoom 0.75
    show bush_frame at truecenter
    with fade
# show uv normal
    uv "Вот, смотри!"
    "Юля ткнула пальцем в сторону сцены."
    uv "Там сейчас ваши бегали туда-сюда. Им та, с длинными волосами, говорила, что делать. Мику."
    uv "И ещё туда разные штуки принесли."
    if alt_uvao_D6_left_MI_talk:
        uv "И ты принёс, я видела."
# show uv smile
        "Юля заулыбалась, а я мысленно обозвал себя олухом - оказывается, ушастая всё это время сидела совсем рядом, а меня черти невесть куда носили её искать! {w}Голос в голове ехидно хмыкнул:"
        dreamgirl "Искала старушка четырнадцать дней!"
        th "Ну кто же мог знать..."
    me "Там концерт сейчас будет, вот и готовились к нему."
# show uv surprise
    uv "Че...Чего? {i}Коцерт{/i}?"
    me "Концерт. Там, на сцене, будут петь, танцевать и всё такое, а на скамеечках будут сидеть зрители и слушать. Ну, и смотреть, конечно."
# show uv grin    
    uv "Ой, а я знаю, я такое видела раньше! Только не знала, что так называется - \"концерт\""
# show uv laugh
    uv "Я тоже хочу слушать и смотреть!"
# show uv guilty
    uv "Только мне на скамеечку нельзя, там не спрятаться никак."
# show uv grin
    uv "Ну и ладно, я отсюда посмотрю, здесь меня никто не заметит!"
# show uv smile
    uv "А скоро будут петь? Очень хочется послушать!"
    "Глядя, как Юля буквально подпрыгивает на месте от нетерпения, я невольно заулыбался."
    th "Всё-таки она на редкость милое создание! Это просто гремучая смесь чего-то с чем-то!"
    dreamgirl "Конкретно говоря, смесь кошечки и девочки. Или попросту - кавайная няша. Всё-таки знают японцы толк в разных извращениях!"
    th "Японцы..."
    "Я разом помрачнел. За всей этой беготнёй, а затем и болтовнёй, я как-то успел уже подзабыть, зачем вообще искал Юлю."
# фоном - шум толпы    
    "Тем временем к сцене начали подтягиваться конвоируемые вожатыми младшие отряды - видимо, как наиболее дисциплинированные, или просто более послушные."
    uv "Ой, смотри, смотри! Скоро начнут, да?"
    me "Послушай, Юля, так я тебя о чём хотел спросить-то. Помнишь, мы вчера увидели пионера в очках и в люк от него спрятались?"
# show uv normal
    "Юля кивнула."
    uv "Конечно помню. Я его потом испугала."
    me "Ис...испугала?"
    uv "Ну да! Я вернулась обратно, в тот дом. Туда, где люк. Через который мы вниз спускались. Где потом к железной двери шли."
# show uv guilty
    "Юля недовольно помотала головой."
    uv "Ой, с тобой когда говоришь, сколько слов цепляется друг за другом! Ужас!"
    uv "Вот в том доме был этот, в очках."
    me "Шурик?"
    uv "Да, Шурик."
# show uv smile
    uv "Ой, а с именами и правда удобнее. И понятнее. Мне нравится!"
    uv "А у них у всех-всех имена есть?"
    "Юля мотнула головой в сторону всё прибывающих к сцене зрителей."
    me "Конечно у всех."
# show uv surprise2
    uv "Слууушай! А ведь можно и разным вещам имена придумать?! И местам разным!"
    uv "Тогда совсем удобно будет! {w}Вот тот дом старый, где люк, через который мы спускались."
    uv "Давай его назовём... Назовём..."
    me "Старый корпус?"
# show uv normal
    uv "Старый корпус..."
    "Произнесла Юля задумчиво, словно пробуя на вкус."
# show uv smile
    uv "Мне нравится! Тогда ту железную дверь, за которой..."
    me "Подожди, Юля, подожди!"
    "Не выдержал я, видя, что разговор безнадёжно свернул куда-то в сторону и готов растянуться надолго - пока не будут наречены имена всякой вещи и всякой твари поднебесной."
# show uv normal
    me "Мне очень нравится, как ты про имена придумала, очень нравится!"
    me "Но мы про Шурика говорили. Ты сказала, что встретила его в том до... в старом корпусе и испугала. А как?"
# show uv surprise
    uv "Что как?"
    me "Как испугала?"
    "Юля посмотрела на меня с недоумением."
# show uv normal
    uv "Глупости ты спрашиваешь какие-то."
    "Она слегка толкнула меня в плечо."
    uv "Вот я тебя толкнула. Ты же не спрашиваешь, \"как\" - и так понятно."
    uv "А его я просто испугала, и всё. {w}Он мне не понравился. Ходил там, подсматривал. Наверное, он меня поймать хотел!"
# show uv smile
    uv "Семён, ну почему они не начинают?! Я послушать хочу, как поют!"
    "Юля нервно дёрнула хвостом и заёрзала на месте."
    me "Ну ладно, шут с ним, с Шуриком. {w} Лучше скажи мне, а тебе часто людей так пугать приходится?"
    if alt_uvao_D6_left_MI_talk:
        uv "Не-а. Пугать надо, только если меня поймать захотят. Или если мешают."
    # show uv guilty
        uv "Только не всегда получается. {w}Вот я тогда пугала её, и не получилось ничего."
        th "Вот оно!"
        me "А кого пугала-то?"
        uv "Ну эту, у которой волосы цвета ночи."
        dreamgirl "Чего???"
        uv "Ты когда пришёл сюда, в первый день, я вечером к тебе хотела подойти. Ты на лавочке сидел. Очень интересно было."
        uv "А она там сидела и мешала. И с тобой разговаривала. {w} Я её пробовала испугать, но она не испугалась почему-то. Что-то странное получилось, я не поняла ничего."
        me "Подожди, а с \"волосами цвета ночи\" - это ты про кого? Про Мику, которая концерт готовила?"
        "Попробовал я на всякий случай сбить Юлю с толку. Та раздражённо дёрнула ушами."
        uv "Да нет. Говорю же, с волосами!"
        "Юля коротко дёрнула руками в стороны от головы:"
        uv "Лена, вот!"
    # начинается концерт
    jump alt_day6_uvao_left_concert_time    
    
    
# ГГ ищет Юлю
# из бабла: //Старый корпус, стоянка, лес - кошочки нигде нету. После посещения всех трёх локаций находим на площади возле памятника, окликает сама. 
# (особо рассусоливать не стоит, кмк, пробежаться скоренько по локациям и как следует утомиться физически) ГГ находит её в кустах возле площади - окликает оттуда сама, когда ГГ стоит, обречённо стоит, озираясь.
#
# Юля интересуется, что за движуха в лагере.
# ГГ объясняет про концерт, Юля желает смотреть и слушать, тащит ГГ за собой (или ГГ тащится за ней)
#
# ГГ разговаривает с Юлей - та всё выкладывает про вечер первого дня ("- Объясните суду, зачем Вы убили своих родителей? - А чё они???").
# Рассказывает, что хотела подойти к Семёну вечером первого дня, но помешала Унылка.
# Chess: "- Эта та, у которой волосы странные? Сама виновата, нечего мешаться было!"
# Понимаем, что недовольство кошочки причиняет окружающим проблемы.
# ЛБ: кмк, если не знаем про рисунки, то Юля говорит туманнее, либо успевает сказать меньше до начала концерта.

