    #
    # Самая левая ветка, события в медпункте
    #
    # сцена - медпункт вечером снаружи
    "К тому времени, как мы добрались до медпункта, я успел наконец отдышаться."
    "Выслушавшая мой сбивчивый рассказ Ольга, наоборот, раскраснелась и пыхтела как паровоз."
    "Взбежав на крыльцо, она рывком распахнула дверь и вбежала вовнутрь."
    cs "Вообще-то, принято стучать, когда..."
    "Вожатая не дала ей закончить."
    mt "Вообще-то, я с самого начала говорила тебе, что это добром не кончится! Скажи, говорила?!"
    # медпункт изнутри (вечером, если есть, но не ночью)
    # CS недовольная поверх очков, MT angry
    "Слегка притормозив, я вошёл следом за Ольгой и, прикрыв за собой дверь, деликатно прислонился к стене возле входа, стараясь не слишком отсвечивать."
    mt "Вот вам, пожалуйста, ещё одно ЧП! Сначала один пионер попал под воздействие, теперь вот ещё Тихонова!"
    "Виолетта окинула её холодным взглядом с ног до головы."
    cs "Да, говорила. А я тебе тогда ещё ответила, чтобы ты не путала обычный пионерский лагерь и полевой спецобъект."
    cs "У нас имеет место активная фаза эксперимента, ради которого всё это и затевалось, между прочим."
    cs "Произошли некоторые события, не предусмотренные первоначальным планом исследований, но ситуация находится под контролем, серьёзно пострадавших нет."
    "Ольга всплеснула руками, но Виола остановила её резким взмахом руки."
    # CS zhi
    cs "А ЧП, моя дорогая, это когда вожатую с физруком застанут на пляже за эээ... действиями аморального характера. Вот тогда это, несомненно, ЧП на территории пионерского лагеря."
    # if (спалились на стоянке в Д5 и за ужином заложили ОД)
        "Я смущённо опустил глаза."
        th "Впрочем, сама виновата! Незачем было {i}на меня{/i} наезжать за аморалку!"
    # else
        "Я удивлённо заморгал."
        th "Вот это номер! Но откуда она узнала? Получается, кто-то ещё, кроме Юли, их видел и Виоле заложил?"
    "На слова Виолы вожатая ничего не ответила, только дёрнула головой, словно ей вдруг стал тесен воротник."
    "Помолчав несколько секунд, она произнесла напряжённым голосом, ни на кого не глядя:"
    mt "Да, Виолетта, ты совершенно права. Извини пожалуйста."
    cs "Ничего страшного, нервное напряжение, я всё понимаю. Ты присядь."
    "Она махнула в сторону кушетки и Ольга послушно уселась на неё, всё так же ни на кого не глядя."
    "Виола наконец обратила внимание на меня."
    cs "Очень хорошо, Семён, что ты ввёл Ольгу в курс дела. Это съэкономит нам кучу времени."
    "Возможно, мне показалось, но в её голосе прозвучала нотка ехидства."
    # какой-нибудь страшный грохот, hpunch и прочие спецэффекты
    "Дверь с грохотом распахнулась, чуть не пришибив меня, и в медпункт ворвалась Лена."
    "Споткнувшись о порог, она едва не растянулась на полу, но каким-то чудом удержала равновесие, разом очутившись посреди комнаты."
    "Похоже, весь путь до медпункта, и путь немалый, она проделала бегом. Прижимая руки к груди и полусогнувшись, дувушка выдохнула, задыхаясь:"
    un "Где... Где он?!"
    "Виола и вскочившая на ноги вожатая уставились на неё в изумлении."
    mt "Лена, что случилось? О ком ты говоришь?"
    un "Где... Семён?.. Что... с ним?"
    me "Э-э-э... Лена?"
    "Девочка обернулась и наконец заметила меня. Судорожно всхлипнув, она на нетвёрдых ногах сделала шаг ко мне. Я почувствовал, что невольно вжимаюсь спиной в стену."
    un "Ты... Ты не ранен?"
    "Окончательно сбитый с толку, я только и смог выдавить:"
    me "Н-нет...{w=1.0} Что случилось?"
    "Тут ноги у Лены подкосились, и она бы упала, наверное, если бы её не подхватила вожатая и не усадила слабо всхлипывающую девочку на кушетку. Та по-прежнему задыхалась, плечи её ходили ходуном."
    "Виола подошла к стеклянному шкафчику с лекарствами. Покопавшись в нём немного, достала пузырёк с бело-синей этикеткой."
    "По комнате поплыл полузнакомый резковатый запах."
    "В каком-то оцепенении я следил, как капли падают на дно стеклянной мензурки, а медсестра неслышно шевелит губами, считая."
    "Досчитав до двадцати, она покосилась на Лену и добавила ещё десять капель, разбавила водой из графина и протянула девочке."
    cs "Вот, выпей."
    "Лена выставила перед собой руку:"
    un "Н-не... н-не надо."
    "Ольга, дурного слова не говоря, забрала мензурку и залпом проглотила содержимое, поморщившись. Сунув опустевший стаканчик Виоле в руки, она села на кушетку рядом с Леной и, полуобняв её, зашептала на ухо что-то успокаивающим голосом."
    cs "Однако!"
    "Только и выговорила Виола, озадаченно глядя на мензурку, а потом на меня."
    "Я наконец сумел отклеиться от стенки. Подойдя к кушетке, я наклонился к девочке."
    me "Лена, послушай меня. Почему ты решила, будто со мной что-то случилось?"
    "Девочка подняла на меня совершенно круглые глаза."
    un "Мне Алиса сказала, что..."
    "Она всхлипнула. Обычно бледное лицо её шло красными пятнами."
    me "Лена, не волнуйся. Всё хорошо. Всё в порядке, я тебе точно говорю.{w} Так что тебе сказала Алиса?"
    un "Она... Она сказала, что ты в медпункте, и что мне... что мне как можно скорее туда надо придти."
    un "Я подумала... я подумала, что ты... что с тобой..."
    "Вздрогнув всем телом, она снова судорожно всхлипнула и спрятала лицо в ладонях."
    "Я выпрямился. Об остальном и так несложно было догадаться."
    th "Она, конечно, не стала дальше слушать Алису, а всё бросила и помчалась сюда, в медпункт."
    th "Безусловно, женская логика штука сложная, но это, всё-таки, явный перебор. Совершенно ясно, что с  головой у неё неладно."
    dreamgirl "Или она отчаянно в тебя влюблена, что тоже, впрочем, вовсе не свидетельствует в пользу её душевного здоровья."
    "Виолетта, молча следившая всё это время за происходящим, подала наконец голос:"
    cs "Семён, вот что - сбегай-ка ты в столовую и принеси нам всем поужинать."
    "Лена вскинулась было, но Виола заявила решительно:"
    cs "Успокойся.{w=1.5} Никуда он не денется, и ничего с ним на территории лагеря не случится, это я тебе обещаю!"
    "Выудив откуда-то пару судков солидных размеров и сетчатую сумку-авоську, она всучила всё это мне и подтолкнула к выходу."
    cs "Давай-ка, пионер, быстренько. Одна нога здесь, а другая уже в столовой.{w} И да, по дороге можешь не торопиться!"
    "Старательно делая вид, что не замечаю отчаянного взгляда Лены, я кивнул и поспешил освободить помещение."
    # сцена - медпункт вечером снаружи
    "Оказавшись снаружи, я перевёл дух."
    th "\"Быстренько и можешь не торопиться\". Ясное дело, хочет пообщаться с Леной в спокойной обстановке."
    th "Не представляю себе, как они будут с ней объясняться!{w} \"Знаешь, Лена, тебе всё показалось! Вовсе ты ни в кого не влюблена, а просто подверглась воздействию визуализации с хвостом. Не переживай, дело-то житейское!\""
    "Я попытался поставить себя на место бедной девочки и меня передёрнуло."
    dreamgirl "Если уж ты ей так сочувствуешь - вернись и прими участие в беседе!"
    th "Нет уж, спасибо. Виола с Ольгой специалисты - им и карты в руки.{w} Я и в мирной-то жизни обясниться с девушками толком не мог никогда, а тут..."
    "Я решительно повернулся спиной к двери."
    th "Но Олька! Как она это лекарство залихватски тяпнула!"
    "Я захихикал было, но вдруг осёкся.{w} Вспомнил, почему запах показался мне знакомым."
    # текст на весь экран
    $ set_mode_nvl()
    "Поздний вечер, на улице темно."
    "Родители снова поругались."
    "Я, глупый мальчишка, ничего тогда толком понимал и не мог знать того, что глиняные ноги колосса уже подмыла вода, что Советскому Союзу остался год или два до краха.{w} Да и мало кто из взрослых что-то понимал, я думаю."
    "Вот слово \"дефицит\" я знал. И что слипшаяся в бесформенный буроватый ком масса в бумажном кульке называется \"клюквенная пастила\" - тоже. А стоять в очереди лучше вместе с кем-нибудь, потому что - одно кило в одни руки."
    "И что если {i}добытая{/i} в двухчасовой очереди курица окажется {i}с душком{/i}, то можно её так приготовить, что ничего не будет заметно. Ну почти ничего."
    "Вот про то, что на нескольких сотках земли можно самим вырастить картошку, и потом практически одну только эту самую картошку и есть весь год - до следующего урожая - я тогда ещё не знал."
    "И ещё не знал, что скоро двухсотграммовый кусок сыра или пачка масла станет отличным подарком на день рожденья. А вот талоны на продукты тогда уже начали появляться, кажется. Серые, напечатанные на обёрточной бумаге."
    "Но вот про то, что купить что-то всё сложнее и сложнее, а родителям всё чаще задерживают зарплату - про это я знал."
    "Родители, когда ссорились, про это часто... говорили.{w} Наверное, поэтому они и ссорились всё чаще."
    nvl clear
    "Поздний вечер, на улице темно."
    "Родители снова поругались."
    "Отец хлопнул входной дверью и теперь, наверное, курит внизу у подъезда."
    "Мама, с покрасневшими глазами, всё ещё всхлипывая, слегка дрожащей рукой капает себе в маленький  дымчатого стекла стаканчик \"валокордин\"."
    "Сквозь узорный цветной плафон просвечивает лампочка, отбрасывая на стены причудливые тени. По кухне плывёт щекочущий ноздри запах.{w} Я тихонько сижу в уголке."
    nvl clear
    "Мне вдруг стало как-то не по себе."
    th "А я ведь как попал сюда, в этот лагерь, так ни разу про родителей и не вспомнил. Из автобуса тогда попытался до них дозвониться - и всё."
    dreamgirl "{i}Посему оставит человек отца своего и мать свою и прилепится к{/i}...{w=1.5} Слушай, а к кому бы тебе прилепиться? Несолидно как-то!"
    th "Ты мне ещё из Корана процитируй что-нибудь. Для солидности."
    "Огрызнулся я."
    dreamgirl "Из Корана я не могу, ты же его не читал. А память-то у нас общая, к моему огромному сожалению."
    "Я промолчал. Можно было продолжить ругаться с Шизой, но это не могло изменить главного."
    "Я вдруг понял, что про \"оставит человек\" всё уже решено.{w} Решено бесконечное количество раз бессчётным множеством людей."
    # текст внизу экрана
    $ set_mode_adv()
    # горн к приёму пищи
    "Горн напомнил мне, что быстро или медленно, но за едой идти всё-таки придётся. Сунув судки в авоську и постаравшись выкинуть из головы лишние мысли, я поплёлся в столовую."
    dreamgirl "Кстати сказать, на дворе 89-й год, если нам не соврали. Вдруг и здешнему Союзу осталось пару лет доживать? Только ты обживёшься, а оно всё р-р-раз, и пополам!{w} Что ты тогда делать будешь?"
    "Стесняясь собственного малодушия, я робко предположил:"
    th "Ну... Может быть, ещё и обойдётся как-нибудь? Мелких-то различий хватает, может и крупные найдутся?"
    if alt_uvao_D6_CS_vetrov: #ЛБ: может быть, и какой-то другой флаг поставить. Или убрать нерешительную вилку совсем
        th "Хотя... пожалуй, мне-то как раз легче будет выкрутиться, чем им. Это они здесь дети тепличного социализма, а я..."
        dreamgirl "...А ты матёрая акула дикого капитализма, ага!"
        th "Ничего, прорвёмся!"
        "Решительно отрезал я. Внутренний голос хмыкнул, но промолчал."
    else:
        "Внутренний голос скептически хмыкнул, но ничего не сказал."
    #
    # TODO Алиса беспокоится о судьбе Лены - очень уж та резво убежала. ГГ успокаивает, как может
    # сцена - столовая снаружи вблизи вечером
    # show dv sad
    # "На входе в столовую меня перехватила выскочившая откуда-то Алиса. Секунду поколебавшись, она спросила:"
    # dv "С Леной... с Леной всё в порядке?"
    # me "Ну... да"
    # show dv shy
    # /TODO
    #
    # сцена - столовая изнутри вечером
    "В столовой было людно, как и за обедом. Порадовавшись мимоходом, что хотя бы место за столами мне искать сейчас не придётся, я собрался было пробиться на раздачу без очереди, прикрываясь больничными судками, но потом вспомнил, что меня ждёт по возвращении в медпункт."
    "Торопиться разом расхотелось, и я смирно пристроился в хвост очереди за каким-то пионером из второго отряда.{w} Или третьего - кто их разберёт."
    # проверить, как у Автора в дежурстве в столовой отображается voice поварихи
    if alt_day3_duty:
        "Впрочем, через несколько минут я предстал перед знакомой уже по дежурству в столовой поварихой."
        "Увидев меня, она заулыбалась:"
        voice "А, помощничек! А чтой-то ты с судками? В медпункт, да? А поднос где? Сам-то есть не будешь разве?" #ЛБ: напоминаю на всякий случай, что данная гражданка имеет своеобразный говор
        "Услышав, что мне нужны четыре порции ужина в медпункт, она кивнула."
        voice "Тебе, сынок, из какого бачка? Со вкусным или с невкусным?"
        "Посмотрев на мою упавшую челюсть, она гулко захохотала, заколыхавшись всем своим дородным телом."
        "Отсмеявшись и утирая слёзы, она сжалилась наконец надо мной:"
        voice "Тебе общий стол надо, или доктор диету какую велела?"
        me "Ага... общий, да."
        "На ужин оказались тефтели и какая-то сомнительного вида сероватая каша - не то перловая, не то овсяная, не разобрать. Щедро наполнив судки, повариха выудила откуда-то из-за спины четыре тарелки и вилки-ложки."
        voice "На, держи. У доктора тарелок-то нет, я знаю."
    else:
        "Впрочем, через несколько минут я уже предстал перед дородной тёткой в белом поварском костюме."
        "Услышав, что мне нужны четыре порции ужина в медпункт, она с подозрением окинула меня взглядом с ног до головы, но больничные судки в моих руках, похоже, убедили её."
        "Недовольно осведомившись у меня, обычную мне еду надо, или диетическую какую-нибудь, она плюхнула в один судок какую-то сомнительного вида кашу - не то перловую, не то овсяную, не разобрать даже, а в другой - вполне симпатичные на вид тефтели."
        "Поколебавшись немного, повариха сунула мне несколько тарелок и вилки, проворчав:"
        voice "На вот... У доктора-то тарелок нет, я знаю."
    voice "Только смотри, до завтрака чтоб принёс тарелки назад! Вы завтра съедете отсюда, а посуду помыть ещё надо!"
    "Покорно кивнув, я сгрёб всё в авоську и заторопился на выход."
    # сцена - медпункт снаружи вечером
    "Как ни старался я оттянуть момент своего возвращения в медпункт, но чему быть, того не миновать.{w} Потоптавшись немного на крыльце, я наконец постучал и заглянул внутрь."
    # сцена - медпункт вечером изнутри
    # поиграться с освещением - как в scene expression Noir("bg int_dining_hall_people_sunset", brightness = -0.4, saturation = -0.4) at zentercenter
    #  un sad, cs neutral, mt sad
    cs "Заходи, Семён, заходи."
    "Обстановка в медпункте была, мягко говоря, напряжённой.{w} Лена сидела всё там же, на кушетке, с лицом белым, как алебастр."
    "Когда я вошёл, она на долю секунды подняла на меня глаза и тут же уставилась на руки, сцепленные на коленях."
    "Напротив неё вполоборота расположилась на стуле Виолетта Церновна. Ольга примостилась на краешке стола с таким угрюмым выражением лица, словно ей сообщили о разжаловании в октябрята."
    "Пауза затягивалась. Кашлянув, я промямлил наконец:"
    me "Вот я здесь... Ужин принёс."
    "Я не нашёл ничего лучшего, чем в подтверждение своих слов продемонстрировать авоську с судками."
    cs "Что же, давайте ужинать."
    "Поднявшись и согнав со стола Ольгу, она принялась освобождать на нём место для судков и тарелок."
    "При виде каши Виола слегка скривилась, но всё-таки вылоложила понемногу на тарелки и всучила одну из них Лене, всё так же упорно не поднимающей головы. Девочка покорно взяла тарелку и вилку, но не сделала ни малейшей попытки притронуться к еде, целиком сосредоточившись теперь, судя по всему, на разглядывании содержимого тарелки."
    "Со стоическим выражением на лице Виола взяла свою порцию, жестом приглашая нас с Ольгой последовать её примеру и вновь уселась на стул."
    "Чувствуя, что при одном взгляде на еду меня начинает мутить, я распахнул дальнее окно, и уселся на подоконник, прижавшись затылком к стеклу открытой створки и отставив тарелку подальше от себя."
    "Большого облегчения, однако, это не принесло. Воздух в кабинете казался словно бы наэлектризованным - кажется ещё чуть-чуть, и с лёгким потрескиванием волосы встанут дыбом. Начинающиися сумерки ещё больше усиливали ощущение наваливающейся тяжести, давящей на плечи и не дающей вдохнуть."
    # сцена - медпункт изнутри ночью
    "Пробормотав что-то Виолетта встала и щёлкнула выключателем. Под потолком с показавшимися мне оглушительными гулкими ударами и жужжанием проснулись светильники и залили медпункт ярким белым светом. Сумрак на улице тут же словно бы сгустился, и разглядеть что-либо за оконными стёклами стало невозможно."
    th "Весело, как в покойницкой."
    "Подумал я, наблюдая за Ольгой, которая меланхолически помешивала кашу в своей тарелке, не делая, впрочем, никаких попыток её попробовать. Аппетита у неё явно было не больше, чем у меня."
    $ meet('uv','Голос')
    uv "Вот ты где!"
    # hide cs, un, mt
    # show uv sad
    "Чуть не свалившись от неожиданности с подоконника, я обернулся. С улицы на меня практически в упор смотрела Юля. Как она подошла я не слышал - впрочем, чего ещё ожидать от кошки?"
    $ meet('uv','Юля')
    uv "Я тебя везде ищу..."
    "Начала было она недовольно и вдруг замолчала, принюхиваясь."
    uv "А что это у тебя?"
    "При виде тарелки глаза её восхищённо раскрылись."
    # show uv laugh
    uv "Котлета?!"
    "Через мгновенье тефтели исчезли у неё во рту."
    uv "М-м-м! А у тебя там ещё есть, я чую!"
    "С этими словами она легко перемахнула подоконник и спрыгнула на пол медпункта."