# Д6-общение с Виолой в медпункте и допрос Шурика
#
# используется флаг выхода на тру-энд alt_uvao_true
#
label alt_day6_true_CS_talk:
	# Долгий разговор с Виолой под чай с печеньками
	"Вволю наумывавшись ледяной водой, я направился к медпункту как был - прямо с полотенцем. Ничего, свои люди."
	"Впрочем, подойдя к двери, я всё-таки решил постучаться. Как-никак, медицинский кабинет, мало ли что…"
	cs "Открыто, открыто!"
	me "Доброе утро, Виолетта!"
	"Увидев меня, Виолетта рассеянно помахала рукой:"
	cs "Подожди, я сейчас…"
	"…И снова забарабанила по клавиатуре передового достижения отечественного компьютеростроения."
	"К некоторому моему удивлению, Шурика в медпункте видно не было."
	"Я уселся на кушетку и приготовился ждать."
	th "Интересно, где Шурик? Наверное, его уже выпустили."
	dreamgirl "Или наоборот, у него опять сорвало крышу и он убежал в леса."
	"Я поёрзал на жестком гладком покрытии кушетки, безуспешно пытаясь устроиться поудобнее."
	th "Если бы меня на ночь уложили спать на это прокрустово ложе, я бы тоже сбежал, пожалуй!"
	"От скуки я покосился на монитор. Кажется, такие назывались алфавитно-циферными?{w} Жаль, я в подобных раритетах не разбираюсь."
	dreamgirl "Не \"циферный\", а алфавитно-цифровой."
	"Прозвучал в голосе надзидательный голос Шизы."
	dreamgirl "Забавно - память у нас общая на двоих, но почему-то пользоваться ей как следует умею только я."
	th "Это называется разделение обязанностей. Я занимаюсь сложными мыслительными процессами. Не барское это дело - отвлекаться на всякую рутину."
	"Препираться с собственным подсознанием было довольно странным занятием, но люди со скуки чего только не делают."
	"Кажется, Шизе тоже было скучновато, потому что довольно скоро мой внутренний голос поинтересовался:"
	dreamgirl "Кстати, а зачем тебе разбираться в этом хламе, который здесь считают за компьютеры?"
#
	th "Ну… Смог бы больше узнать об уровне {i}их{/i} технологического развития.{w} Пока что всё, что я здесь видел, не даёт никаких стоящих привязок."
# здесь дополнить про тот же "Икарус", например...
	dreamgirl "Ну так и комп этот ни о чём не говорит. Может он новейшей модели, а может - старьё убогое, которое просто выбросить жалко."
	"Довод был веским, возразить было особенно нечего. Я мысленно вздохнул:"
	th "Ну, может, хоть покопался бы в документах на нём, приведись такой случай. А так непонятно даже, что и как там запускать…"
	cs "Всё!"
	"Нанеся несколько особенно резких ударов по клавишам, Виола выключила компьютер."
	cs "Ох, если бы ты знал, пионер, насколько у меня из-за всего этого прибавилось бюрократической волокиты!"
	"Она откинулась на спинку стула и вволю потянулась.{w} Я поспешно перевёл взгляд на таблицу для проверки зрения."
	cs "Мне и так хватает регулярной писанины, а после вчерашних подвигов Александра я теперь до осени буду отчёты писать."
	"Она села нормально и осуждающе посмотрела на меня:"
	cs "Вот скажи мне, Семён, неужели нельзя было без обойтись без этой беготни?"
	"Впрочем, увидев моё возмущённое лицо, Виола поспешила сменить гнев на милость:"
	cs "Ладно, ладно, не обижайся!{w} Я знаю, что ты здесь не при чём, наоборот, проявил себя героем и всё такое.{w} Просто если что-то мне и не нравится в моей работе, так вся эта вот писанина."
	"Она недовольно поморщилась - похоже, это действительно было для неё больной темой.{w} Потом кивнула на монитор перед собой:"
	cs "Спасибо, хоть эту железяку выделили, писать всё это от руки было бы просто адской мукой."
	me "Ну, если у Вас {i}медицинский{/i} почерк…"
	"Почувствовав, что хватил несколько через край, я поспешно заткнулся, но Виолетта только рассмеялась:"
	cs "В точку, пионер, в точку! Здесь у нас с начальством действительно была вполне обоюдная заинтересованность."
	"Решительно отвернувшись от стола, она заявила:"
	cs "Вот что! Я уже часа два как на ногах, и изрядно проголодалась.{w} Да и тебя на завтрак лучше не отпускать, а то убредёшь куда-нибудь."
	"Отмахнувшись от моих возражений, она продолжила:"
	cs "…Поэтому предлагаю позавтракать прямо здесь и перейти наконец к {i}делу{/i}."
	"Сделав ударение на последнем слове, она искоса взглянула на меня, и, видимо, удовлетворившись достигнутым эффектом, продолжила как ни в чём не бывало:"
	cs "Уверена, у тебя накопилось достаточно вопросов.{w} На некоторые из них у меня даже найдутся ответы."
	cs "Пошарь-ка под изголвьем кушетки, там должна быть плитка. Керамическая."
	"Изрядно озадаченный, я заглянул под кровать. Действительно, там обнаружилась солидных размеров облицовочная плитка, которую я и извлёк на свет божий."
	"Тем временем Виола встала и, покопавшись в одном из своих шкафчиков, извлекла оттуда солидный аллюминиевый чайник и, почему-то, провод."
	#Чайййник! https://ru.wikipedia.org/wiki/%D0%AD%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D1%87%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA#/media/File:%D0%9D%D0%B5%D0%B0%D0%B2%D1%82%D0%BE%D0%BC%D0%B0%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D1%8D%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%BE%D1%87%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA.jpg
	dreamgirl "Ух ты, а вот это и вправду раритет!"
	"Наполнив чайник водой, Виола отобрала у меня плитку и положила её на стол. Водрузив чайник сверху, она кивнула на мой недоумённый взгляд:"
	cs "Противопожарная безопасность! Учись, студент!"
	"Сзади у чайника обнаружился керамический разъём. Подключив к нему один конец шнура, Виолетта воткнула другой в розетку и, удовлетворённо кивнув, подошла к холодильнику."
	"…"
	"Как оказалось, в холодильнике и в ящиках стола можно было найти не только лекарства, так что через десять минут мы уже пили крепкий чай с бутербродами с сыром и хрустели печеньем \"Юбилейное\""
	"Когда с едой было покончено, заметно подобревшая Виола благосклонно кивнула:"
	cs "Спрашивай."
	#//Шурик проснулся утром и был выпущен умываться-завтракать
	# Вопросы и Ответы
	# Не забываем про эффект Ветрова
	$ alt_uvao_D6_CS_vetrov = True
#
	jump alt_day6_true_SH_exam
	
label alt_day6_true_CS_talk_short:
	# Короткий разговор с Виолой
	# Про эф.Ветрова не узнаём

label alt_day6_true_SH_exam:
	# Приходит Шурик
	#//Шурик проснулся утром и был выпущен умываться-завтракать
	# допрос Шурика
	#//Аккуратно расспрашивем с Виолой на предмет взаимодействия с аномалией
