# Д6-общение с Виолой в медпункте и допрос Шурика
#
# Устанавливает флаг Полной Информированности alt_uvao_D6_CS_vetrov
#
label alt_day6_true_CS_talk:
    # Долгий разговор с Виолой под чай с печеньками
    "Вволю наумывавшись ледяной водой, я направился к медпункту как был - прямо с полотенцем через плечо. Ничего, свои люди."
    "Впрочем, подойдя к двери, я всё-таки решил постучаться. Как-никак, медицинский кабинет, мало ли что…"
    cs "Открыто, открыто!"
    # входим
    me "Доброе утро, Виолетта!"
    "Увидев меня, Виолетта рассеянно помахала рукой:"
    cs "Да, доброе… Сядь куда-нибудь, я сейчас…"
    "И она снова забарабанила по клавиатуре передового достижения отечественного компьютеростроения."
    "К некоторому моему удивлению, Шурика в медпункте видно не было."
    "Я уселся на кушетку и приготовился ждать."
    th "Интересно, где Шурик? Наверное, его уже выпустили."
    dreamgirl "Или наоборот, у него опять сорвало крышу и он убежал в леса."
    "Я поёрзал на жестком гладком покрытии кушетки, безуспешно пытаясь устроиться поудобнее.{w} Если бы меня на ночь уложили спать на это прокрустово ложе, я бы тоже сбежал, пожалуй!"
    th "Главное, чтобы на этот раз {i}не меня{/i} отправили за ним бегать. Вчерашних впечатлений мне вполне достаточно."
    "Заскучав, я покосился на монитор. Кажется, такие назывались алфавитно-циферными?{w} Жаль, что я в подобных раритетах не разбираюсь."
    dreamgirl "Не \"циферный\", а алфавитно-цифровой."
    "Прозвучал в голосе надзидательный голос Шизы."
    dreamgirl "Забавно - память у нас общая на двоих, но почему-то пользоваться ей как следует умею только я."
    th "Это называется разделением обязанностей. Я занимаюсь сложными мыслительными процессами. Не барское это дело - отвлекаться на всякую рутину."
    "Препираться с собственным подсознанием было довольно странным занятием, но люди со скуки чего только не делают."
    "Кажется, Шизе тоже было скучновато, потому что довольно скоро голос в моей голове поинтересовался:"
    dreamgirl "Кстати, а зачем тебе разбираться в этом хламе, который здесь считают за компьютеры?"
#
    th "Ну… Смог бы больше узнать об уровне {i}их{/i} технологического развития.{w} Пока что всё, что я здесь видел, не даёт никаких стоящих привязок."
    th "Тот же \Икарус\", например - он может и на тридцать лет устареть, а его всё будут использовать, если только не развалится раньше."
    dreamgirl "Ну так и комп этот ни о чём не говорит. Может быть, он последней модели, а может - старьё убогое, которое попросту выбросить жалко."
    "Довод был веским, возразить было особенно нечего. Я мысленно вздохнул:"
    th "Ну, может, хоть покопался бы в документах на нём, приведись такой случай. А так непонятно даже, что и как там запускать…"
    cs "Всё!"
    "Нанеся несколько особенно резких ударов по клавишам, Виола выключила компьютер."
    cs "Ох, если бы ты знал, пионер, насколько у меня из-за всего этого прибавилось бюрократической волокиты!"
    "Она откинулась на спинку стула и с удовольствием потянулась.{w} Я поспешно перевёл взгляд на таблицу для проверки зрения."
    cs "Мне и так хватает регулярной писанины, а после вчерашних подвигов Александра я теперь до осени буду отчёты писать."
    "Она села прямо и осуждающе посмотрела на меня:"
    cs "Вот скажи мне, Семён, неужели нельзя было обойтись без этой беготни?"
    "Впрочем, увидев моё возмущённое лицо, Виола поспешила сменить гнев на милость:"
    cs "Ладно, ладно, не обижайся!{w} Я знаю, что ты здесь не при чём, а наоборот, проявил себя героем, и всё такое.{w} Просто если что-то мне и не нравится в моей работе, так эта вот писанина."
    "Она недовольно поморщилась - похоже, это действительно было для неё больной темой.{w} Потом кивнула на монитор перед собой:"
    cs "Спасибо, хоть эту железяку выделили, писать всё это от руки было бы просто адской мукой."
    me "Ну, если у Вас {i}медицинский{/i} почерк…"
    "Почувствовав, что хватил несколько через край, я поспешно заткнулся, но Виолетта только рассмеялась:"
    cs "В точку, пионер, в точку! Здесь у нас с начальством действительно была вполне обоюдная заинтересованность."
    "Решительно отвернувшись от стола, она заявила:"
    cs "Вот что! Я уже часа два как на ногах, так что изрядно проголодалась.{w} Да и тебя на завтрак лучше не отпускать, а то убредёшь куда-нибудь…"
    "Отмахнувшись от моих возражений, она продолжила:"
    cs "…Поэтому предлагаю позавтракать прямо здесь и перейти наконец к {i}делу{/i}."
    "Сделав ударение на последнем слове, она искоса взглянула на меня, и, видимо, удовлетворившись достигнутым эффектом, продолжила как ни в чём не бывало:"
    cs "Уверена, у тебя накопилось достаточно вопросов.{w} На некоторые из них у меня даже найдутся ответы."
    cs "Но сначала - завтрак! Пошарь-ка под изголовьем кушетки, там должна быть плитка. Керамическая."
    "Изрядно озадаченный, я заглянул под кровать. Действительно, там обнаружилась солидных размеров облицовочная плитка, которую я и извлёк на свет божий."
    "Тем временем Виола встала и, покопавшись в одном из своих шкафчиков, достала оттуда приземистый аллюминиевый чайник и, почему-то, провод."
    #Чайййник! https://ru.wikipedia.org/wiki/%D0%AD%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D1%87%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA#/media/File:%D0%9D%D0%B5%D0%B0%D0%B2%D1%82%D0%BE%D0%BC%D0%B0%D1%82%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9_%D1%8D%D0%BB%D0%B5%D0%BA%D1%82%D1%80%D0%BE%D1%87%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA.jpg
    dreamgirl "Ух ты, а вот это и вправду раритет!"
    "Наполнив чайник водой, Виола отобрала у меня плитку и положила её на стол. Водрузив чайник сверху, она кивнула на мой недоумённый взгляд:"
    cs "Противопожарная безопасность! Учись, студент!"
    "Сзади у чайника обнаружился керамический разъём. Подключив к нему один конец провода в матерчатой изоляции, Виолетта воткнула вилку на другом его конце в розетку и, удовлетворённо кивнув, подошла к холодильнику."
    "…"
    "Как оказалось, в холодильнике и в ящиках стола можно было найти не только лекарства, так что через десять минут мы уже пили крепкий чай с бутербродами с сыром и хрустели печеньем \"Юбилейное\""
    #//Шурик проснулся утром и был выпущен умываться-завтракать
    me "Виола, скажите, а как у Шурика дела?"
    "Поинтересовался я, не отрываясь от еды. Медсестра отмахнулась от меня кусочком печенья:"
    cs "Да нормально всё с вашим Трофимовым. Отоспался, и теперь бодрый как огурчик.{w} Психосоматика у него в порядке, разве что налицо спутанность воспоминаний о вчерашнем дне."
    cs "Я пока что его отправила отсюда, чтобы не мешался. Велела перед обедом заглянуть, попробую его разговорить - может и вспомнит что-нибудь."
# Возможно, нужно больше умных букв про состояние Шурика и причины оного. Всё-таки медик-научник.
    "Когда с едой было покончено, заметно подобревшая Виола благосклонно кивнула:"
    cs "Спрашивай."
    me "Э-э-э… Виолетта, а может быть, лучше Вы мне сначала расскажете что-нибудь? Обрисуете в общих чертах, так сказать?"
# Вопросы и Ответы
# Не забываем про эффект Ветрова
#
# Узнаём, что завтра - последний день смены, выходя на это через обсуждение этапа ассимиляции в точке прокола - ГГ интересуется, что будет лично с ним - "А вот завтра и узнаешь, пионэр".
# ВЦ выражает заметную уверенность как в успешности первого этапа ассимиляции, так и последующей интеграции в общество, обосновывая, в частности, некоторым житейским опытом героя "Тебе сколько лет-то, пионэр?" - "Ээээ... Семнадцать?" "Ну да, так всем и говори. Мало ли что там в каком-то странном паспорте написано."
    
    $ alt_uvao_D6_CS_vetrov = True
#
    jump alt_day6_true_SH_exam
    
label alt_day6_true_CS_talk_short:
    $ alt_uvao_D6_CS_vetrov = False
    # Короткий разговор с Виолой
    # Про эф.Ветрова не узнаём
    #
    # Зато узнаём, что завтра - последний день смены (ВЦ сожалеет, что ГГ пришёл так поздно, времени, мол, и так мало осталось)
    "Когда я добрался наконец до медпункта, время уже явно приближалось к полудню."
    "Подойдя к двери, я решил постучаться. Как-никак, медицинский кабинет, мало ли что…"
    cs "Открыто!"
    # входим
    me "Добрый день, Виолетта!"
    "Увидев меня, Виолетта нахмурилась."
    cs "Я уже думала, ты вовсе не придёшь. Что, так сильно напугала тебя вчера на ужине, или у тебя утро начинается с полудня?"
    me "Да я…"
    cs "Ладно, садись. Чай будешь?"
    "Виола кивнула на стоящий на письменном столе странноватого вида чайник, суда по проводу - электрический."
    me "Да спасибо, я только что поел…"
    "Промямлил я, усаживаясь на краешек кушетки. Виола слегка подняла одну бровь, но больше своё удивление тем, что я успел где-то подкрепиться, никак не показала."
    cs "Ну что же, тогда к делу. Времени не так много, скоро Трофимов должен придти, я его ещё с утра выпроводила позавтракать и подышать воздухом, чтобы не мешался здесь, велела перед обедом зайти."
    "Она вновь одарила меня недовольным взглядом, явно досадуя на моё опоздание, и я поспешил увести разговор несколько в сторону:"
    me "Ой, да, Шурик! Как у него дела, кстати? Не бузил больше?"
    cs "Да нормально всё с вашим Трофимовым. Отоспался, и теперь бодрый как огурчик.{w} Психосоматика у него в порядке, разве что налицо спутанность воспоминаний о вчерашнем дне."
    cs "Как придёт, я попробую его разговорить - может и вспомнит что-нибудь."
    me "Так, может быть, я потом к Вам зайду, когда времени побольше будет?"
    cs "Потом времени не будет вовсе. Завтра ведь последний день смены, ты не знал?"
    "От неожиданности я чуть на месте не подпрыгнул."
    me "Как последний? Меньше недели ведь прошло!"
    cs "Ну так ты и… гм… прибыл сюда не к началу смены. Сегодня прощальные ужин и дискотека, а завтра на автобус до райцентра - и по домам."
    "Я почувствовал, что в глазах темнеет."
# Здесь нужна рефлексия о том, как мало успелось и хочется ли возвращаться назад.
    me "Виола, скажите…{w=1} А я что, тоже… домой?"
    window hide
    $ set_mode_nvl()
    window show
    "Последнее слово далось мне с неожиданным трудом. Я вдруг отчётливо понял, что язык не поворачивается назвать приютившее меня до этого место - домом."
    th "Да, именно приютившее. Место, где можно спать и хранить одежду, для которой сейчас не сезон, - и только. Место, куда приходишь потому, что больше идти некуда, а не потому, что хочешь туда придти.{w} Место, где меня никто не ждал и не будет ждать."
    "Голос Шизы в моём мозгу прозвучал спокойно и как-то даже буднично:"
    dreamgirl "Подумай-ка лучше вот о чём - весь {i}тот{/i} мир - можешь ли ты назвать его своим домом?{w} А главное - хочешь ли ты его так называть?"
    dreamgirl "Что связывает тебя с ним? Работа, которая тебе неинтересна и неприятна ровно настолько, чтобы её можно было терпеть? Те несколько человек, которые считаются твоими друзьями только потому, что ты всё ещё не удалил их номера из телефона?"
    dreamgirl "Аноны всех мастей, эти призраки по ту сторону экрана, которым нет никакого дела до тебя, а тебе - до них?{w} Подумай."
    th "Но ведь и здесь я чужой! Здесь меня тоже никто не ждёт и никому до меня нет дела!"
    dreamgirl "Ты прав.{w} Почти прав. Тебе совсем нетрудно будет отгородиться ото всех стеной безразличия, ты неплохо освоил это умение, и тебя рано или поздно оставят в покое."
    dreamgirl "Однако, если тебе удастся ухватиться за этот шанс, ты сможешь попробовать сделать что-то иначе."
    dreamgirl "Вспомни, всем ли людям, встреченным тобой за эти несколько дней, не было до тебя никакого дела?"
    dreamgirl "Да, с тобой никто не нянчился и на руках не носил. Да, над тобой подшутили пару раз не самым приятным образом - но именно подшутили, тебе не желали зла по-настоящему."
    dreamgirl "Зато когда ты из-за этих шуток остался голодным - тебя накормили. Помогли не по обязанности, а просто потому, что тебе была нужна помощь."
    dreamgirl "Кстати, когда тебе вчера чуть не устроили внеплановую проверку содержимого черепа - никто ведь не заставлял Лену тебя спасать. Просто она могла помочь - и сделала это."
    th "Если уж на то пошло, если бы меня вчера не припахали к этим поискам, то мне вообще ничего бы не угрожало!"
    dreamgirl "Это так, но что странного в том, что люди, готовые тебе помочь {i}просто так{/i}, ожидают того же самого и от тебя?{w} Не потому, что ты у них в долгу, а просто потому, что кому-то нужна помощь, а ты можешь помочь."
    th "Тебя послушать, так здесь просто идеальное общество какое-то! Царствие небесное на земле! Все люди братья, все помогают друг другу!"
    dreamgirl "Ну разумеется, нет. Заметь только, что и не каждый человек другому обязательно - волк. Подумай, хочешь ли ты быть кому-то нужным и готов ли к тому, что кто-то снова будет нужен тебе?"
    dreamgirl "Так что ещё раз повторю - ты можешь попытаться сделать что-то иначе."
    dreamgirl "Умный учится на чужих ошибках, дурак - на своих. А как называется тот, кто не учится ни на чьих?"
    window hide
    $ set_mode_adv()
    window show
    cs "Да, Семён, ты завтра тоже отправишься домой, это вне всякого сомнения."
    "Подала наконец голос молчавшая всё это время Виолетта."
    "Я внезапно почувствовал, что не могу вздохнуть, словно чьи-то крепкие бесжалостные руки сжали горло, начисто перекрыв кислород."
    th "Неужели эта нелепая фантазия о возможности остаться здесь, этот призрачный шанс, упомянутый Шизой, так уж нужны мне?"
    "Не сводящая с меня глаз Виола вдруг слегка улыбнулась."
    cs "Впрочем, я не возьмусь сказать наверняка, где именно окажется этот самый дом, куда ты отправишься - это будет зависеть только от тебя."
    "Вероятно, моё лицо в этот момент представляло собой то ещё зрелище, потому что она несколько секунд с явным интересом меня разглядывала, прежде чем пуститься в объяснения."
    cs "Видишь ли, то, что ты попал в этот лагерь, да и вообще в наш мир - не совсем случайно. Такое случается время от времени с людьми, которые там, {i}у вас{/i}, не имеют крепких социальных связей, привязанностей, постоянно чувствуют себя ненужными."
    cs "Разумеется, такое происходит далеко не со всеми, на наше счастье - иначе здесь уже не повернуться было бы от попаданцев."
    "Тут она улыбнулась немного виновато и развела руками."
    cs "Надеюсь, ты простишь мне профессиональный жаргон - \"попаданцы\". Не слишком-то благозвучно, но официальное \"лица, непроизвольно осуществившие переход через точку прокола\" даже руководство избегает употреблять."
    "Я слабо кивнул, и Виола продолжила:"
    cs "Ну так вот, человека, слабо привязанного к своему родному миру, иногда может, скажем так, \"притянуть\" сюда. Причём это обычно происходит в местности с достаточно большим количеством благожелательно настроенных людей, готовых принять появление новичка за естественное событие."
    cs "Чаще всего это случается на курортах, в домах отдыха каких-нибудь. Ну или как здесь, например, - в пионерском лагере."
    "Тут она посмотрела на меня с некоторым сомнением и осведомилась:"
    cs "Я не слишком заумно объясняю? Пока что всё понятно?"
    "Кажется, Виола вплотную подошла наконец к весьма важному для меня моменту, так что я лишь нетерпеливо отмахнулся:"
    me "Да понятно всё, понятно! Понял я про этих… попаданцев. Что дальше-то происходит с ними? Вернее, с нами…"
    "Виола усмехнулась моей нетерпеливости и продолжила:"
    cs "А дальше начинается процесс адаптации. Если он заканчивается успешной ассимиляцией, то в нашем мире становится на одного человека больше."
    cs "Если попаданцу не удалось здесь адаптироваться, то его выбрасывает обратно в родной мир."
    me "И что же нужно для этой самой… успешной адаптации?"
    "Я затаил дыхание в ожидании ответа, но Виола лишь пожала плечами:"
    cs "Да ничего особенного, по большому-то счёту. Достаточно, чтобы человек действительно захотел остаться."
    cs "Человек попадает сюда, только если он чужой {i}там{/i} и остаётся, если почувствует себя своим {i}здесь{/i} "
    cs ""
    cs ""
    cs ""
    
    "В первое время попаданец сильно связан с местом перехода, так что"
    me "И что, вот так вот всё просто? "

label alt_day6_true_SH_exam:
    # Приходит Шурик
    #//Шурик проснулся утром и был выпущен умываться-завтракать
    # допрос Шурика
    #//Аккуратно расспрашивем с Виолой на предмет взаимодействия с аномалией
    # Шурик увлечённо врёт, что пошёл за радиодеталями, говорит, что не нашёл спуск в _бомбоубежище_.
    # Далее явно врёт, что пошёл было обратно в лагерь, а дальше - не помнит.
    # Задумываемся о том, где он шлялся всё время, пока за ним не пришли. Скрывает, собака!
    # ВЦ на Шурика не давит, добра и гуманна.
    # В итоге выгоняет ГГ и Шурика отдыхать и наслаждаться.
