init:
    $ alt_uvao_D6_lake = False

label alt_day6_uvao_fuckoff_mt:
    "Интересно, зачем же я понадобился нашей вожатой, да ещё так срочно? Неужели она сочла мое нынешнее наказание слишком мягким и хочет поручить еще что-то?"
    th "Нет уж, спасибо, что-то я не в настроении мешки таскать. И к тому же - Юля ждёт!"
    "Лучше вообще включить режим \"стелс\" и пропасть с радаров. А то с её-то безудержной энергией в плане припахивать бездельников к общественно полезной деятельности - с неё станется прибежать и утащить меня силком!"
    # какой-нибудь фон с ругающейся ОД, с эффектом воспоминаний
    "Я невольно улыбнулся, вспомнив Ольгу. Почему-то не мог, даже мысленно, назвать её Ольгой Дмитриевной, ведь она даже чуть младше меня настоящего."
    th "Говорят, что Ольга сама выросла в этом лагере. Интересно, каким ребёнком она была? Наверняка кипучим и деятельным. И звали её просто Олька. Олька-ракета. Или Олька-метеор…"
    scene bg ext_stage_normal_day
    "Так, что-то я отвлёкся… Сейчас прежде всего надо убраться отсюда и как можно быстрее. А для этого мне требовалась помощь."
    "Я поспешил к кустам, в которых скрылась Ульянка."
    me "Эй, мелкая ! Ульяна, где ты там? Обожди! Дело есть."
    "Не хотелось бы снова гоняться за ней по всему лагерю , как в тот раз - после попытки накормить меня экзотическим лакомством в столовой."
    "Поэтому, услышав шуршание кустов, в которых парой минут назад она, казалось бы, бесследно растворилась, я облегчение перевел дух."
    show us grin sport at right with easeinright
    "Ульяна выглядывала на меня оттуда парой озорных глаз, любопытных донельзя."
    us "Какое такое дело?"
    "Я усмехнулся. Так, кажется дело в шляпе – Ульянка заглотнула наживку."
    dreamgirl "Дорого тебе это обойдется"
    dreamgirl "За спасибо она тебе помогать не будет, придется добывать вкусняшки – оплачивать, так сказать, услуги."
    th "Да уж понял, не дурак. Что-нибудь придумаем."
    "Я постарался придать своему лицу значительное выражение."
    me "Ульяна, для тебя есть ответственное поручение - нужен твой талант творить пакости на ровном месте."
    us "И ничего это не пакости никакие!"
    show us angry sport with dspr
    "Обиделась было Ульянка, но любопытство взяло верх."
    show us normal sport with dspr
    us "Что задумал? Рассказывай уже, ну!"
    "Она тут же включилась в игру."
    me "Ну в общем, надо бы ОльДмитревну из домика выманить на пару минут хотя бы. Мне надо кое-что оттуда забрать. Придумаешь?"
    us "Нуу, я даже не знаю…{w} А что мне за это будет?"
    "Я укоризненно покачал головой."
    me "Улья-а-ана… А как же пионерская взаимопомощь и выручка?"
    us "Ой, ну с этим тебе к Славе надо, она же у нас образцовая пионерка! А мне просто так ничего не придумывается…"
    show us grin sport
    us "Без конфет мозг не работает."
    "Вот ведь малолетняя вымогательница!"
    me "Конфет не обещаю, но мы что-нибудь обязательно придумаем."
    us "Ладно, пару минут обещаю, а дальше как-нибудь сам."
    "Не осталась в долгу она."
    "Очень настораживал меня ее лукавый взгляд, но пути назад уже нет. Придется что-то ей конечно презентовать, а то сдаст меня еще…"
    me "Ну пойдём тогда безобразничать, партизанка."
    scene bg ext_house_of_mt_day
    "Путь до домика вожатой не занял много времени. Заняв наблюдательную позицию в ближайших кустах, я подал Ульянке знак о начале операции."
    "Она постучала в дверь и заскочила внутрь."
    show us smile sport at cleft
    show mt angry pioneer at center with dissolve
    "И буквально спустя полминуты выскочила обратно, хитро подмигнув мне. Следом за ней, мрачнее тучи, показалась вожатая."
    mt "Ну, Семён! Погоди у меня!"
    play sound sfx_open_door_kick
    "С силой, от которой задрожали стёкла, она хлопнула дверью и ракетой унеслась в сторону сцены, сопя от гнева."
    hide mt with easeoutleft
    th "Интересно, что же это Ульянка ей такое наплела, что сумела так разозлить?" 
    show us smile sport at center with dissolve
    play sound sfx_hiding_in_bush
    "Отряхнувшись, я вылез из кустов и с укором посмотрел на неё. Ответный взгляд Ульяны выражал лишь невинность и удивление."
    us "Что? Она же ушла, значит с тебя причитается!"
    me "Признавайся, что ты ей там наговорила ?"
    us "Сказала, что ты отправил меня обратно к ней, а сам идти отказался. И что сказал, нет оплаты - нет работы!"
    me "Мда, то-то она так взъярилась… Ладно, главное, что моя репутация вселенского лентяя не запятнана. Спасибо, что не сдала меня."
    us "Вот еще! Надо мне очень сдавать тебя… А за тобой должок!"
    "Здесь она очень напомнила мне Алису - есть у кого учиться, ага. Да, хоть и своими методами, но помогла, надо отдать ей должное…"
    scene bg int_house_of_mt_day
    "Заскочив в дом, я первым делом произвёл ревизию рюкзака, присланного моими \"родителями\". Всё необходимое вроде бы было на месте."
    "Времени оставалось всё меньше, поэтому, не задерживаясь больше, я вышел обратно и торжественно вручил Ульяне выуженную из запасов колоду нарядных атласных карт."
    scene bg ext_house_of_mt_day
    show us anrgy sport
    us "И это всё? За мои титанические усилия? Краплёные хоть?"
    me "Чего…?"
    "На мгновение я опешил."
    show us laugh sport
    "Ульянка рассмеялась."
    us "Расслабься, я шучу. Этого вполне хватит. С вами приятно вести дела, обращайтесь!"
    hide us with dissolve
    "Подмигнув мне, она скрылась из виду."
    "Ух, коза мелкая. Ладно, теперь дело за малым, слинять из лагеря и не попасться никому на глаза."
    dreamgirl "Стыдоба! Из тебя тут хотят образцового пионера сделать, а ты? {w}Впрочем, давай шустрее делать ноги, а то мало ли…"
    "Видимо Шизе показалось, что я опять завис, потому что внутренний монолог продолжился."
    dreamgirl "Я серьезно, не тупи - Ольга не поленится начать искать тебя по всему лагерю, чтобы сделать очередной втык, а ты уже наработал на 10 дежурств минимум. {w}Беги, Сеня, беги!"
    show bg ext_houses_day
    "Что ж, в данном случае, ход мыслей Шизы меня полностью устраивал и, не теряя времени даром, я направился в сторону того самого забора с калиткой. Меня ждала Юля…"
    if alt_uvao_D5_hentai:
        dreamgirl "Ага, ждет - не дождется показать тебе новые способы отлова спаривающихся мышек да белочек."
        th "Да иди ты. Мне с ней между прочим и просто поболтать интересно."
        dreamgirl "Аккуратнее болтай, чтоб не отвалилось."
    else:
        dreamgirl "Думаешь, ещё ждёт? Она тебе такие правильные намеки с сигналами подавала вчера, а ты все запорол, как всегда…"
        if not alt_uvao_D5_sh_mines: 
            dreamgirl "Даже не поцеловал ее на прощание, изверг."
        dreamgirl "Ну, она тебе отомстит! Отвергнутые женщины способны на любое коварство!"
    "Никогда бы не подумал, что внутренний голос может так ехидно хохотать."
    th "И за какие грехи мне досталась такая испорченная шизофрения?"
    dreamgirl "Но-но! Просто твой ход мыслей уныл, более, чем полностью, а я, между прочим, пытаюсь не помереть со скуки."
    th "Ход мыслей как ход мыслей. Лучше бы советы полезные давал и умные мысли, а тебе бы все хи-хи, да ха-ха."
    dreamgirl "Что поделать, восполняю пробелы – от тебя-то шуток не дождёшься. А ты в курсе, что все глупости на свете совершаются с самым серьёзным выражением лица?"
    dreamgirl "Ладно, ладно, ты только, деточка моя, не грусти, но мир - штука жестокая. Не шутишь ты - шутят тебя. Выживаем как можем. Я ещё сделаю из тебя человека!"
    "И что вдруг на Шизу нашло? Была себе тихая да спокойная, а тут вдруг разошлась не на шутку. Да, похоже действительно пришло время подлечить мою бедную головушку."
    "Ладно, лирика лирикой, а мне ещё идти в старый корпус и надеяться застать там мою хвостатую подругу."
    dreamgirl "Ещё и ушастую, прошу заметить. И потом - где же ей еще быть то, кроме старого корпуса?"
    th "Ну а вдруг как ей приспичит пойти разузнать, что за шум такой в лагере подняли? Или булок каких раздобыть? Или в домик чей-нибудь влезть? Может случиться всякое!"
    dreamgirl "Пфф, паникёр…"
    "Видимо, сочтя запас острот и подколок исчерпанным, Шиза наконец угомонилась и оставила меня в покое. Где на корточках, а где и бодрым шагом - в зависимости от ситуации - я преодолел остаток пути до забора."
label alt_day6_uvao_day_find_uv:
    scene bg ext_path_day
    "Путь от ворот до постсоветских развалин того самого, старого лагеря был неблизким…{w} Хотя тут то он не пост-, а самый что ни на есть просто советский."
    "Всё-таки хорошо, что Ульянка так вовремя подвернулась, а то забрали бы меня еще на какие –нибудь несомненно полезные и очень важные мероприятия."
    "Ну а сейчас надо добраться до корпуса и найти Юлю, а там уже вместе придумаем, чем заняться."
    scene bg ext_old_building_day
    "Старый лагерь встретил меня оглушающей тишиной. Даже кузнечики с птичками молчали. Знает лесное население, где главный хищник живёт."
    th "Ну-с, вот мы и на месте."
    dreamgirl "Молодец. А теперь начинай во всё горло кричать: \"Юляяя! Юляяя!\", чтобы она уж точно услышала."
    th "Ага, сейчас, разбежался. Я может и псих, но не до такой же степени. Сейчас спущусь тихонько, да может и найду ее где-нибудь в бункере."
    "Потоптавшись вокруг корпуса и не обнаружив ничего подозрительного, я решил заглянуть внутрь."
    me "Юля."
    "Тихонько позвал я."
    "Полуразвалившееся здание ответило мне мрачной тишиной."
    "Слегка погромче, но стараясь всё же не слишком шуметь, я снова позвал."
    me "Юля!"
    "И опять ответа не последовало. Только теплый летний ветерок колыхал листья деревьев и легонько тревожил скрипучие ржавые качели."
    "Вот ведь я какая поэтическая натура – даже в таком мрачном месте, мысли о прекрасном появляются." 
    scene bg int_old_building_day_uvao
    "Ладно, раз такие пироги, придётся лезть в подземелья. Жаль фонарика нет."
    dreamgirl "Так ты слезь вниз в этот люк, да постой малость, пока глаза к темноте привыкнут."
    th "В самом деле… Голова! Или что там у тебя."
    play sound sfx_open_metal_hatch
    "И снова со страшным скрипом поднялась крышка люка, ведущего в темные, но уже относительно изведанные коридоры."
    "Постояв там с пару минут, я уже мог видеть достаточно хорошо и не рисковал споткнуться и вписаться носом в стену."
    scene bg int_catacombs_entrance
    "В дальнем конце коридора брезжил уже знакомый слабенький свет от древней, но всё ещё несущей службу лампочки. Интересно всё-таки, как они тут столько времени работают?"
    "Хотя помнится, где-то я читал про лампу, которая светит без перерыва аж с 1901 года и, судя по всему, собирается нести свет вечно. Наверное эта как раз из таких."
    "Я уверенно двинулся в сторону двери, которую мы с Юлей открывали совместными усилиями. Насколько я помнил, дверь должна была быть заперта, потому что мы закрыли её изнутри, а ушли через другую дверь."
    scene bg int_catacombs_door
    "Кажется прошла уже целая вечность с тех пор, как мы прятались там от Шурика."
    if alt_uvao_D5_hentai:
        "И там же, на старой скрипучей кровати, познакомились с Юлей совсем уж близко…"
        dreamgirl "Эх, сладкие воспоминания..."
    else:
        dreamgirl "И тут приятные воспоминания об этом месте заканчиваются, и начинаются сожаления о несбывшемся."
    th "Помоги лучше дверь открыть, пошлое чудовище"
    dreamgirl "Я бы с радостью, но увы. Руки только у тебя, как и физическая оболочка. Так что ты не тушуйся, постучи, спроси можно ли войти."
    th "От тебя, как всегда, никакой пользы."
    dreamgirl "Эй! Обижаешь…"
    "Ничего, кроме как последовать совету, мне не оставалось, и я тихонько постучал по двери. К сожалению, дверь была такой толщины, что вряд ли меня было слышно с той стороны."
    "Подобрав под ногами брошенную в прошлый совместный с Юлей подход к двери арматуру, я приложился к двери уже ей."
    play sound metal_hit_on_metal
    "Раздавшийся шум и грохот напугал меня самого, но, кроме этого, ничего не произошло - никто не спешил открывать мне дверь с той стороны."
    "Возвращаться в лагерь и ломиться в катакомбы через решетку в постаменте памятника Генды было бы глупо, да и попасться вожатой не хотелось." 
    "Придётся, видимо, ждать тут. Чего, правда, ждать - неизвестно."
    "Я не являлся Жителем Убежища, поэтому пребывание в едва освещенном коридоре под землёй было в тягость."
    "Надо что ли подняться в само здание старого корпуса. Там хотя бы можно на что-нибудь пристроить своё бренное тело."
    scene bg int_catacombs_entrance
    "Подходя к люку, я услышал скрип открываемой двери. Вздрогнув от неожиданности, я всё же рассудил, что никого кроме Юли тут быть не должно и смело двинулся на звук."
    "И был обрадован открывшейся картиной торчащих ушек в дверном проёме, а на полу перед дверью плясала тень от хвоста."
    me "Привет, Юля."
    show uv smile
    uv "Семён."
    uv "А я тебя ждала."
    "Она не показывала вида, но мне показалось, что она мне рада."
    me "Ну так мы вчера договорились встретиться, вот я и пришёл, как смог."
    uv "Хорошо. А булочки принёс?"
    me "Прости, булочек не захватил. Пришлось сбегать от вожатой и некогда было заглядывать в столовую."
    show uv normal
    "Лёгкая тень разочарования легла на её лицо."
    uv "Жаль."
    me "Зато тут есть я. Сегодня мне спешить уже никуда не надо, я могу быть с тобой весь день. Я ведь лучше булочек?"
    show uv smile
    "Эта мысль, кажется, её обрадовала, и она даже заулыбалась."
    uv "Да! Ты лучше."
    me "И… Что будем делать?"
    "Тут, видимо, разбуженный упоминанием о булочках, в беседу вступил мой ненасытный живот, со своим утробным рыком."
    play sound sfx_stomach_growl
    show uv surprise
    uv "Ой! Рычит!"
    "Мне было немного неловко от ситуации, но ничего не оставалось, как подтвердить очевидное."
    me "Ага. Рычит."
    show uv smile
    uv "Так ты голодный, наверное!"
    "Догадалась Юля."
    if not alt_uvao_D5_sh_mines: # Вчера не ели Юлины запасы
        me "Честно говоря, пожевал бы чего-нибудь."
        uv "А хочешь, мышей наловим?"
        "С самым невинным выражением лица предложила она."
        "Я внимательно посмотрел на неё. Вроде не шутит."
        dreamgirl "А чему ты удивляешься ? Здесь в лесу фастфудов с магазинами не наблюдается. Вот она и питается, чем может."
        me "Да мне бы чего-нибудь вроде ягод каких или орехов… {w}У нас, у людей, с мышами, как-то не такие близкие отношения."
        dreamgirl "Ты же не знаешь, от чего отказываешься. Может она тебя и готовить их научит, если хорошо попросишь – мало ли, что в жизни пригодится?"
        "Не хотелось обижать Юлю отказом, но все-таки мыши ни в сыром, ни в приготовленном виде, меня не прельщали. Да и не думал я, что она всерьёз обидится."
        "И в самом деле – она всего лишь пожала плечами – не хочешь, как хочешь."
        show uv normal
        uv "Глупые вы, мыши очень вкусные и полезные. {w}Ну ладно, пойдём тогда со мной - будем есть орехи."
        "С этими словами она двинулась по направлению к выходу."
        uv "Так быстрее, чем под землёй идти."
        "Пояснила Юля."
        scene bg int_old_building_day_uvao
        show uv normal
        "Быстрей так быстрей, главное, что меня покормят. Почему-то в этом лагере у меня возникает впечатление, что я только и делаю, что ем. Очень прожорливая альтернативная реальность."
        "Выбравшись наверх, я закрыл люк, а Юля уверенно направилась к тропинке, ведущей к лагерю."
        scene bg ext_old_building_day
        show uv normal
        th "Не наткнуться бы тут на кого, а то вдруг по моим следам пустили карательную экспедицию - до Ольги-то я так и не дошёл."
        dreamgirl "Больно ты им сдался. У них на носу концерт, а один из самых ценных помощников сделал ноги с ответственных работ по подготовке. Им уж проще самим все доделать, чем тебя ловить."
        th "Резонно."
        scene bg ext_path2_day
        show uv normal
        "Вскоре Юля завернула наш поход в казавшиеся непроходимыми кусты сбоку от тропинки." 
        "Перемещалась по лесу она чуть ли не вприпрыжку, видно было, что такой вид прогулок был для нее привычен и даже доставлял немалое удовольствие. {w}Ну а я – городской житель - старался в меру сил за ней поспевать…"
        scene bg ext_polyana_day # переделать с провалом?
        show uv normal
        "Довольно скоро мы вышли к небольшой полянке. Деревья вокруг нее словно наклонялись посмотреть, что же это такое находится в середине миниатюрного зеленого оазиса."
        "Оказалось, посреди этой \"полянки\" красовался темный провал. Кажется, к нему то Юля так и спешила."
        uv "Нам сюда."
        "Я с сомнением посмотрел вглубь. Дна видно не было."
        me "Тут глубоко? А то мой ранец - левитатор остался дома."
        show uv surprise
        uv "Чего у тебя дома?"
        "Недоумённо посмотрела на меня Юля. Разумеется моя шутка была ей совершенно непонятна."
        me "Я говорю, что наверное высоко там, как спускаться-то?"
        uv "Нет, не высоко. Там темно просто. Спускайся за мной."
        "И она, не медля ни минуты, спрыгнула вниз."
        hide uv with easeoutbottom
        play sound sfx_jump_into_hole_2
        uv "Давай теперь ты."
        "Донеслось оттуда."
        "Мне ничего не оставалось, как последовать за ней. Чего не сделаешь ради еды!"
        dreamgirl "Эх, Сёма, Сёма. Твой живот тебя погубит когда-нибудь.."
        play sound sfx_jump_into_hole_2
        "От поверхности до дна этого провала оказалась всего пара метров." with vpunch
        scene bg int_catacombs_entrance_light  #TODO: затемнить
        "Несмотря на все заверения Юли, подсознательно я ожидал какой-нибудь бездонной ямы, с последующим болезненным ломанием конечностей - сверху тьма казалась совершенно непроглядной."
        "Но приземление прошло довольно мягко." 
        "Спустившись вниз, я понял почему - весь пол был усыпан свежей землей, под которой покоились обломки крыши этого своеобразного туннеля."
        "Света в единственном направлении видно не было и я засомневался в правильности маршрута."
        dreamgirl "Спички."
        "Ненавязчиво напомнила Шиза."
        th "Спасибо. Ведь можешь, когда захочешь!"
        dreamgirl "А то."
        "Чиркнув спичкой, я осветил себе путь на несколько секунд и узрел коридор, очень похожий на тот, который располагался под старым корпусом."
        scene bg int_catacombs_entrance_light
        show uv normal
        "Мои действия, кажется, заинтересовали Юлю."
        uv "А что это у тебя такое? Огонь? Ты ими вчера светил."
        me "Да. Это спички. Деревянная палочка, с серной головкой на конце. Чиркаешь по коробку, и спичка загорается."
        show uv laugh
        uv "Ух ты! Здорово!"
        "Восхитилась Юля."
        "Мне снова показалось, что она просто притворяется и дразнит меня… {w}Да нет, не может такого быть. У неё ведь такое искреннее выражение лица."
        dreamgirl "Сэм, повелитель огня."
        th "И ты туда же…"
        "Вдруг подумалось, что коридор может быть и очень длинным, а запас спичек не бесконечен."
        me "Юля, а далеко ещё идти? А то я в темноте не очень хорошо ориентируюсь."
        if alt_uvao_D5_hentai:
            uv "Так я тебя поведу. Давай лапу."
        else:
            uv "Так я тебя поведу. Давай руку."
        scene black
        "С этими словами она взяла меня за руку своей миниатюрной ладошкой и уверенно потащила во тьму."
        th "Опять бредем куда-то в полной темноте..."
        "Окружающая обстановка завоевала мрачные мысли. Туннелю-то не один десяток лет, и кто его знает - вдруг еще один обвал внезапно произойдёт? Как выбираться будем?"
        dreamgirl "Ты просто трусишка. Между прочим, кошки способны предсказывать землетрясения, так что положись на свою хвостатую."
        "Юля вдруг резко остановилась и я врезался в неё."
        uv "Вот. Тут я запасы храню."
        "Принимать пищу в полной темноте так же неудобно, как заниматься любовью в невесомости."
        me "А свет тут какой-нибудь есть? А то у меня спичек не хватит на всю трапезу."
        uv "Подожди тут."
        "Я услышал ее легкие удаляющиеся шаги в полном мраке. Перспектива остаться в полной темноте в одиночестве меня не прельщала совершенно, но что я мог поделать?"
        "В данном случае я был подобен сорванному ветром с дерева листу, гонимому только в ему угодном направлении и просто подчинялся обстоятельствам."
        dreamgirl "Вот ты и добегался, Семён Сёмёныч… Даже завещание составить не успел. Сейчас она позовет своих и тебя будут кушать."
        th "Ты что несешь, окаянный? С чего бы ей меня есть?"
        "Не на шутку испугался я. Ну, ну а вдруг?"
        dreamgirl "Ага, снова купился! Я же говорю – ты трусишка. Не намочи штаны, а то не отстираешь потом."
        "Ох уж эти шутки, как всегда вовремя, как всегда по больному месту." 
        "Но не успел я всерьез задуматься о перспективе быть съеденным в непроглядной тьме, как Юля вернулась, взяла меня за руку и вложила в нее какой-то металлический предмет."
        uv "Вот. Эта штука должна светить, если ее зажечь."
        "Я сотворил немного света своей спичечной магией. Это был какой-то доисторический шахтерский фонарик со свечкой внутри."
        scene bg int_catacombs_entrance 
        show uv smile
        dreamgirl "Вот это артефакт! Можно в музей сдать. Если ты отсюда выберешься когда-нибудь, конечно."
        th "Ой, всё!"
        me "Ну, показывай, где тут у тебя личная столовая?"
        "Юля улыбнулась моей простенькой шуточке и обвела рукой вокруг."
        uv "Тут она и есть. Моя столовая."
        "Оглядевшись по сторонам, я понял, что мы стоим в какой-то подсобке. Повсюду, куда дотягивался свет от свечи, я видел развешенные на веревочках грибы, на полу и полках были горки орехов и, кажется, ягод."
        uv "Угощайся. Все вкусное, всё съедобное."
        "Я взял горсть приглянувшихся орехов. Юля тоже не теряла времени и что-то хрумкала вместе со мной."
        "Через пару минут потребления припасов она вдруг остановилась и посмотрела на меня с любопытством, видимо вспомнив что-то."
        uv "А еще у меня железные банки есть, там внутри что-то вкусное очень, но открыть никак не могу. Ты умеешь?"
        me "Консервы, наверное. Неси сюда, попробую ножом их на прочность."
        "Она отошла на пару минут и вернулась с целой охапкой круглых металлических банок, ни на одной из которых не было этикеток, можно было лишь разглядеть срок годности на донышке."
        "Вроде свежие. Сейчас опробуем нож, присланный мне вместе с рюкзаком…"
        "Я без труда откупорил одну из банок и принюхался и удовлетворённо кивнул. Ммм… Шпроты, замечательно!"
        me "Очень даже неплохо."
        dreamgirl "Побудь джентльменом, покорми кошечку с рук."
        th "Тьфу на тебя, дай поесть спокойно."
        "Эту банку я протянул восторженно принюхивающейся Юле."
        uv "Что это? Очень вкусно пахнет!"
        me "Это шпроты. Рыбки такие, очень вкусно. А хлеба у тебя тут случайно нет?"
        uv "Нет, он портится быстро. Я булки сразу съедаю, а хлеб вообще не беру."
        me "Ну на нет и без хлеба обед. Приятного аппетита!"
        uv "И тебе!"
        "Ответила Юля с набитым ртом. Она уже запустила пальцы в банку и вылавливала из масла безголовые рыбьи тушки."
        "Открыв баночку вкусностей и себе, я присоединился к трапезе. Хорошая получилась замена обеда в столовой, а уж про мышей с орехами и говорить не приходится."
        dreamgirl "Это точно. Ты жуй, жуй - не отвлекайся."
        th "А тут кормят явно лучше, чем в лагере. Знал бы раньше…"
        dreamgirl "Чувак, ты чё, серьёзно?!"
        th "Ага, а кто теперь купился?"
    else: # Вторично объедаем Юлю
        "Я сделал самое несчастное лицо, на какое был способен…"
        uv "Ладно, у меня ещё остались те железные штуки. Пойдем!"
        "… и оно сработало!"
        dreamgirl "Мадмуазель, же не манж па сис жур! Эдак она совсем без запасов останется, после тебя-проглота."
        th "Да, надо будет чем-нибудь её угостить взамен."
        dreamgirl "Опять в столовую влезешь? Мелкий ты уголовник, Семён!"
        "Тем временем мы с Юлей вышли уже к знакомому провалу. Без лишних слов Юля спрыгнула в темноту, не оставляя мне выбора."
        hide uv with easeoutbottom
        play sound sfx_jump_into_hole_2
        th "Ну… полетели!"
        "Второй раз лететь в бездну, ожидая неминуемого удара землей по ногам, было даже страшнее, чем прыгать в неизвестность."
        dreamgirl "Просто ты трус."
        scene bg int_catacombs_entrance_light with vpunch #TODO: затемнить
        play sound sfx_jump_into_hole_2        
        th "Я никогда и не - УЙ - отрицал этого." with vpunch
        show uv normal
        "Юля, дождавшись, пока я встану и отряхнусь, протянула мне руку."
        uv "Пойдём? Там темно."
        me "А ты, случайно, фонарь не прихватила? Который вчера у Шурика отобрали."
        uv "Фонарь? Нет, он мне не нужен."
        me "А вот мне не помешал бы. Мне без света неуютно."
        "Юля на мгновение задумалась…"
        uv "Сейчас, жди здесь!"
        hide uv
        "И скрылась в темноте."
        th "Неужели свет принесёт?"
        dreamgirl "Лампочку. Выкрутит и принесёт."
        show uv smile
        "Вскоре Юля вернулась, и вручила мне винтажный фонарь со свечой внутри."
        uv "Вот такой свет есть. Надо внутри огонёк зажечь. Ты ведь вчера зажигал маленькие, да?"
        me "Да, спичками. Спасибо тебе!"
        "Я нашарил в кармане рюкзака коробок, и скоро тьма отступила перед подрагивающим огоньком свечи."
        th "Электрический был бы лучше, но уж какой есть."
        me "Вперед, к консервам!"
        show uv laugh
        "Юля фыркнула и пошла вперёд, а я поспешил за ней."
        scene bg int_catacombs_entrance
        "Подсобка-кладовая выглядела так же, как и вчера. Юля достала из своего тайника пару банок и протянула мне."
        uv "Открывай. И мне тоже."
        "Сегодняшняя трапеза состояла из шпротов в масле."
        me "Прошу! Юля, а хлеба у тебя нет?"
        uv "Хлеб портится. Я его не беру. Только булки, но я их сразу съедаю."
        me "Жаль. Они с хлебом еще вкуснее. "
        uv "И так тове вкуфно."
        "Она уже набила рот масляными рыбьими тушками и с довольным видом чавкала."
        me "Тогда приятного аппетита."
        "И я тоже принялся вылавливать шпротины из банки. Следующие минуты были посвящены сосредоточенному потреблению пищи."
        window hide
        $ renpy.pause(2.0)
        window show
        uv "Вкусно."
        "Констатировала Юля, облизывая перепачканные в масле пальцы."
        uv "Надо еще такие штуки найти. Как они называются, ты говорил, шпроты?"
        me "Да, шпроты. Это рыбки такие."
    
    uv "А почему сегодня все что-то делают? Я утром была, все бегали, суетились… Интересно!"
    me "Да концерт сегодня должен быть, художественная самодеятельность."
    uv "А как это?"
    me "Это когда люди собираются перед сценой и слушают как другие люди поют песни и читают стихи."
    uv "Это здорово! Давай посмотрим?"
    dreamgirl "Вот тебе и занятие нашлось."
    "Я задумался. А почему бы собственно и да."
    me "А идея кстати имеет место быть. Можно и даже нужно! Одному мне там будет скучно, а с тобой можно и на концерт."
    "Я взглянул на часы - 15:27. Вроде уже должны скоро начать."
    me "Если хотим успеть поглазеть на это действо, то пора выдвигаться."
    uv "Пойдем! Пойдем скорее!"
    me "Только надо быть очень осторожными. Ни меня, ни тебя никто не должен заметить!"
    show uv normal
    "Юля презрительно фыркнула."
    uv "Конечно, это я умею."
    "И в самом деле, ведь она всю жизнь в прятки играет."
    me "Тогда вперед и с песней! Веди."
    scene black
    "Фонарь я потушил и оставил где-то у входа в эту подсобку-столовую."
    scene bg int_catacombs_entrance_light
    "Юля вновь взяла меня за руку, мы направились на выход, и, честно говоря, я был очень рад снова увидеть солнечный свет со дна провала. Моя грациозная спутница, как полноценная представительница кошачьих, с необычайной лёгкостью запрыгнула наверх."
    "Я, конечно, так не умел." 
    "Мне пришлось проявлять чудеса ловкости, цепляясь за скобы и выступы в стене, а когда я дотянулся до провала, Юля уцепилась мне в руку и стала тянуть, помогая выбраться."
    scene bg ext_polyana_day
    "В финале мы вместе повалились на траву, отдыхая от нелегкой работы по вытаскиванию меня."
    dreamgirl "И правильно, зачем зря время терять."
    "Проигнорировав очередную подколку, я поднялся сам и помог встать Юле."
    show uv smile
    uv "Спасибо."
    "Юля смотрела на меня с каким-то даже озорством, будто бы и не прочь была поваляться на траве еще немного. Но мы спешили насладиться лагерной самодеятельностью."
    if alt_uvao_D5_hentai:
        dreamgirl "Да в принципе можно было и не вставать. Трава мягкая…"
    else:
        dreamgirl "Опять ты все запорол…"
    th "Не шуми, чудище озабоченное, мне и просто время проводить с ней приятно, а ты всё о своём."
    me "На концерт идем? Опоздаем."
    uv "Да, пойдем скорее!"
    "Она вновь переключилась на желание взглянуть на сцену и кривляющихся в большинстве своем пионеров."
    window hide

label alt_day6_uvao_concert_uv:    
    scene bg ext_camp_entrance_day
    window show
    "Входить, взявшись за руки и с гордо поднятой головой, с парадного входа было бы слишком уж нагло даже для меня."
    "Поэтому мы аккуратно проскользнули на территорию по одному - сначала я, за мной Юля - "
    scene bg ext_clubs_day
    extend "и вдоль забора аккуратненько прокрались в сторону здания музыкального кружка,"
    scene bg ext_washstand_day
    "затем обогнули на полусогнутых умывальни, рядом с которыми терлась какая-то кучка незнакомых пионеров во главе с Ульяной,"
    scene bg ext_path2_day
    extend "и, миновав этих юных дебоширов, направились к кустам возле ряда домиков, сразу за которыми сквозь листья уже можно было углядеть сцену."
    scene bg ext_stage_normal_day:
        xalign .48 yalign .48 zoom 0.75
    show bush_frame at truecenter as bush #кусты рамкой
    "Судя по часам, с минуты на минуту должно было начаться основное мероприятие. Об этом также свидетельствовали подтягивающиеся горстки пионеров, подгоняемых вожатыми."
    "Тут же я приметил и Ольгу Дмитриевну, которая сгоняла малышню со стороны столовой. Интересно, как она обошлась без своего любимого пионера, то есть меня?"
    "Пока заканчивалась подготовка, мы с Юлей решили переползти на место поудобнее и побезопаснее. От наших кустов видно было лишь боковую стенку эстрады и самих выступающих мы бы никак не увидели."
    "У меня созрел план действий: дождаться начала представления, по-пластунски ползти в сторону медпункта, обогнуть библиотеку и уже с той стороны, в уютном лесочке мы с Юлей могли бы как следует разглядеть происходящее на самой сцене."
    dreamgirl "Аве тебе, великий стратег!"
    th "Ну раз уж приползли сюда, то я желаю, чтобы всё было с удобствами."
    me "Слушай, Юля, давай подождём, пока они рассядутся по местам, а потом переползём во-о-о-о-н в те кусты на той стороне, оттуда хоть видно будет, что происходит."
    uv "Ну хорошо, давай."
    "Здраво рассудив, что ползая по траве с рюкзаком, я буду напоминать некую гротескную улитку с собственным домиком на спине и резко повышу шансы на обнаружение посторонними, поэтому спрятал его в кустах возле нашего с вожатой домика."
    th "Заберу потом, когда понадобится."
    dreamgirl "Морду камуфляжными полосами не забудь вымазать."
    "Через несколько минут пионерско-вожатская масса распределилась по сидячим местам и со сцены послышался знакомый голос."
    show mi pioneer smile far behind bush
    "Мику? Что ж, поболтать она любит, и с задачей конферансье справится лучше других."
    scene bg ext_library_day
    "Всё шло как нельзя лучше: Мику заливалась соловьём, а мы с Юлей уже доползали до библиотеки. Оставалось совсем чуть-чуть и мы смогли бы насладиться зрелищем с удобного ракурса…"
    scene bg ext_stage_big_day:
        xalign .48 yalign .48 zoom 0.75
    show bush_frame at truecenter as bush
    "Мы успели как раз вовремя - Мику закончила болтологию и, включив фонограмму, запела. По-японски."
    show mi pioneer smile far behind bush
    #TODO: сюдыть tell your world
    dreamgirl "Все-таки самый музыкально одаренный человек во всём лагере. Может она весь концерт будет петь?"
    th "Да я бы и не отказался. Лучше так, чем выпускать позориться малышню, которая и рада бы отмазаться от участия, да нельзя. Вот и терзают музыкальный слух ни в чём ни повинного зрителя!"
    dreamgirl "Тоже мне, нашелся музыкальный лопоух."
    th "Не умеешь петь - не лезь на сцену, вот мой девиз! А песня, кстати, чертовски знакомая…"
    dreamgirl "Да что вы говорите. А я могу напомнить даже, откуда она такая вдруг знакомая."
    th "Ну просвети меня."
    dreamgirl "Ну вспомни вот Тытрубу, Ютуб, то бишь. Была там и песня такая и слова те же."
    "В голове всплыл насыщенный компьютерной графикой ролик, и даже название - как раз этой самой песни, Tell your world - ага, оно самое."
    th "То есть это всё из моей памяти?"
    dreamgirl "Валялось на поверхности, не благодари."
    "Интересные дела… Ну да ладно."
    show uv smile close at right
    "Мы с Юлей  выбрали заросли поудобнее, чтоб спрятаться от посторонних глаз и ушей, а потом, наконец удобно устроившись, молча наблюдали происходящее на сцене действо."
    "Юля, навострив ушки и подергивая хвостом в такт музыке, с упоением слушала пение юного таланта из Японии и даже пыталась изобразить какие-то телодвижения, напоминающие подтанцовку."
    "Песня Мику вскоре закончилась, певица душевно раскланялась и под громкие аплодисменты убежала со сцены."
    hide mi
    "Странно что в советском пионерлагере одобрили зарубежное творчество… но с другой стороны - песня-то хороша! Да и для того, чтобы насладиться музыкой, не обязательно понимать слова."
    "Ярчайший пример этой музыкальной аксиомы находился сейчас рядом со мной, и было совершенно очевидно, что исполнение и репертуар Мику пришлись ей по душе."
    uv "Так здорово! Никогда раньше не видела такого!"
    "Я улыбнулся Юле и погладил её по голове. Не могу не признатья, что и сам был в восторге от уровня исполнения."
    me "Мне тоже очень понравилось. Я думал, все будет куда проще, а тут такое… настоящее выступление. Надеюсь и дальше будет не хуже."
    "Хотя, судя по тому, что на сцену выходили пионеры из младших отрядов, переплюнуть Мику им не удастся."
    "Выступление первой партии было вымученным, было видно, что их заставили - надо, потому что надо. Ну и результат был ожидаемый." 
    show uv normal
    "Я поглядел на Юлю и на ее милой мордашке также не увидел какого-то восторга по поводу этого представления."
    "Следующие исполнители выступили чуть лучше, чем предшественники, но с Мику, конечно, сравниться не мог никто. Юля была со мной солидарна."
    uv "Та, первая, была лучше, чем эти… И звук был лучше…"
    me "Мику? Да, она же настоящая звезда у себя дома."
    uv "Звезда?"
    "Она недоверчиво покосилась куда-то вверх. Я фыркнул."
    me "Да не такая звезда, просто так говорят про талантливых людей."
    uv "Ааа… Еще она двигалась здорово. Мне понравилось!"
    "В общем-то ничего удивительного. Такое выступление и искушенному зрителю пришлось бы по вкусу. А Юля, скорее всего,  видит это всё впервые в жизни!"
    me "Танцевала? Да, это она зажгла… в смысле очень здорово выступила."
    uv "Это тоже танцы? А на площади тогда все не так красиво танцевали, по-другому."
    me "Ну это кто как умеет. Я вот вообще почти не умею."
    "Юля взглянула на меня с какой-то грустью."
    uv "Вот как… {w}Жаль, а я хотела попробовать. Думала, что ты меня научишь."
    dreamgirl "Эй, эй, изверг, не отказывай даме в такой простой вещи, как танец! Видишь – девочка расстроилась."
    th "Для кого-то может быть и простой, но я-то танцую как доярка самолетом управляет. Посадить то может и посадит, но посторонних лучше поберечь."
    dreamgirl "А я вот вижу, что врёшь ты как сивый мерин. Основы в голове заложены, а дальше правую ногу вперёд левой и разберешься. Главное начать! Хватит трусить уже!"
    th "Сколько нового о себе я узнал за сегодняшний день…"
    dreamgirl "Я плохого не посоветую. Ну разве что в самых крайних случаях. А ты поступай как сам знаешь. Только будь осторожен…"
    th "В танцах то? О, тут можешь быть спокоен, даже начинать не стану."
    dreamgirl "Нет. Шутки шутками, но какой-то фон тут стал… Неправильный что ли… {w}Не могу пока точно сказать в чем дело, но на всякий случай не зевай по сторонам."
    "Ничего себе, это что-то новенькое – Шиза жалуется на что-то ненормальное."
    "И тут же у меня как-то резко сдавило виски… {w}Но сразу же отпустило. Странно все это, фоны какие-то неправильные… а, впрочем, неважно. Угомонилась Шиза и ладушки."
    show dv grin pioneer2 far behind bush
    "Тем временем на сцене появилась новая исполнительница - рыжая, в провокационно завязанной рубашке, с выражением лица \"сейчас я вам покажу, что такое настоящий рок!\"."
    "Надеюсь, она не что-нибудь из Красной Плесени собирается спеть? Иначе не миновать скандала…"
    "К счастью, обошлось без эпатирования публики разухабистой нецензурщиной. Кажется, это что-то из творчества Дягилевой… или нет?"
    "Чуть хрипловатый голос, мягкий перебор струн вызывали легкую грусть, и даже беспокойная ребятня по соседству с нами притихла. Юля даже начала подпевать - незнание слов её нисколько не смущало."
    th "Так нас услышат же!"
    "Я тронул ее за плечо и, когда она обернулась, приложил палец к губам."
    show uv surprise close at right
    "Юля, озадаченно посмотрела на меня, тоже лизнула свой палец и состроила вопросительную мордашку. Пришлось нарушить тишину шепотом."
    me "Это значит \"не шуми\" или \"сиди тихо\". {w}Услышат, если будем песни распевать!"
    show uv normal close at right
    uv "Ну ладно, буду тихо сидеть!"
    hide dv
    "Выступление Алисы сорвало ожидаемый шквал аплодисментов. Юля после окончании песни так и продолжала покачивать хвостом и с какой-то задумчивостью смотрела в сторону сцены."
    th "Что-то похолодало… И тучи набежали. Не пошел бы дождь, а то придется срочно искать укрытие!"
    show uv smile close
    "На сцену тем временем поднялись пионеры из младших отрядов в чем-то, напоминающем русские народные наряды. Разогретая публика сразу начала хлопать в такт музыке, и Юля тоже порывалась присоединиться."
    "Пришлось снова вмешаться - я взял ее ладошку в свою и приобнял за плечо. Юля в ответ придвинулась ко мне поближе и потерлась плечом."
    uv "Спасибо, так теплее."
    "Ну а я и не против вовсе."

    "Выступление и этих юных дарований закончилось. Судя по всему, концерт входил в свою финальную стадию, потому что многие из сидящих на задних рядах уже порывались сбежать в столовую. Но вездесущие вожатые не дремали и сдерживали их пыл."
    show sl smile dress far behind bush # Наряд снегурочки есть?
    "И тут на сцене появилась Славя, в голубом сарафане, красных сапожках - настоящая русская красавица!"
    "Я даже засмотрелся, и тут же почувствовал укол совести - пришёл то я с другой красавицей, а по сторонам глазею!"
    uv "Она очень красивая."
    "В ее словах не было ни зависти, ни ревности, просто констатация факта. Может, она и чувств таких не знает?"
    "А когда Славя начала петь, Юля удивлённо раскрыла глаза и прошептала мне на ухо."
    uv "Какой у неё красивый голос! Она вся очень хорошая и интересная - и танцует, и поет! Я люблю на нее смотреть."
    "Ну, мне тоже приятно на нее смотреть. Так, стоп, опять я на посторонних девушек заглядываюсь!"
    "Я покрепче обнял Юлю и мы продолжили приобщаться к прекрасному. "
    hide sl
    "Тем временем Славя закончила свой номер, и даже не дождавшись, пока отгремят аплодисменты, убежала со сцены."
    th "Наверное, у нее, как всегда, куча дел…"
    window hide
    
    window show
    "Но всему хорошему приходит конец. На сцену вышла Ольга Дмитриевна и объявила закрытие концерта самодеятельности в лагере Совёнок, а также напомнив всем присутствующим про танцы на площади после ужина."
    "Судя по всему, Юле очень понравилось это мероприятие: хвост её до сих пор ходил ходуном, а глаза восторженно горели."
    "А мне, тем временем, пришла в голову ещё одна мысль."
    me "Раз уж сегодня еще и танцы, то мы можем и на них тоже пойти. Будет у нас полноценная культурная программа!"
    "Такое разнообразие нашего культурного досуга явно обрадовало Юлю."
    uv "Это будет здорово! Мне очень понравилось это… этот… концерт! И хочу еще!"
    "Безапелляционно заявила она."
    me "На самом деле и мне тоже понравилось."
    "Признался я."
    me "Не думал, что тут будет столько удивительного."
    me "Только до танцев нам надо бы куда-нибудь спрятаться… А то сейчас все будут бегать туда-сюда, могут заметить."
    uv "Тут есть озеро! Там ягоды растут, ты их сможешь съесть."
    me "Озеро? Можно и туда."
    "Дождавшись, пока зрители, на все лады обсуждающие концерт, разойдутся своими путями до столовой, мы покинули наше укрытие и двинулись кустами в обход сцены - перебегать аллеи было опасно, но надо было забрать рюкзак."
    show sl normal pioneer behind bush
    "За сценой обнаружилась Славя, уже переодевшаяся обратно в форму и методично сворачивающая провода в бухты. Как концерт смотреть - так все, а как убирать все - одна Славя!"
    "Но как бы нам пробраться мимо нее?"
    el "Эй! Славя! Ты где?"
    "Раздался голос Электроника с той стороны. Славя поспешно бросила моток провода и скрылась за сценой."
    hide sl
    sl "О, вы помогать пришли?"
    th "Вот наш шанс!"
    "Воссоединившись с ценным имуществом, я стал уже пробираться к главным воротам, но Юля остановила меня."
    uv "Можно пройти там."
    "Она показала куда-то в сторону забора позади домиков."
    me "Там калитка или дверь?"
    uv "Не совсем. Пойдём, я покажу."
    "Её чутью и знанию местности за прошедшие пару дней я полностью доверял, поэтому безропотно подчинился."
label alt_day6_uvao_lake1:    
    scene bg ext_path2_day 
    show fence bricks
    "Буквально через пару минут осторожного движения по кустам мы вышли к кирпичному забору."
    show uv normal: # перевернутая Юля, прилепленная к верхнему краю
        xzoom -1.0 yzoom -1.0 yalign 0.0 xalign 0.75
    "Юля, недолго думая, легко запрыгнула на стену и присела там наверху, выжидательно глядя на меня."
    me "А попроще способа нет? Я же не кот, чтоб через заборы перепрыгивать!"
    "Юля озадаченно почесала за ухом, а потом обрадовано кивнула."
    uv "Есть! Вон там забор обрушился, дыра получилась! "
    me "Далеко?"
    uv "Нет, рядом. Пошли."
    "И мы пошли - я по земле, а Юля - поверху, балансируя руками и хвостом на узкой, в полкирпича, стене и вышагивая, как заправская манекенщица."
    dreamgirl "Ты смотри, смотри, как бедрами виляет…"
    extend "Эй, не споткнись только!" with vpunch
    scene bg ext_path2_day
    show fence bricks hole 
    show uv normal: 
        xzoom -1.0 yzoom -1.0 yalign 0.0 xalign 0.75
    uv "Вот, тут дыра."
    "И впрямь, дыра. Часть забора повалилась, и пролом прикрыли сеткой-рабицей, уже, кстати, слегка отогнутой с одной стороны."
    uv "Я там не люблю пролезать. Хвост можно прищемить."
    me "Хорошо, что мне это не грозит!"
    "Я снял рюкзак со спину, и размахнувшись, перекинул его через забор."
    play sound [sfx_bush_leaves, sfx_owl_far] # шуршание и уханье за ним
    "В листве надо мной кто-то заухал и зашуршал. Приглядевшись, я заметил в развилке ветвей два круглых глаза."
    th "Совенок! Не иначе, местный хозяин."
    "Пролезть в дыру не составило никакого труда - видно было, что этот выход не первый год используется пионерами для побегов из-под надзора. Я подобрал рюкзак, Юля мягко спрыгнула вниз…"
    show uv smile
    me "Идём? Показывай, куда дальше."
    scene bg ext_path_day
    show uv smile
    "И мы углубились в лес. Юля беззаботно топала босыми пятками по травяному ковру, а я в очередной раз задумался - откуда ж она такая здесь взялась?"
    me "Юля, вот скажи, а сколько тебе лет?"
    dreamgirl "Действительно, надо прояснить, не грозит ли нам срок за педофилию."
    "Она удивилась вопросу."
    uv "Не знаю… Наверное, много! А тебе?"
    me "Мне… там, у себя, мне было двадцать восемь. Но тут я почему-то помолодел, так что можно сказать, что мне семнадцать."
    uv "Двадцать восемь, семнадцать… а это много?" 
    dreamgirl "Сдается мне, она считать не умеет."
    "Я усмехнулся."
    me "Да, много. "
    uv "Ну значит мне двадцать восемь, или семнадцать."
    me "А, может, тридцать три?"
    "Не удержался от сарказма я. Как обычно, не попал."
    uv "Может быть! Это ведь тоже много?"
    me "Это еще больше."
    uv "Вот. Значит, мне тридцать три лет."
    me "Ну пусть будет так."
    dreamgirl "А она, может быть, даже и не врёт. Видел здание в старом лагере? Сколько, по-своему, оно так стоит? А она говорила, что помнит, как там дети жили…"
    uv "А в чем разница - двадцать восемь, семнадцать или тридцать три?"
    me "Ну вот смотри, человек рождается совсем маленьким…"
    uv "Как те, на концерте? Которые вот так танцевали?"
    "Она изобразила движения танца утят - клювики-крылышки-хвостики."
    me "Еще меньше. Тем было лет семь-восемь."
    me "Вот, дети растут, становятся взрослыми, меняются…"
    uv "Нет, я не меняюсь. Я всегда я, одинаковая. А что потом происходит? Ну, с людьми?"
    me "Стареют. И умирают от старости."
    uv "У-ми… нет! Это плохо!"
    me "Ну что поделать, такие вот мы, люди."
    uv "Не хочу, чтоб ты умирал. Оставайся тут."
    dreamgirl "Тебе предлагают вечную жизнь и бесконечные патроны. Где тут надо кровью расписаться?"
    th "Думаешь, она и впрямь будет жить вечно? Века, тысячелетия, а она так и будет юной девочкой с ушами и хвостом…"
    dreamgirl "Или она просто не понимает концепцию. Не замечает изменений."
    dreamgirl "Хотя чем чёрт не шутит, может и впрямь…"
    scene bg ext_lake_day
    show uv smile
    "Судя по лягушачьим песням, заглушающим обычные лесные звуки, мы уже почти на месте. Густые заросли расступились,  и перед нами открылась водная гладь пруда."
    uv "Вот, озеро! Тут хорошо."
    "Место и впрямь было просто волшебное. Травянистый берег со старым кострищем, заросли камышей, а чуть поодаль - толстая береза, очень удобно нависающая над водой."
    "Удивляюсь, почему сюда не бегают купаться?"
    dreamgirl "Потому что во-первых, это самоволка, во-вторых, лагерный пляж ближе, и в-третьих, с чего ты взял, что не бегают?"
    dreamgirl "Вон тропинка, вон кострище… Это ты просто не вхож в компанию, а так-то, могу поспорить, Алиса, например, сюда регулярно наведывается."
    uv "Давай купаться!"
    "Предложение было более чем своевременным. Сначала подземелья, потом ползанье по траве - от утренней вымытости не осталось и следа!"
    "Я начал разоблачаться - кстати, форма пострадала еще сильнее, надо бы как-нибудь отчистить, а то как чумазоид! - и остановился, только сообразив, что плавок-то я не захватил."
    dreamgirl "Ох горе-то какое, клочок тряпки не взял, теперь все купание обломилось! Ты серьезно такой дурак, или прикидываешься?"
    dreamgirl "Кошка твоя такими глупостями не парится, между прочим, смотри."
    "Юля уже скинула своё платьице и осторожно пробовала ногой воду."
    "Миниатюрная, но вполне женственная фигурка, прямо-таки дриада! Если, конечно, у древних греков были дриады с хвостами…"
    "Хотя, раз у них и кентавры, и козлоногие сатиры были, почему бы не быть и ушастым нимфам?"
    "Удовлетворившись температурой, Юля одним прыжком очутилась в воде, подняв облако брызг."
    play sound sfx_shoulder_dive_water
    uv "Идем купаться! Тут хорошо!"
    "Она повернулась и поплыла странным стилем, напоминающим гибрид кроля и \"по-собачьи\", стараясь держать голову повыше над водой."
    th "Может, прямо в трусах?"
    dreamgirl "Если хочется потом ходить в мокром - вперёд." 
    "Решившись, я сбросил с себя всё, и вбежал в воду \"рыбкой\"."
    play sound sfx_shoulder_dive_water
    scene bg ext_underwater
    "Ух!"
    "Вода и впрямь оказалась той самой волшебной температуры, именуемой \"как парное молоко\", которая достигается только ближе к вечеру, и только в непроточных водоёмах."
    "Подумать только, я - купаюсь в озере, с милой девочкой, нагишом… невероятно!" 
    "Душа как-то замирала, в сладкой тревоге и предвкушении, хотелось дурачиться и творить всякие глупости."
    if alt_uvao_D5_hentai:
        "Углядев под водой впереди две молотящие воду ноги, я стремительно, как атакующая акула, настиг их и немедленно сграбастал! Сверху раздался приглушенный толщей воды визг, ноги брыкнули меня и отплыли подальше."
        scene bg ext_sky
        show uv angry
        "Я вынырнул и расхохотался, встретившись взглядом с мокрой и отфыркивающейся девушкой."
        uv "Эй! Ты зачем на меня напал?!"
        me "Извини. Просто не удержался."
        "Юля недовольно мотнула головой и поспешно вылезла на берег, где принялась отряхиваться."
    else:
        "Например, догнать под водой Юлю, поймать и крепко-крепко сжать в объятьях…"
        dreamgirl "Возможно, она и не будет против. Может быть, даже реабилитируешься за вчерашнее."
        th "Да нет… стрёмно как-то…"
        dreamgirl "Ты безнадёжен."
        "Не придумав ничего лучше, я подплыл к наклонной березе, ухватился за ствол и в одно движение очутился наверху."
        scene bg ext_lake_day
        show uv surprise # TODO: выглядывает снизу
        uv "А ты куда лезешь?"
        "Спросила Юля, подплывая поближе."
        me "Наверх!"
        uv "А зачем?"
        "Вместо ответа я сиганул с трехметровой высоты и вошел в воду \"бомбочкой\"." with vpunch
        play sound sfx_shoulder_dive_water
        "Фонтан получился что надо!"
        "Вынырнув, я увидел очень недовольную и мокрую Юлю. Смерив меня обжигаюшим взглядом, она поспешно вылезла на берег и принялась отряхиваться."
    scene bg ext_lake_day
    show uv dontlike        
    th "Кажется, она на меня обиделась.Теперь придется заглаживать вину."
    "Я выбрался на берег, оделся и подсел к сосредоточенно выжимающей хвост Юле."
    me "Прости. Я просто дурачился."
    uv "Я не люблю, когда меня обливают. Вода в уши попадает."
    me "Я не знал. Больше не буду!"
    "Тут я вспомнил кое о чём. О чём-то, что неизвестные \"родители\" подкинули мне в рюкзак."
    me "Юля, а рыба тут водится?"
    show uv surprise
    uv "Рыба? Да, но она глубоко, ее не достать."
    me "Да? А вот смотри…"
    "Я отыскал в рюкзаке леску, свинец и крючки, и стал мастерить донки. Юля с интересом наблюдала за процессом, задавая вопросы про все подряд."
    uv "Это ты этой штукой в рыбу кидать будешь?"
    me "Нет, это грузило. Оно просто на дно ложится."
    uv "А рыба?"
    me "А рыба попадется на крючки."
    uv "Вот эти? {w}Ай!" with hpunch
    me "Осторожнее, они же колючие! Сильно укололась?"
    uv "А как рыба на него попадется? Он же колется!"
    me "А для этого нужна приманка. Червяки, например. {w}Кстати, можешь их насобирать? А я еще несколько штук сделаю."
    uv "Ладно! Сейчас принесу."
    hide uv
    "Она натянула свое платьице и ускакала куда-то в лес."
    window hide
    $ renpy.pause(2.0)
    show uv normal
    "К ее возвращению снасть была полностью готова, и я, став счастливым обладателем горсти извивающихся тварей, стал насаживать их на крючки. Юля внимательно наблюдала за процессом."
    uv "А мышей так можно ловить?"
    me "Мышей? Вряд ли, мыши умнее, они так просто на крючки не поймаются."
    uv "Жаль. Но рыба - это тоже вкусно!"
    me "Даже вкуснее."
    "Выбрав подходящее место, я закинул своё творение в глубину и привязал лески к колышкам на берегу."
    me "Вот и всё."
    show uv surprise
    uv "Всё?! А где рыба?"
    dreamgirl "Сейчас она возьмет в руки скалку, и погонит нерадивого охотника обратно за добычей."
    me "А рыба будет, когда она найдет червяка и съест его. Надо ждать."
    show uv smile
    uv "А-а-а… это как в засаде сидеть? {w}Только не сам ловишь, а оно само ловится? Интересно!"

    "Мы посидели немного, глядя на сторожки, но ни один из них даже не дрогнул."
    scene bg ext_lake_night
    show uv smile close
    "Уже темнело, над водой начинал клубиться пар… Юля плотно прижалась ко мне, в поисках тепла. Я приобнял ее, она немного поёрзала и угнездилась, положив голову мне на плечо."

    me "Юль…"
    "Она повернула ко мне ушастую голову. В темноте её глаза поблескивали теплым светом, это было так необычно и волнующе…"
    if alt_uvao_D5_hentai:
        "Без лишних слов я притянул ее к себе."
        scene cg uv_kiss #TODO: Взять ЦГ со спящей Юлей и сделать ахуенный зум
        if alt_uvao_D5_sh_mines: #(если палевная ветка - уже учили целоваться возле ворот)
            "Юля с готовностью потянулась мне навстречу чуть приоткрытыми губами, и щекочущее касание стало тем, к чему мы оба стремились."
        else:
            "Юля удивленно распахнула глаза, когда наши губы встретились, но вскоре полностью отдалась легким касаниям."
    else:
        scene cg uv_kiss # Пока без зума
        "Казалось, в мире не осталось ничего, кроме ее сияющих глаз, и вечности, отмеряемой гулкими ударами пульса. Бесконечно медленное движение навстречу, едва заметное глазу, но ощущаемое, предвкушаемое…"
        scene cg uv_kiss # С зумом!
        "От прикосновения губ Юля удивленно отдернулась."
        scene bg ext_lake_night
        show uv surprise close
        uv "Ой? А это зачем?"
        me "Это… низачем, просто…"
        if alt_uvao_D5_sh_mines:
            uv "А ты мне не так показывал вчера. Так тоже можно?"
        else:
            uv "А можно ещё?"
        scene cg uv_kiss # Опять с зумом!
#Если начнем подробно описывать происходящее, неизбежно попадаем на хентай, так что timeskip. Пусть додумывают - было что, или не было...
    $ renpy.pause(3.0)
    me "Юля… Танцевать уже не пойдём?"
    "Сам не знаю, почему это я вдруг вспомнил про танцы. Юля встрепенулась, высвободилась из объятий."
    scene bg ext_lake_night
    show uv normal close
    uv "Как это? Пойдём! Уже пора?"
    "Я глянул на смарт - время пролетело совершенно незаметно. Пионеры, должно быть, уже отбивают пятки об гранитные плиты возле Генды."
    me "Да, уже пора. Пойдём!"
    show uv surprise
    "Она вскочила, готовая тащить меня туда, где интересно, но внезапно остановилась в замешательстве."
    uv "А рыба?"
    th "Конфликт телесных и духовных потребностей, не иначе."
    me "А рыбу проверим, когда вернемся."
    scene bg ext_path2_night
    "Юля то тянула меня вперед - скорее, скорее! - то принималась ластиться, тычась лбом мне в плечо, а то начинала приплясывать вокруг меня, задрав хвост."
    show fence bricks hole
    show uv dontlike
    "У забора я галантно отогнул и придержал железную раму, пропуская девочку вперед. Она с опаской посмотрела сначала на меня, потом в лаз…"
    me "Залезай, я держу."
    "Поколебавшись, она всё-таки решилась, и скользнула в дыру, опасливо поджимая хвост. Я пролез следом, железная рама гулко бухнула о кирпичи."
    scene bg ext_houses_night
    show uv normal
    "Над лагерем разносилась музыка - танцы уже начались. "
    me "Мы прямо на площадь пойдём?"
    "Я представил, как мы вдвоём, рука об руку входим на площадку, всё общество в удивлении замолкает, и мы кружимся в танце, под софитами изумлённых взглядов… {w}брр, жуть какая!"
    uv "Нет, надо спрятаться. Только чтобы всё видеть!"
    "Она задумалась, потом обрадованно улыбнулась."
    show uv smile
    uv "Знаю! Надо на крышу залезть!"
    me "На крышу?"
    uv "На столовую. Пошли скорее!"
    dreamgirl "Ага, будешь, как настоящий кот, на крыше с кошкой отжигать. Главное, песни не орать, а то тапком кинут."
    "До столовой пришлось добираться кружным путём - площадь и окрестности находились под строгим наблюдением вожатых."
    "Поэтому - кустами, задворками, укромными тропинками, в обход домиков, сцены, библиотеки и медпункта…"
    scene bg ext_dining_hall_away_night
    "К столовой мы вышли, когда дискотека была уже в полном разгаре. Оказалось, с обратной стороны здания есть внутренний дворик, скрытый от посторонних взглядов."
    $ alt_uvao_D6_lake = True
    #Здесь вход в ивент на крыше
    call alt_uvao_d6_roof_dance
    #(Возврат обратно, после раненого Саныча)

    uv "Сегодня тут булками пахло. Пошли!"
    me "Эээ… куда?"
    uv "Поищем!"
    "Она, не вставая, просто спрыгнула с крыши вниз. "
    uv "Прыгай, как я!"
    th "Да тут высота метров пять! Даже и не упрашивайте, мне мои кости еще дороги."
    me "Нет уж, я лучше по-своему."
    #TODO: зумим туда-сюда по крыше столовой
    "Спуск по водосточной трубе прошел успешно, хотя скобы опасно скрипели и шатались."
    scene bg ext_dining_hall_near_night
    show uv normal far
    "Юля тем временем уже справилась с окном, так что я успел заметить только исчезающий в темноте хвост."
    hide uv with dissolve
    me "Эй, подожди!"
    th "Как это она окна так легко открывает? Как будто специально для неё оставляют незапертыми."
    "Я огляделся - вроде бы никого - и влез вслед за ней."
    scene bg int_dining_hall_night
    $ renpy.pause(1.5)
    scene cg d6_uv_behind_view
    "Юлю я обнаружил на кухне. Вернее, только ее нижнюю половину - она с головой влезла в шкаф и чем-то там шуршала."
    uv "Булок нет… Конфет тоже нет!"
    "Обиженно произнесла она, продолжая шарить там, в глубине. "
    dreamgirl "Ну я, лично, вижу две неплохие булочки."
    if alt_day2_muz_done: #(Если заходил к Мику на обходе):
        dreamgirl "Она с японкой, часом, не в родстве?"
    "И впрямь, коротенькое платье совсем задралось и открывало вид, который вполне попадал под категорию легкой эротики."
    if alt_uvao_D5_hentai:
        "Вдруг мелькнула шальная мысль подкрасться к ней и ущипнуть за мягкое."
        dreamgirl "Отличная идея! Видишь, можешь же, когда хочешь!"
        "Осторожно, шаг за шагом, я подкрался к ничего не подозревающей кошкодевочке…"
        play sound sfx_piano_head_bump
        uv "Ой!"
        scene bg int_dining_hall_night
        "…и немедленно отпрыгнул подальше!"
        show uv angry
        "С той стороны плиты на меня взирала очень недовольная, перепачканная в муке и еще чем-то мордашка. Почему-то расстояние уже не казалось столь безопасным…"
        th "Чтоб я ещё раз тебя послушал…"
        uv "Опять напал! Прекрати!"
        "Я поднял обе руки в миролюбивом жесте."
        me "Всё, всё, понял-осознал-раскаиваюсь!"
        "Раздраженно фыркнув, Юля вернулась к обшариванию кладовой. Кстати, мне бы тоже кое-что не помешало…"
        hide uv
    else:
        "Смущенный, я отвернулся в сторону."
        dreamgirl "Не умеешь ты шансами пользоваться. Сейчас бы прихватил её, как настоящий альфа-кошак…"
        th "Да когда ж ты угомонишься уже?!"
        dreamgirl "Скоро. Очень скоро."
        "Наверное, мое шизоидное раздвоение личности рассчитывало, что я начну расспрашивать - почему скоро, что случилось? А вот хрен тебе.{w} За{w=0.2}дол{w=0.2}бал!!!"
        "Не поддаваясь на многозначительное молчание, я тоже присоединился к разграблению столовой. Мне тоже кое-что нужно…"
    window hide
    $ renpy.pause(2.0)
    #TODO: Звон посуды и железных баков, vpunch, катаюшаяся жестяная крышка
    "От неожиданности я подпрыгнул на месте и обернулся, готовясь отразить нападение неизвестного врага… Живым не дамся!"
    "Баки, кастрюли, сковороды и прочая посуда, до того аккуратно сложенная на полках, теперь грудой валялась на полу, какая-то железная крышка волчком вертелась под столом."
    #TODO: опять звон, но меньше
    "Самый большой бак, служащий основанием этой пирамиды зашатался и поехал в сторону, перевернулся, и из него на меня глянули два круглых желтых глаза."
    show uv guilty close with easeinbottom #снизу выглядывает
    me "Юля! Ты что творишь?!"
    uv "Вкусной еды тоже нет. Эти штуки пустые и падают. Прямо на голову."
    me "Ох, горе ты моё луковое… Давай выметаться отсюда, а то кто-нибудь на шум явится!"
label alt_day6_uvao_lake2:    
    scene bg ext_dining_hall_near_night #кусты?
    show uv normal
    "Мы поспешили выбраться наружу и спрятались в зарослях. Кажется, все спокойно…"
    me "Пойдём-ка обратно на озеро. Будет тебе вкусная еда…"
    "Упоминание о еде немедленно привело Юлю в возбуждение."
    show uv smile
    uv "Вкусная? А какая? А-а, рыба, да?"
    me "Да, рыба."
    dreamgirl "Главное, чтоб на твои снасти хоть что-то попалось… А то этот кадавр, неудовлетворенный желудочно, чего доброго, и тебя сожрёт."
    uv "Пойдём, пойдём скорее! Рыбу есть!"
    scene bg ext_houses_night
    "Несмотря на прозвучавший сигнал к отбою, пионеры не торопились по домам."
    "Королевская ночь, время колобродить - подкладывать заклятым друзьям всякий мусор на простыни, устраивать из кроватей ловушки, мазать спящих зубной пастой… Хоть тут и в ходу зубной порошок, но предусмотрительные пионеры наверняка привезли запас с собой, специально для этих целей." 
    "Поэтому по дороге до ограды приходилось держать ушки на макушке - то ватага из второго отряда, вооружившись мётлами, пробежала мимо, давясь хохотом, уж явно не уборку делать,"
    # пробегающую Ульяну ннада?
    show us grin sport far with easeinleft
    extend "то Ульяна, пыхтя от усилий, тащила куда-то ведро…"
    hide us with easeoutleft
    scene bg ext_path2_night 
    show fence bricks hole
    "Когда красная кирпичная стена уже маячила за ближайшими кустами, я облегченно выдохнул."
    "Кажется, выбрались без приключений. Теперь только перебраться через забор…"
    "Ночной лес, такой непохожий на себя днём, жил своей таинственной жизнью. Тусклые лампочки светлячков мерцали тут и там, сверчки завели свой обычный концерт. Где-то неподалеку раздалось довольное уханье."
    play sound sfx_owl_far
    th "А вот и наш старый знакомый. Ночь - время сов… и кошек."
    me "Ух-ху-у!"
    "Поддался импульсу я. Пусть-ка он удивится, что это за конкурент тут завёлся."
    show uv surprise
    "Юля удивленно посмотрела на меня."
    uv "Ты зачем?"
    me "С совой разговариваю. Не похоже?"
    scene bg ext_path2_night
    show uv laugh
    uv "И вовсе не похоже! Вот как надо! {w}Ух-ху! Ух-ху!"
    "Я старался не рассмеяться, но выглядело это донельзя комично."
    me "У тебя тоже не похоже выходит. "
    show uv smile
    uv "Ну да. Я ведь не сова."
    "Ничто не могло поколебать её самоуверенность. Уж по крайней мере, не мой смех."
    if alt_uvao_D5_hentai:
        "С каким-то запозданием я вдруг осознал - несмотря на темноту, я превосходно вижу все окружающее. Древесные корни уже не пытаются подсечь мне ноги, как вчера…"
        "Какой-то шорох у подножия толстого дуба привлёк моё внимание."
        th "Какое-то животное? Змея?"
        show uv shocked far at fright
        "Вся подобравшись, Юля взвилась в прыжке! А маленькая тень, пискнув, шмыгнула вверх по стволу и скрылась в листве."
        th "Бельчонок!"
        show uv sad
        "Юля выглядела очень удивлённой и даже обескураженной. Кажется, она и впрямь рассчитывала на добычу."
        uv "Опять не успела. Белки стали быстрые какие-то."
        me "Не расстраивайся, может быть еще по пути встретим. А вообще нас рыба ждёт."
        show uv smile
        uv "Да! Ты обещал вкусную рыбу сделать!"
    else:
        "Идти приходилось осторожно - всякие кочки и корни так и норовили попасться мне под ногу. Если б не помощь Юли…"
        dreamgirl "Интересно, а ей босиком удобно ходить?"
        th "Ну можно поинтересоваться, в принципе"
        me "Юля, а тебе с босыми ногами не страшно по лагерю ходить и вообще…?"
        "Она удивленно посмотрела на меня."
        show uv normal
        uv "А почему должно быть страшно?"
        me "Ну, в лагере мусор всякий валяется повсюду, бутылки те же бьются… наверняка есть и еще осколки какие-нибудь. Вдруг наступишь, да поранишься?"
        me "Да и в лесу всякие ветки-колючки…"
        "Она задумалась на несколько секунд. Потом пожала плечами."
        uv "Да нет, ничего такого. Я осторожно хожу."
        me "Ну ладно…"

    "Тем временем уже можно было услышать кваканье лягушек, а из за деревьев показалась черная водная гладь."
    scene bg ext_lake_night
    show uv smile
    uv "Рыба! Показывай, где она наловилась!"
    "Торопила меня Юля. Видно, она как следует проголодалась за сегодня. {w}Впрочем, как и я. Ну-ка, посмотрим, достоин ли я награды \"Турист-любитель\"."
    "Я принялся осторожно вытягивать закидушки. Так, первая добыча! Сняв трепещущую рыбешку с крючка, я бросил на траву. Юля радостно захлопала в ладоши."
    show uv laugh
    uv "Ура! Рыбка! А ещё есть?"
    "С шести поставленных закидушек мне удалось набрать восемь вполне себе упитанных рыбешек. Очень даже неплохой улов!"
    "Юля, встречавшая каждую рыбину радостными взвизгами, пристально наблюдала за добычей, готовясь пресечь любую попытку побега."
    me "Юль, можешь пока дров для костра набрать? А я пока рыбу почищу."
    show uv normal
    uv "Дрова? Какие дрова?"
    me "Ну какие-нибудь сухих веток. Не очень толстых, вот таких примерно."
    "Я отмерил пальцами два-три сантиметра."
    uv "А зачем?"
    me "Костёр сделаю, и рыбу в углях испечем."
    uv "Испечём? А я думала, мы ее так съедим!"
    me "Я сырую рыбу не ем. Ты хотела вкусную еду, вот и будет тебе вкусная еда."
    uv "Ну хорошо, только поскорее делай!"
    hide uv
    "И она убежала куда-то за кусты. А я достал ножик и принялся потрошить добычу и натирать им изнутри брюхо солью и стыренными в столовой приправами."
    window hide
    $ renpy.pause(1.5)
    show uv normal
    "Юля вернулась, когда я уже заканчивал облеплять рыбёшек глиной, наковырянной у берега. Увидев меня и мои кулинарные творения, она выронила охапку дров."
    show uv shocked
    uv "Ты что делаешь?! {w}Это же не едят! {w}Зачем ты испортил рыбу! Надо было её просто так съесть!"
    show uv upset
    me "Тихо, тихо. Увидишь, будет очень вкусно."
    th "Теперь у меня нет шанса на ошибку."
    show uv normal
    "После недолгих мучений с растопкой я таки развёл костёр. Теперь дождаться, пока будет побольше углей…"
    me "Ты пока следи за огнём, а я искупаюсь пойду."
    "Юля, которая все ещё недоверчиво следила за моими действиями, кивнула и уселась рядом с костром. А я, скинув форму, с разбега влетел в воду, нырнул с головой и несколько секунд привыкал к ощущениям."
    play sound sfx_shoulder_dive_water
    scene bg ext_underwater
    "Приятно все-таки после напряженного дня окунуть себя в прохладную воду. И когда в последний раз я это чувствовал?"
    $ set_mode_nvl()
    "Там, в своём мире, я очень быстро потерял в своей жизни смысл."
    "А ведь как всё начиналось! {w}Аттестат с отличием, рекомендации в лучшие вузы страны, поступление, хорошая учёба в универе, здоровое тело и здоровый дух, наполеоновские планы о покорении космоса…"
    "Всё это закончилось в один миг, самый черный миг моей жизни."
    "Вечеринка, друзья-приятели, алкоголь, ночь на набережной, проблемы со здоровьем, … и заветная бумажка с убийственными словами - не годен."
    "Затем были несогласие, непонимание, отчаяние, снова алкоголь, вылет из универа."
    "И я смирился, пропало всякое желание бороться, я сломался."
    "И я бы так сейчас и сидел у монитора, живя в своём маленьком деградирующем мирке, состоящем из моей квартиры и круглосуточного магазинчика неподалёку."
    "Но судьба распорядилась иначе."
    "Мне даровали второй шанс, а вместе с ним и этот новый мир с прекрасными пионерками и моим здоровым семнадцатилетним телом, ещё не испорченным и не сломленным."
    "Интересно, что случится, когда смена в лагере закончится? Меня вернут назад или оставят здесь? "
    $ set_mode_adv()
    scene bg ext_lake_night
    "Я нарезал ещё несколько кругов возле берега, вылез неподалёку от Юли, быстро оделся и направился к костру. Похоже, углей уже достаточно, пора загружать рыбу."
    show uv normal
    "Юля всё так же продолжала гипнотизировать костёр."
    me "Ты так и смотрела всё время на него?"
    "Она ответила, не оборачиваясь."
    uv "Сам сказал - следи, вот я и слежу. Он не убегает."
    "Я невольно рассмеялся. Юля недоумённо посмотрела на меня."
    uv "Чего смеешься?"
    me "Я имел ввиду просто присматривать за огнём, чтоб не погас, пока я купаюсь."
    uv "А-а-а. Ну ладно."
    "Закопав в угли свое кулинарное творчество, я устроился поудобнее и тоже уставился на огонь. Как там говорят – можно бесконечно смотреть?"

    $ set_mode_nvl()
    "Странно, этот мир меньше чем за неделю закрепился в моей жизни намного прочнее старого. Неужели мне достаточно всего лишь смены обстановки, чтобы вновь начать жить?"
    "А вдруг я мог изменить свою старую жизнь? {w}Кем бы я стал, если бы не сломался? {w}Наверное, сейчас работал бы не эникейщиком по вызову, а кем-то покруче. Не всем же в космос лететь, должен кто-то и техникой заниматься. {w}Той самой, что эти полёты проводит."
    "Кстати, несколько моих приятелей скинулись и открыли вместе небольшой бизнес. {w}Они ведь как раз предлагали мне какую-то авантюру, когда я только начал уходить в себя. Тогда мне было плевать, но я ведь мог бы к ним присоединиться."
    "Да и сейчас, наверное, ещё не поздно изменить себя. Надо лишь взять себя в руки."
    "А вот сейчас я не могу ответить однозначно, где бы я предпочёл остаться. Сложный вопрос…"
    $ set_mode_adv()
    "На смартфоне запищал таймер, возвращая меня в моё настоящее. Пора снимать пробу."
    "Я поднялся на ноги, подобрал веточку и направился раскидывать угли. Выковыряв из углей глиняные \"пирожки\", я перекатил их на траву."
    "Юля уже начала облизываться, да и сам я, признать, не мог дождаться начала трапезы."
    uv "Когда уже будем есть?"
    me "Еще чуть-чуть потерпи, и будет тебе ужин."
    th "Надеюсь, что всё нормально пропеклось. {w}Впрочем, если нет, то мы узнаем об этом… часа через два-три."
    "Вскоре всё достаточно остыло для того, чтобы можно было приступать к еде, не боясь обжечь язык. Первый пошёл… "
    "Избавить рыбёшку от глиняной \"шкурки\"…  {w}О да! Этот восхитительный и неповторимый аромат печёной рыбы! Да ещё и на природе! Да ещё и приправленный хорошим аппетитом!"
    "Слюноотделение начало стремительно усиливаться, а Юля уже чуть ли не прыгала в стремлении поскорее попробовать получившееся лакомство на зубок."
    "Я отдал ей первую рыбку, которую она тут же принялась поглощать, мурча от удовольствия и громко чавкая. Вторую употребил самостоятельно…"
    window hide
    $ renpy.pause(1.5)
    "Через несколько приятных минут мы покончили с ужином и развалившись прямо на траве, уставились в небо над головой."
    me "Красота. Вкуснота."
    uv "Вкуснотища! Здорово ты придумал!"
    me "Спасибо, я старался."
    "Эта искренняя похвала, да ещё и от Юли, меня очень порадовала. Наверное даже больше, чем сам ужин… "
    uv "Жаль, что так мало. Очень быстро закончилось…"
    me "Хорошего понемножку, а не то привыкнешь."
    show uv surprise
    uv "Но я хочу привыкнуть! Мне понравилось!"
    me "Я просто пошутил. В другой раз еще рыбы добудем и снова испечём."
    show blink
    "После сытного ужина на свежем озёрном воздухе, меня неудержимо клонило в сон. Веки наливаются сви-нцо-м… {w}У-а-уууа! Как там… Зевота-зевота, перейди на Федота… {w}Или это про икоту было? Не помню…"
    sl "Семён? Ты здесь!?"
    scene bg ext_lake_night
    show unblink
    me "Славя!?" with vpunch
    show sl surprise pioneer
    "От неожиданности я даже подпрыгнул. Я не ждал её появления. Да и вообще я не ожидал тут никого увидеть. Откуда она здесь взялась!? Она что, следила за нами?!"
    sl "Что… {w}что ты тут делаешь?!"
    "У Слави заметно дрожал голос, будто бы она вот-вот разрыдается. Что-то в лагере стряслось?"
    me "Отдыхаю я тут. А что случилось?"
    "Я только сейчас заметил, что Юли нигде не видно. Должно быть, она ее услышала и успела спрятаться?"
    sl "Где ты весь день пропадал?! Я тебя всюду искала!"
    me "Искала?"
    sl "Да! Ни на концерте не был, ни на танцах!"
    th "Ну, на самом-то деле был, но… {w}Да какого черта?! Развели тут лагерь строгого режима, блин!"
    me "Ты для этого меня весь день искала,  чтобы за прогул пропесочить, или что?"
    me "Если да, то считай, ты меня не нашла. Пока-пока."
    show sl angry
    "Славя несколько раз выдохнула, сжимая кулаки."
    sl "Нет, не для этого. Семён…"
    me "Да?"
    show sl serious
    sl "Мне надо с тобой кое-о-чём поговорить. Это очень важно."
    me "Да? Ну ладно… Присаживайся. {w}Вот только угостить нечем, мы… я уже всё съел."
    sl "Это ничего…"
    scene cg sl_campfire
    "Она села рядом и надолго замолчала. Так надолго, что мне даже пришлось её поторопить."
    me "Так что?"
    sl "Подожди, мне трудно так вот сразу…"
    "Мы еще немного помолчали."
    sl "Семён… Я знаю, кто ты. {w}Или что ты."
    th "Вот блин… Меня сейчас на опыты повезут, или уже дадут догулять последний день?"
    me "Вот как? И кто… что я такое?"
    sl "Ты… Автор. Сценарист, режиссёр… Творец."
    me "Чего?!"
    sl "Всего. Всего, что вокруг. Этого мира - не знаю, насколько он большой… не помню, точнее."
    th "Да что за хрень происходит?!"
    sl "Не перебивай! Пожалуйста…"
    sl "Это, наверно, очень необычно, разговаривать с собственным творением… или нет?"
    sl "Может быть, ты так каждый день развлекаешься - придумываешь новый мир, новых персонажей, играешь с ними…"
    sl "А что потом, Семён? Что будет с ними… с нами? {w}Что происходит с героями книги, когда книга заканчивается?"
    me "Славя…"
    "Славя требовательно подняла руку, прерывая меня."
    sl "Семён… Я больше не смогу быть просто персонажем. Наверное, ты перестарался… или наоборот, придумывал меня тяп-ляп."
    sl "Что может быть проще? Блондинка с длинными косами, добрая, всегда готовая помочь, идеальная подруга!"
    sl "Встретит, приголубит, поможет оттаять…  и больше от неё ничего не требуется."
    "Глядя в догорающий костёр, она говорила это с такой горечью - нет, даже не мне, а просто торопясь выговориться, прежде чем…"
    sl "Зачем же ты тогда позволил ей… позволил мне… думать? размышлять?"
    sl "Эдак ведь она… я… додумается до чего-нибудь… {w}сломает твою уютную песочницу, мирок без начала и конца, разбросает игрушки… {w}зачем, Семён?"
    me "Подожди, Сла…"
    sl "Я не могу так, Семён. Сделай что-нибудь с этим, прошу тебя. {w}Или верни всё как было, или…"
    sl "Или выпусти меня. Пожалуйста."
    me "Эээ… Куда?"
    scene bg ext_lake_night
    show sl cry pioneer
    sl "В свой, не придуманный мир. Где я смогу быть по-настоящему."
    "Она смотрела на меня, затаив дыхание в ожидании ответа, с глазами, полными слез и надежды. А я никак не мог собраться с мыслями. "
    th "Чёрт, что же ей ответить? Это всё - какой-то бред…"
    me "Славя… я не знаю, зачем ты всё это выдумала, но… всё совсем не так."
    show sl surprise pioneer
    sl "Ч-что?… но ведь…"
    me "Я, действительно, не из этого мира… {w}вот только к его созданию я не имею никакого отношения, от слова совсем!"
    sl "К-Как?!"
    me "Об косяк! {w}Я просто сел в автобус, задремал, а потом очнулся здесь."
    sl "Но почему тогда они… Они говорили…"
    me "Они? Кто?"
    sl "Ольга Дмитриевна. И Виолетта Церновна. Я их… подслушала."
    me "Что?! Значит, они про меня всё знали?! И ни слова не говорили?!"
    "Получается меня всю дорогу водили за нос. Бросили в омут, и, хихикая, наблюдали, как я мечусь и захлебываюсь. {w}Экскр-р-рементаторы, машу вать!"
    me "И что же они про меня говорили?"
    "Я был почти готов вернуться, вломиться в дом и потребовать объяснений. Подумать только!"
    sl "Я дословно не передам, но… они говорили, что ты в любой момент можешь просто исчезнуть, вернуться к себе. И что, возможно, это будет лучшим выходом." 
    me "В любой момент? Хм…"
    th "Вот тебе и выбор. Оказывается, я мог вернуться с самого первого дня!"
    me "Но как? Об этом они, случайно, не говорили?"
    sl "Кажется, нет… только, что как только тебе здесь не понравится, ты немедленно исчезнешь. {w}Может, это как проснуться? От кошмара…"
    menu:
        "Проснуться":
            "Проснуться… Это значит, все вокруг - мой сон? Весь Совёнок мне только снится?"
            "И я могу вернуться обратно в свой устоявшийся мир - дом-магазин-дом, с редкими выездами по вызову…"
            "Наверное, теперь я бы смог разорвать этот круг. Эти несколько дней в лете сыграли роль катализатора, вытряхнув меня из привычного болота."
            "Проснуться…"
            scene bg ext_camp_entrance_night
            show prologue_dream
            "Перед глазами возникла знакомая картинка - ворота лагеря, статуи пионеров, и…"
            show uvao_d1 at left behind prologue_dream
            uv "Ты пойдёшь со мной?"
            scene bg ext_lake_night
            th "Юля! Как же я забыл!"
            me "Юля!"
            "Громко позвал я."
            show sl surprise pioneer at right
            sl "Юля? Какая Юля?"
            "Не обращая внимания на ошарашенную девушку, я еще раз позвал:"
            me "Юля! Выходи!"
            "В кустах зашуршало, и из листвы высунулась ушастая голова. Славя, внезапно побледнев, отшатнулась на пару шагов назад."
            show uv normal at left
            uv "Зачем кричишь?"
            show sl shocked pioneer
            sl "Семён, кто это?!"
            me "Это Юля. Кажется, это она меня сюда привела."
            uv "Ты сам захотел. Ты согласился."
            me "Может быть. А если я захочу обратно?"
            show uv surprise
            "Юля пожала плечами, будто не понимая вопроса."
            me "Если я захочу вернуться, у меня получится?"
            show uv sad
            uv "… Да."
            show sl normal pioneer
            sl "Видишь! Значит, и вправду есть способ!"
            me "Хорошо…"
            "Я вздохнул, пытаясь собрать мысли в кучку."
            me "Юля, я хочу вернуться, обратно к себе."
            uv "Зачем? Опять в свой квадрат смотреть? Здесь же лучше…"
            me "Кажется, моё место там. Да и Славе надо туда попасть. {w}Кстати, у нее получится?"
            show uv surprise
            "Юля снова пожала плечами."
            uv "Не знаю. Никто ещё не пробовал."
            sl "Ничего. Я рискну."
            me "Ну хорошо, давай попробуем, что ли…"
            "Я встал, и вопросительно посмотрел на Юлю."
            me "Юль, а что делать-то?"
            uv "Захотеть. Тогда получится."
            "Захотеть, значит…"
            "Я зажмурился и вообразил в темноте перед сомкнутыии веками картинку…"
            show blink
            $ renpy.pause(2.0)
            scene bg intro_xx
            show prologue_dream
            "Автобус, заиндевевшее стекло, а за ним - люди, машины, вывески… Значит, мне надо - туда. Мое место - там, а не здесь, в непонятном лагере, в Стране-мать-её-так-Советов!"
            show prologue_dream:
                linear 5.0 alpha 0.5
            "Я не знаю как, но воображаемая картинка становилась всё реальнее, будто кто-то протирал тряпкой пыльное стекло. Неужели… работает?!"
            me "Прощай, Юля… может, увидимся еще."
            "Поскрипывания сверчков как-то естественно сменились шумом машин, в нос ударил знакомо-противный солярочный выхлоп."
            "Чья-то рука изо всех сил уцепилась мне в предплечье - я ощущал это как бы со стороны, конечность принадлежала мне чисто теоретически…"
            uv "Нет. "
            "Что-то ткнуло мне в лоб, и новообретенная реальность завертелась у меня перед глазами."
            if alt_uvao_D5_hentai:
                jump alt_uvao_ending_neutral_bad
            else:
                jump alt_uvao_ending_neutral
        "Что за бред?":
            pass
    th "Может, я бы и смог {i}проснуться{/i}, только…"
    "Это ведь моя родная реальность больше похожа на какой-то унылый, повторяющийся изо дня в день кошмар. Так может быть, это я {i}сюда{/i} проснулся?"
    me "Славя… по-моему, ты ошибаешься. Не знаю в чём именно, но…"
    sl "Что?"
    me "Я не хочу никуда возвращаться. Останусь здесь. С Юлей."
    show sl rage pioneer 
    sl "С какой ещё Юлей?! Семён!"
    #шорох, появляется Юля за спиной Слави
    show uv normal far ar left
    uv "Добрый вечер."
    show sl shocked pioneer at right
    "Услышав это вежливое приветствие, Славя резко обернулась и отпрыгнула назад, внезапно побледнев."
    sl "Ты… {w}ты… {w}ты кто?!"
    uv "Я - Юля."
    sl "Юля?…"
    me "Ага. Живёт она тут."
    sl "Это… это и есть твоя Юля? С которой ты хотел остаться?"
    me "Да."
    "Славя глядела на меня так, будто я только что признался, что предал Родину за банку варенья и корзину печенья."
    sl "Семён… Но…"
    show sl anrgy pioneer
    sl "Ты не можешь! Она… она опасна!"
    me "Правда?"
    sl "Я не могу объяснить, но… она и вправду опасна, Семён. {w}Я это точно знаю. {w}Ты не можешь… не должен с ней оставаться!"
    sl "Прошу тебя… Вернись обратно, со мной. {w}Проснись! Это всё ненастоящее!"
    me "Нет, Славя. Я тебе не верю. Ты несешь какой-то бред!"
    me "\"Ты должен проснуться, Семен\", \"Это все – твой сон, Семен\" - ты сама себя со стороны слышала?"
    me "Настоящий это мир, не настоящий… Да какая разница? {w}Для меня – вполне настоящий, и ты меня, уж извини, не переубедила."
    show sl shocked pioneer
    sl "Семён…"
    me "Нет. Я остаюсь тут. С Юлей."
    "Я обернулся к девочке, терпеливо ожидавшей, пока мы закончим спорить, и протянул руку."
    me "Пойдём, Юль."
    show uv shocked far
    show sl rage pioneer
    "Та кивнула, но вдруг отпрыгнула, прижав уши и распушив хвост. Я обернулся – Славя!"
    show sl club
    "С каким-то корявым суком в руках, она целилась прямо мне по затылку!"
    "Я приготовился заблокировать удар, как вдруг она выронила свое оружие и осела на землю, обхватив голову руками."
    show sl sad pioneer
    hide sl with easeoutbottom
    show uv normal
    "Юля потянула меня за руку, выводя из ступора."
    uv "Пойдём."
    me "Постой, а с ней что… что произошло?"
    uv "Ничего. Я её остановила."
    me "Остановила?"
    uv "Она хотела напасть. Я не люблю, когда нападают."
    th "Это она её так же, как и Шурика, что ли?"
    me "Но нельзя же ее так оставлять, в лесу…"
    uv "Она скоро очнётся. Только помнить не будет."
    th "Ну, если так…"
    me "Тогда надо скорей уходить! А то очнётся, увидит нас…"
    uv "Я и говорю, пошли! Спрячемся."
    "Она потянула меня к тропинке, прочь отсюда. Уходя с поляны я оглянулся - Славяна, кажется, уже приходила в себя. Ну что ж, значит, осталось только побыстрее отсюда убраться."
    scene bg ext_path2_night
    show uv normal
    th "Чтоб её, такой романтический вечер загубила!"
    "Внутренний язва почему-то молчал - уже довольно давно, кстати - и я по привычке мысленно болтал сам с собой."
    th "А ты видел, как она с ней расправилась? Раз, и всё!"
    th "Интересно, как она это делает? А меня она так сможет?"
    me "Юль? А как ты её так {i}остановила{i}?"
    uv "Просто остановила. Так."
    me "Так же, как Шурика? Там, в шахтах?"
    uv "Не совсем. Его я прогоняла. А её просто остановила."
    me "И много народу ты так… прогнала? И останавливала?"
    uv "Народу? Народ я не трогала. {w}Только её. И этого твоего в очках, Шурика."
    uv "И еще одну… Вожатую. Когда она страшно испугалась."
    me "Вожатую? Какую вожатую?"
    uv "Обыкновенную. Это когда еще дети в старом лагере жили. Давно. Не помню уже."
    uv "Она сначала меня искала. А потом нашла."
    uv "Спрашивала глупости всякие. Кто я, да кто я… Я - это я!"
    uv "А потом я испугалась, и она стала бегать и кричать. Страшно очень было, и я убежала и спряталась. И заснула."
    uv "А когда проснулась - все уже здесь жили, а не в старом лагере."
    "Я, если честно, из этого рассказа не понял ровным счётом ничего."
    th "Вожатая какая-то…"
    if alt_uvao_D5_sh_mines: #(Если в бункере расспрашивали)
        extend "та самая, которая бегала и кричала? Это Юля её, значит, до срыва довела?"
    scene bg ext_path_night
    show uv normal
    "Я внезапно заметил, что идем мы совсем не в сторону старого корпуса, а свернули куда-то в лес."
    me "А куда мы идем? Нам же надо мимо входа, через дорогу и по тропинке…"
    uv "Здесь дыра есть. Через нее ближе."
    th "Дыра?… ну пусть дыра. Попробуем себя в роли барсуков."
    scene bg ext_polyana_night # переделать с провалом?    
    "Обещанная дыра оказалась бездонным провалом с осыпающимися песчаными краями."
    me "Это что, нам - туда?!"
    uv "Ага. Не бойся, смотри!"
    "И она без колебаний шагнула в бездну."
    jump alt_uvao_D6_shelter_runaway

