#Разговор в домике перед изолятором
label alt_day6_uvao_isolator_house:
    window hide
    scene bg int_house_of_mt_sunset
    play ambience ambience_int_cabin_day fadein 4
    play music music_list["what_do_you_think_of_me"] fadein 4
    window show
    "Я зашёл в наш с вожатой домик."
    me "Вы меня искали, Ольга Дмитриевна?"
    "Вожатая лежала на кровати с книгой в руках. Интересно, что читают вожатые? Не любовные же романы? Хотя с нашей станется."
    show mt normal pioneer with dissolve
    mt "Да, Семён. У меня к тебе серьёзный разговор."
    "Сказала Ольга Дмитриевна, откладывая книгу в сторону. Я присмотрелся к обложке. Так я и думал. \"Унесённые ветром\", Маргарет Митчелл. После дамского чтива серьёзные разговоры самое то."
    mt "Семён."
    "Мягко начала вожатая, принимая сидячее положение."
    mt "Я ведь всё равно узнаю, где ты был вчера. Лучше расскажи всё сам. Как говорится, признание своей вины смягчает наказание."
    me "Опять начинается?"
    "Возмутился я. Впрочем не очень сильно."
    show mt angry pioneer with dspr
    mt "Да, Семён, да. Начинается. Это моя обязанность - знать всё обо всех."
    show mt normal pioneer with dspr
    mt "А также моя обязанность заботиться обо всех. Вот ты отсутствовал половину дня."
    mt "Усталый, голодный. А потом твои родители с меня спрашивать будут ведь, почему их мальчик так исхудал."
    me "Да не был я голодный."
    "Возмутился я."
    me "Меня Юля покормила орехами…"
    show mt surprise pioneer with dspr
    "И тут же зажал себе рот рукой. Блин! Что же я наделал?!"
    mt "Это кто такая?"
    "Нахмурилась вожатая."
    me "Девочка одна знакомая."
    "Вяло попытался отбрыкиваться я. Но вожатую было уже не остановить."
    show mt normal pioneer with dspr
    mt "Семён, не ври мне хоть в этот раз. Я знаю всех детей в этом лагере. Никакой \"Юли\" среди них нет."
    th "Что же делать? Эх, была – не была. Да и что мне теперь уже остаётся, загнанному в угол?"
    if not alt_uvao_D4_viola_morning: #в 4 дне проговорились ОД
        me "Помните, я вам рассказывал про своё видение - девочка с кошачьими ушами и хвостом? {w}Так вот она на самом деле существует. Да-да!"
    else: # в 4 дне с утра беседовали с Виолой
        me "Я про легенду лагерную - девочку-кошку. Мне Виола рассказала тогда, и я ее встретил!"
    me "Её зовут Юля. Она живёт в катакомбах под старым корпусом, ловит мышей и делает запасы грибов на зиму.{w} Вчера я ходил к ней в гости провёл там всю первую половину дня."
    show mt surprise pioneer with dspr
    "Видимо это невероятное объяснение произвело впечатление на вожатую, потому что глаза её округлялись всё больше и больше с каждой моей фразой. А в конце этой пространной речи она смотрела на меня уже с неподдельным испугом. Более того – я мог бы поклясться, что вожатая была в ужасе!"
    show mt angry pioneer with dspr
    mt "Семён! Ты, с этой кошкой! Никогда не смей больше подходить к ней! Она опасна!"
    mt "Ты с ней контактировал! Ты мог пострадать!"
    "Кажется она немного успокоилась."
    mt "Сейчас мы немедленно пойдём к доктору Виоле. Тебя надо обследовать."
    show mt normal pioneer far with dissolve
    "И она вскочила с кровати, направившись в сторону двери."
    me "Да со мной всё нормально!"
    "Но к сожалению, слова мои не возымели никакого эффекта. Пришлось встать и пойти вслед за вожатой."
    scene bg ext_house_of_mt_day
    "Вожатая буквально проволокла меня по лагерю, от домика "
    scene bg ext_square_day
    extend "через площадь "
    scene bg ext_aidpost_day
    extend " к медпункту. Все мои попытки объяснить, что поводов для паники и спешки нет, были мастерски проигнорированы."
    scene bg int_aidpost_day
    "В строение с красным крестом мы вломились, не утруждая себя буржуазными пережитками в виде стука в дверь."
    #show cs normal glasses_thru # очки на глазах
    #show mt normal pioneer #без панамы, ибо неслась от домика. Может заодно shocked?
    cs "Вообще-то неплохо бы стучаться."
    "Сказала Виола, не оборачиваясь. Лежащий на кушетке Электроник попытался смущенно натянуть рубашку…"
    # Кого обрабатывать Виолой будем - Шурика или Электроника после его очередного общения с Женей? У Электроника есть голый спрайт, наденем ему одни штаны для приличия... --перегаррет
    cs "Лежи, лежи… {i}пионер.{/i} Я еще не закончила обработку твоих… ран."
    mt "Виола, у нас ЧП."
    cs "Пять минут подождёт?"
    mt "Нет."
    cs "Ладно, пионер. Свободен. В следующий раз будь осторожнее."
    "Выпущенный на свободу Сыроежкин не заставил просить себя дважды - оделся в две секунды и испарился. В другое время я б полюбопытствовал, где это он умудрился так интересно пораниться, но сейчас…"
    cs "Ну и с чего вдруг такая спешка? Что стряслось?"
    mt "Кошка наша случилась. Помнишь, Семён вчера с утра куда-то пропал? А он, оказывается, все утро с ней по старым шахтам бегал!"
    #show cs normal glasses
    "Виола пристально посмотрела на меня, покусывая дужку очков."
    cs "Ну, пионер… Это правда?"
    th "Может, соврать? Скажу, что все придумал, чтобы вожатую позлить… Да какого черта, вообще?!"
    me "Да, правда!"
    "Виола неопределенно хмыкнула, Ольга же снова напустилась на меня."
    mt "Вот! Слышала?! И что теперь с ним делать? Это же… это… просто катастрофа!"
    cs "Пока еще ничего страшного не произошло, так что не сгущай краски, Ольга."
    mt "Не сгущай?! У меня тут тридцать человек детей под опекой, ты понимаешь, чем это все грозит?!" # уточнить количество детей, может где-то упоминается
    th "Это она к чему вообще?…"
    cs "Понимаю, понимаю. Ну и что ты предлагаешь делать? Звонить и срочно всех эвакуировать? Пока повода нет."
    mt "Когда повод будет - будет уже поздно!"
    th "Какая еще эвакуация?!"
    cs "И тем не менее, панику разводить рано. Ты ведь понимаешь, общая эвакуация - это необратимо? Объект будет загажен с концами, только закрывать."
    mt "А что делать-то?!"
    cs "Снимать штаны и бегать!{w} У нас всего два дня осталось. Закроем смену как обычно, к следующему периоду все устаканится."
    mt "А с ним-то что предлагаешь делать?"
    cs "Да ничего. Выпороть его, конечно, не мешало бы, но это не наш метод.{w} Посидит тут, завтра вместе со всеми сядет в автобус и прости-прощай."
    me "Да вы… это же… Вы не имеете права!"
    "От подобной перспективы я даже стал заикаться, но мои возмущеные тирады не произвели ровно никакого впечатления."
    cs "Помолчи, пионер. Ты даже не понимаешь, что происходит, и чем чреваты твои эскапады с аномалией."
    me "С кем? Это с Юлей-то?!"
    mt "Это он ее так окрестил. Юля её зовут, говорит…"
    cs "Интересно… впрочем, неважно.{w} Семён, здесь у нас кое-что посерьезнее обычного пионерского лагеря, как ты понял. Весьма важный научный проект, мирового уровня."
    cs "И мне совершенно не улыбается все закрывать по вине бестолкового попаданца. {w}Посидишь в изоляторе сегодня-завтра, ничего с тобой не случится."
    if alt_uvao_D4_viola_morning:
        cs "Надо было тебе, пионер, сразу мне все рассказать. Сам виноват."
    # TODO:
    # Запирают в изоляторе, обещают принести еды. 
    # Сидим, пробуем на прочность двери и окна, удивляемся - это же не СИЗО, а медпункт в пионерлагере, нахрена решетки на окнах? 
    # Грустим, шиза предлагает завывать блатняк
    # Приходит Славя с припасами, мелькает мысль подгадать момент и вырваться силой... но как-то не хочется бить девочку железным судном
    # Славя забирает посуду и предлагает - а хочешь, я тебя выпущу?