# Отдыхаем у домика МТ, встречаем Юлю.
label alt_day6_uvao_mt_house:
    Чем занять себя благородному дону до вечера? Пойти мячик попинать с Ульянкой ? Или на речку потихоньку свалить ? А, ничего мне на самом деле не охота, пойду-ка я лучше отдохну. Буквально только глаза прикрою. Буду решать архиважную проблему - на каком боку удобнее провести следующие пару часов.
    Ш: «Ну и ленив же ты, братец. Что, сил для игр и роста требуется ой, как много?»
    С: «Конечно много. Мне ещё вечером Славю разговаривать. Кто знает, что она от меня хочет.»
    В самом деле: Очень Важный Разговор – это вам не просто разговор. 
    Да, этот разговор стоит обдумать. О чём бы он ни был. И отношение Слави ко мне тоже. Она, видимо, с самого начала оказывала мне какие-то знаки внимания, а я, увлечённый поиском ответов, похоже ничего вокруг не замечал. Но ничего, мы ещё наверстаем упущенное.
    Блин, и о чём я только думаю ? Я, «человек в футляре», человек, больше всего на свете ценящий собственную независимость, интроверт, боящийся, как огня, общества людей, человек избравший своим жизненным кредо девиз «Просто оставьте меня в покое» -  и обдумываю какие-то планы на, подумать только, отношения с девочкой. Возможно длительные и далеко идущие.
    Я боюсь признаться в этом самому себе, но кажется лагерь изменил меня. И изменения мне нравятся. Да, ассимиляция произошла не сразу, но сейчас я уже не то безвольное, рефлексующее существо, шагнувшее в ворота лагеря неделю назад.
    Поэтому надо вести себя соответственно  - плечи расправлены, голова прямо, походка твёрдая, уверенная. Характер нордический, стойкий.. Да, над характером ещё надо поработать, конечно.
    За этими размышлениями я не заметил, как подошёл к нашему с вожатой домику. В кустах зашуршало и Юлин голос, сдавленный от сдерживаемого смеха, позвал.
    Ю (Юля) : -Семён, иди сюда. 
    Меня как будто ледяной водой из ведра окатили. По спине побежали весёлые стайки мурашек, походка тут же утратила всю свою твёрдость, а плечи снова втянулись на положенное им место. 
    С: -Кто, я?
    Спросил я у кустов. Неожиданно севшим голосом.
    Ю: -Ты конечно. Смешной. Здесь же кроме тебя никого нет.
    У меня в ушах снова зазвучали все предостережения Виолетты Церновны: «..аномалия опасна..», «..страдает психика..», «..вегетативное состояние..», «..держаться подальше..».
    jump alt_day6_uvao_concert